nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM10LL_CSE_PRAM;/*!< (@ 0x00000028) CSE PRAM10LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM10LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM10LU; /*!< (@ 0x00000029) CSE PRAM10LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM10LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM10HL; /*!< (@ 0x0000002A) CSE PRAM10HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM10HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM10HU; /*!< (@ 0x0000002B) CSE PRAM10HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM10HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM11_CSE_PRAM;/*!< (@ 0x0000002C) CSE PRAM 11 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM11_CSE_PRAM_b;
    } ;

    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM11LL_CSE_PRAM;/*!< (@ 0x0000002C) CSE PRAM11LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM11LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM11LU; /*!< (@ 0x0000002D) CSE PRAM11LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM11LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM11HL; /*!< (@ 0x0000002E) CSE PRAM11HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM11HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM11HU; /*!< (@ 0x0000002F) CSE PRAM11HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM11HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM12_CSE_PRAM;/*!< (@ 0x00000030) CSE PRAM 12 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM12_CSE_PRAM_b;
    } ;

    struct {
      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM12LL_CSE_PRAM;/*!< (@ 0x00000030) CSE PRAM12LL register.                             */

        struct {
          __IOM uint8_t RAM_LL  : 8;            /*!< [7..0] RAM_LL stores the first 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM12LL_CSE_PRAM_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM12LU; /*!< (@ 0x00000031) CSE PRAM12LU register.                                     */

        struct {
          __IOM uint8_t RAM_LU  : 8;            /*!< [7..0] RAM_LU stores the second 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM12LU_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM12HL; /*!< (@ 0x00000032) CSE PRAM12HL register.                                     */

        struct {
          __IOM uint8_t RAM_HL  : 8;            /*!< [7..0] RAM_HL stores the third 8 bits of the 32 bit CRC                   */
        } CSE_PRAM_EmbeddedRAM12HL_b;
      } ;

      union {
        __IOM uint8_t CSE_PRAM_EmbeddedRAM12HU; /*!< (@ 0x00000033) CSE PRAM12HU register.                                     */

        struct {
          __IOM uint8_t RAM_HU  : 8;            /*!< [7..0] RAM_HU stores the fourth 8 bits of the 32 bit CRC                  */
        } CSE_PRAM_EmbeddedRAM12HU_b;
      } ;
    };
  };

  union {
    union {
      __IOM uint32_t CSE_PRAM_EmbeddedRAM13_CSE_PRAM;/*!< (@ 0x00000034) CSE PRAM 13 Register                                  */

      struct {
        __IOM uint32_t BYTE_3   : 8;            /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
        __IOM uint32_t BYTE_2   : 8;            /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
        __IOM uint32_t BYTE_1   : 8;            /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
        __IOM uint32_t BYTE_0   : 8;            /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
      } CSE_PRAM_EmbeddedRAM13_CSE_PRAM_b;
    } ;

