nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t TP5        : 1;            /*!< [8..8] Trusted Protect                                                    */
      __IOM uint32_t WP5        : 1;            /*!< [9..9] Write Protect                                                      */
      __IOM uint32_t SP5        : 1;            /*!< [10..10] Supervisor Protect                                               */
            uint32_t            : 5;
      __IOM uint32_t TP3        : 1;            /*!< [16..16] Trusted Protect                                                  */
      __IOM uint32_t WP3        : 1;            /*!< [17..17] Write Protect                                                    */
      __IOM uint32_t SP3        : 1;            /*!< [18..18] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP2        : 1;            /*!< [20..20] Trusted Protect                                                  */
      __IOM uint32_t WP2        : 1;            /*!< [21..21] Write Protect                                                    */
      __IOM uint32_t SP2        : 1;            /*!< [22..22] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP1        : 1;            /*!< [24..24] Trusted Protect                                                  */
      __IOM uint32_t WP1        : 1;            /*!< [25..25] Write Protect                                                    */
      __IOM uint32_t SP1        : 1;            /*!< [26..26] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP0        : 1;            /*!< [28..28] Trusted Protect                                                  */
      __IOM uint32_t WP0        : 1;            /*!< [29..29] Write Protect                                                    */
      __IOM uint32_t SP0        : 1;            /*!< [30..30] Supervisor Protect                                               */
            uint32_t            : 1;
    } AIPS_OPACRD_b;
  } ;

  union {
    __IOM uint32_t AIPS_OPACRE;                 /*!< (@ 0x00000050) Off-Platform Peripheral Access Control Register            */

    struct {
            uint32_t            : 4;
      __IOM uint32_t TP6        : 1;            /*!< [4..4] Trusted Protect                                                    */
      __IOM uint32_t WP6        : 1;            /*!< [5..5] Write Protect                                                      */
      __IOM uint32_t SP6        : 1;            /*!< [6..6] Supervisor Protect                                                 */
            uint32_t            : 21;
      __IOM uint32_t TP0        : 1;            /*!< [28..28] Trusted Protect                                                  */
      __IOM uint32_t WP0        : 1;            /*!< [29..29] Write Protect                                                    */
      __IOM uint32_t SP0        : 1;            /*!< [30..30] Supervisor Protect                                               */
            uint32_t            : 1;
    } AIPS_OPACRE_b;
  } ;

  union {
    __IOM uint32_t AIPS_OPACRF;                 /*!< (@ 0x00000054) Off-Platform Peripheral Access Control Register            */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TP5        : 1;            /*!< [8..8] Trusted Protect                                                    */
      __IOM uint32_t WP5        : 1;            /*!< [9..9] Write Protect                                                      */
      __IOM uint32_t SP5        : 1;            /*!< [10..10] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP4        : 1;            /*!< [12..12] Trusted Protect                                                  */
      __IOM uint32_t WP4        : 1;            /*!< [13..13] Write Protect                                                    */
      __IOM uint32_t SP4        : 1;            /*!< [14..14] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP3        : 1;            /*!< [16..16] Trusted Protect                                                  */
      __IOM uint32_t WP3        : 1;            /*!< [17..17] Write Protect                                                    */
      __IOM uint32_t SP3        : 1;            /*!< [18..18] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP2        : 1;            /*!< [20..20] Trusted Protect                                                  */
      __IOM uint32_t WP2        : 1;            /*!< [21..21] Write Protect                                                    */
      __IOM uint32_t SP2        : 1;            /*!< [22..22] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP1        : 1;            /*!< [24..24] Trusted Protect                                                  */
      __IOM uint32_t WP1        : 1;            /*!< [25..25] Write Protect                                                    */
      __IOM uint32_t SP1        : 1;            /*!< [26..26] Supervisor Protect                                               */
            uint32_t            : 1;
      __IOM uint32_t TP0        : 1;            /*!< [28..28] Trusted Protect                                                  */
      __IOM uint32_t WP0        : 1;            /*!< [29..29] Write Protect                                                    */
      __IOM uint32_t SP0        : 1;            /*!< [30..30] Supervisor Protect                                               */
            uint32_t            : 1;
    } AIPS_OPACRF_b;
  } ;

  union {
    __IOM uint32_t AIPS_OPACRG;                 /*!< (@ 0x00000058) Off-Platform Peripheral Access Control Register            */

