nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 16;
      __IM  uint32_t L2WY       : 8;            /*!< [23..16] Level 2 Instruction Cache Ways                                   */
      __IM  uint32_t L2SZ       : 8;            /*!< [31..24] Level 2 Instruction Cache Size                                   */
    } MSCM_CP0CFG1_b;
  } ;

  union {
    __IM  uint32_t MSCM_CP0CFG2;                /*!< (@ 0x00000038) Processor 0 Configuration Register 2                       */

    struct {
            uint32_t            : 8;
      __IM  uint32_t TMUSZ      : 8;            /*!< [15..8] Tightly-coupled Memory Upper Size                                 */
            uint32_t            : 8;
      __IM  uint32_t TMLSZ      : 8;            /*!< [31..24] Tightly-coupled Memory Lower Size                                */
    } MSCM_CP0CFG2_b;
  } ;

  union {
    __IM  uint32_t MSCM_CP0CFG3;                /*!< (@ 0x0000003C) Processor 0 Configuration Register 3                       */

    struct {
      __IM  uint32_t FPU        : 1;            /*!< [0..0] Floating Point Unit                                                */
      __IM  uint32_t SIMD       : 1;            /*!< [1..1] SIMD/NEON instruction support                                      */
      __IM  uint32_t JAZ        : 1;            /*!< [2..2] Jazelle support                                                    */
      __IM  uint32_t MMU        : 1;            /*!< [3..3] Memory Management Unit                                             */
      __IM  uint32_t TZ         : 1;            /*!< [4..4] Trust Zone                                                         */
      __IM  uint32_t CMP        : 1;            /*!< [5..5] Core Memory Protection unit                                        */
      __IM  uint32_t BB         : 1;            /*!< [6..6] Bit Banding                                                        */
            uint32_t            : 1;
      __IM  uint32_t SBP        : 2;            /*!< [9..8] System Bus Ports                                                   */
            uint32_t            : 22;
    } MSCM_CP0CFG3_b;
  } ;
  __IM  uint32_t  RESERVED[240];

  union {
    __IOM uint32_t MSCM_OCMDR0;                 /*!< (@ 0x00000400) On-Chip Memory Descriptor Register                         */

    struct {
            uint32_t            : 4;
      __IOM uint32_t OCM1       : 2;            /*!< [5..4] OCMEM Control Field 1                                              */
            uint32_t            : 6;
      __IM  uint32_t OCMPU      : 1;            /*!< [12..12] OCMPU                                                            */
      __IM  uint32_t OCMT       : 3;            /*!< [15..13] OCMT                                                             */
      __IOM uint32_t RO         : 1;            /*!< [16..16] RO                                                               */
      __IM  uint32_t OCMW       : 3;            /*!< [19..17] OCMW                                                             */
            uint32_t            : 4;
      __IM  uint32_t OCMSZ      : 4;            /*!< [27..24] OCMSZ                                                            */
      __IM  uint32_t OCMSZH     : 1;            /*!< [28..28] OCMSZH                                                           */
            uint32_t            : 2;
      __IM  uint32_t V          : 1;            /*!< [31..31] V                                                                */
    } MSCM_OCMDR0_b;
  } ;

  union {
    __IOM uint32_t MSCM_OCMDR1;                 /*!< (@ 0x00000404) On-Chip Memory Descriptor Register                         */

    struct {
            uint32_t            : 4;
      __IOM uint32_t OCM1       : 2;            /*!< [5..4] OCMEM Control Field 1                                              */
            uint32_t            : 6;
      __IM  uint32_t OCMPU      : 1;            /*!< [12..12] OCMPU                                                            */
      __IM  uint32_t OCMT       : 3;            /*!< [15..13] OCMT                                                             */
      __IOM uint32_t RO         : 1;            /*!< [16..16] RO                                                               */
      __IM  uint32_t OCMW       : 3;            /*!< [19..17] OCMW                                                             */
            uint32_t            : 4;
      __IM  uint32_t OCMSZ      : 4;            /*!< [27..24] OCMSZ                                                            */
      __IM  uint32_t OCMSZH     : 1;            /*!< [28..28] OCMSZH                                                           */
            uint32_t            : 2;
      __IM  uint32_t V          : 1;            /*!< [31..31] V                                                                */
    } MSCM_OCMDR1_b;
  } ;

  union {
    __IOM uint32_t MSCM_OCMDR2;                 /*!< (@ 0x00000408) On-Chip Memory Descriptor Register                         */

    struct {
            uint32_t            : 12;
      __IM  uint32_t OCMPU      : 1;            /*!< [12..12] OCMPU                                                            */
      __IM  uint32_t OCMT       : 3;            /*!< [15..13] OCMT                                                             */
      __IOM uint32_t RO         : 1;            /*!< [16..16] RO                                                               */
      __IM  uint32_t OCMW       : 3;            /*!< [19..17] OCMW                                                             */
            uint32_t            : 4;
      __IM  uint32_t OCMSZ      : 4;            /*!< [27..24] OCMSZ                                                            */
      __IM  uint32_t OCMSZH     : 1;            /*!< [28..28] OCMSZH                                                           */
            uint32_t            : 2;
      __IM  uint32_t V          : 1;            /*!< [31..31] V                                                                */
    } MSCM_OCMDR2_b;
  } ;
} MSCM_Type;                                    /*!< Size = 1036 (0x40c)                                                       */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Enhanced Direct Memory Access (DMA)
  */

typedef struct {                                /*!< (@ 0x40008000) DMA Structure                                              */

  union {
    __IOM uint32_t DMA_CR;                      /*!< (@ 0x00000000) Control Register                                           */

