nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t ERR0       : 1;            /*!< [0..0] Error In Channel 0                                                 */
      __IOM uint32_t ERR1       : 1;            /*!< [1..1] Error In Channel 1                                                 */
      __IOM uint32_t ERR2       : 1;            /*!< [2..2] Error In Channel 2                                                 */
      __IOM uint32_t ERR3       : 1;            /*!< [3..3] Error In Channel 3                                                 */
      __IOM uint32_t ERR4       : 1;            /*!< [4..4] Error In Channel 4                                                 */
      __IOM uint32_t ERR5       : 1;            /*!< [5..5] Error In Channel 5                                                 */
      __IOM uint32_t ERR6       : 1;            /*!< [6..6] Error In Channel 6                                                 */
      __IOM uint32_t ERR7       : 1;            /*!< [7..7] Error In Channel 7                                                 */
      __IOM uint32_t ERR8       : 1;            /*!< [8..8] Error In Channel 8                                                 */
      __IOM uint32_t ERR9       : 1;            /*!< [9..9] Error In Channel 9                                                 */
      __IOM uint32_t ERR10      : 1;            /*!< [10..10] Error In Channel 10                                              */
      __IOM uint32_t ERR11      : 1;            /*!< [11..11] Error In Channel 11                                              */
      __IOM uint32_t ERR12      : 1;            /*!< [12..12] Error In Channel 12                                              */
      __IOM uint32_t ERR13      : 1;            /*!< [13..13] Error In Channel 13                                              */
      __IOM uint32_t ERR14      : 1;            /*!< [14..14] Error In Channel 14                                              */
      __IOM uint32_t ERR15      : 1;            /*!< [15..15] Error In Channel 15                                              */
            uint32_t            : 16;
    } DMA_ERR_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IM  uint32_t DMA_HRS;                     /*!< (@ 0x00000034) Hardware Request Status Register                           */

    struct {
      __IM  uint32_t HRS0       : 1;            /*!< [0..0] Hardware Request Status Channel 0                                  */
      __IM  uint32_t HRS1       : 1;            /*!< [1..1] Hardware Request Status Channel 1                                  */
      __IM  uint32_t HRS2       : 1;            /*!< [2..2] Hardware Request Status Channel 2                                  */
      __IM  uint32_t HRS3       : 1;            /*!< [3..3] Hardware Request Status Channel 3                                  */
      __IM  uint32_t HRS4       : 1;            /*!< [4..4] Hardware Request Status Channel 4                                  */
      __IM  uint32_t HRS5       : 1;            /*!< [5..5] Hardware Request Status Channel 5                                  */
      __IM  uint32_t HRS6       : 1;            /*!< [6..6] Hardware Request Status Channel 6                                  */
      __IM  uint32_t HRS7       : 1;            /*!< [7..7] Hardware Request Status Channel 7                                  */
      __IM  uint32_t HRS8       : 1;            /*!< [8..8] Hardware Request Status Channel 8                                  */
      __IM  uint32_t HRS9       : 1;            /*!< [9..9] Hardware Request Status Channel 9                                  */
      __IM  uint32_t HRS10      : 1;            /*!< [10..10] Hardware Request Status Channel 10                               */
      __IM  uint32_t HRS11      : 1;            /*!< [11..11] Hardware Request Status Channel 11                               */
      __IM  uint32_t HRS12      : 1;            /*!< [12..12] Hardware Request Status Channel 12                               */
      __IM  uint32_t HRS13      : 1;            /*!< [13..13] Hardware Request Status Channel 13                               */
      __IM  uint32_t HRS14      : 1;            /*!< [14..14] Hardware Request Status Channel 14                               */
      __IM  uint32_t HRS15      : 1;            /*!< [15..15] Hardware Request Status Channel 15                               */
            uint32_t            : 16;
    } DMA_HRS_b;
  } ;
  __IM  uint32_t  RESERVED5[3];

  union {
    __IOM uint32_t DMA_EARS;                    /*!< (@ 0x00000044) Enable Asynchronous Request in Stop Register               */

    struct {
      __IOM uint32_t EDREQ_0    : 1;            /*!< [0..0] Enable asynchronous DMA request in stop mode for channel
                                                     0.                                                                        */
      __IOM uint32_t EDREQ_1    : 1;            /*!< [1..1] Enable asynchronous DMA request in stop mode for channel
                                                     1.                                                                        */
      __IOM uint32_t EDREQ_2    : 1;            /*!< [2..2] Enable asynchronous DMA request in stop mode for channel
                                                     2.                                                                        */
      __IOM uint32_t EDREQ_3    : 1;            /*!< [3..3] Enable asynchronous DMA request in stop mode for channel
                                                     3.                                                                        */
      __IOM uint32_t EDREQ_4    : 1;            /*!< [4..4] Enable asynchronous DMA request in stop mode for channel
                                                     4                                                                         */
      __IOM uint32_t EDREQ_5    : 1;            /*!< [5..5] Enable asynchronous DMA request in stop mode for channel
                                                     5                                                                         */
      __IOM uint32_t EDREQ_6    : 1;            /*!< [6..6] Enable asynchronous DMA request in stop mode for channel
                                                     6                                                                         */
      __IOM uint32_t EDREQ_7    : 1;            /*!< [7..7] Enable asynchronous DMA request in stop mode for channel
                                                     7                                                                         */
      __IOM uint32_t EDREQ_8    : 1;            /*!< [8..8] Enable asynchronous DMA request in stop mode for channel
                                                     8                                                                         */
      __IOM uint32_t EDREQ_9    : 1;            /*!< [9..9] Enable asynchronous DMA request in stop mode for channel
                                                     9                                                                         */
      __IOM uint32_t EDREQ_10   : 1;            /*!< [10..10] Enable asynchronous DMA request in stop mode for channel
                                                     10                                                                        */
      __IOM uint32_t EDREQ_11   : 1;            /*!< [11..11] Enable asynchronous DMA request in stop mode for channel
                                                     11                                                                        */
      __IOM uint32_t EDREQ_12   : 1;            /*!< [12..12] Enable asynchronous DMA request in stop mode for channel
                                                     12                                                                        */
      __IOM uint32_t EDREQ_13   : 1;            /*!< [13..13] Enable asynchronous DMA request in stop mode for channel
                                                     13                                                                        */
      __IOM uint32_t EDREQ_14   : 1;            /*!< [14..14] Enable asynchronous DMA request in stop mode for channel
                                                     14                                                                        */
      __IOM uint32_t EDREQ_15   : 1;            /*!< [15..15] Enable asynchronous DMA request in stop mode for channel
                                                     15                                                                        */
            uint32_t            : 16;
    } DMA_EARS_b;
  } ;
  __IM  uint32_t  RESERVED6[46];

  union {
    __IOM uint8_t DMA_DCHPRI3;                  /*!< (@ 0x00000100) Channel n Priority Register                                */

