nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint8_t CHPRI       : 4;            /*!< [3..0] Channel n Arbitration Priority                                     */
            uint8_t             : 2;
      __IOM uint8_t DPA         : 1;            /*!< [6..6] Disable Preempt Ability. This field resets to 0.                   */
      __IOM uint8_t ECP         : 1;            /*!< [7..7] Enable Channel Preemption. This field resets to 0.                 */
    } DMA_DCHPRI3_b;
  } ;

  union {
    __IOM uint8_t DMA_DCHPRI2;                  /*!< (@ 0x00000101) Channel n Priority Register                                */

    struct {
      __IOM uint8_t CHPRI       : 4;            /*!< [3..0] Channel n Arbitration Priority                                     */
            uint8_t             : 2;
      __IOM uint8_t DPA         : 1;            /*!< [6..6] Disable Preempt Ability. This field resets to 0.                   */
      __IOM uint8_t ECP         : 1;            /*!< [7..7] Enable Channel Preemption. This field resets to 0.                 */
    } DMA_DCHPRI2_b;
  } ;

  union {
    __IOM uint8_t DMA_DCHPRI1;                  /*!< (@ 0x00000102) Channel n Priority Register                                */

    struct {
      __IOM uint8_t CHPRI       : 4;            /*!< [3..0] Channel n Arbitration Priority                                     */
            uint8_t             : 2;
      __IOM uint8_t DPA         : 1;            /*!< [6..6] Disable Preempt Ability. This field resets to 0.                   */
      __IOM uint8_t ECP         : 1;            /*!< [7..7] Enable Channel Preemption. This field resets to 0.                 */
    } DMA_DCHPRI1_b;
  } ;

  union {
    __IOM uint8_t DMA_DCHPRI0;                  /*!< (@ 0x00000103) Channel n Priority Register                                */

    struct {
      __IOM uint8_t CHPRI       : 4;            /*!< [3..0] Channel n Arbitration Priority                                     */
            uint8_t             : 2;
      __IOM uint8_t DPA         : 1;            /*!< [6..6] Disable Preempt Ability. This field resets to 0.                   */
      __IOM uint8_t ECP         : 1;            /*!< [7..7] Enable Channel Preemption. This field resets to 0.                 */
    } DMA_DCHPRI0_b;
  } ;
  __IM  uint32_t  RESERVED7[959];

  union {
    __IOM uint32_t DMA_TCD0_SADDR;              /*!< (@ 0x00001000) TCD Source Address                                         */

    struct {
      __IOM uint32_t SADDR      : 32;           /*!< [31..0] Source Address                                                    */
    } DMA_TCD0_SADDR_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD0_SOFF;               /*!< (@ 0x00001004) TCD Signed Source Address Offset                           */

    struct {
      __IOM uint16_t SOFF       : 16;           /*!< [15..0] Source address signed offset                                      */
    } DMA_TCD0_SOFF_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD0_ATTR;               /*!< (@ 0x00001006) TCD Transfer Attributes                                    */

    struct {
      __IOM uint16_t DSIZE      : 3;            /*!< [2..0] Destination data transfer size                                     */
      __IOM uint16_t DMOD       : 5;            /*!< [7..3] Destination Address Modulo                                         */
      __IOM uint16_t SSIZE      : 3;            /*!< [10..8] Source data transfer size                                         */
      __IOM uint16_t SMOD       : 5;            /*!< [15..11] Source Address Modulo                                            */
    } DMA_TCD0_ATTR_b;
  } ;

  union {
    union {
      __IOM uint32_t DMA_TCD0_NBYTES_MLNO_DMA;  /*!< (@ 0x00001008) TCD Minor Byte Count (Minor Loop Mapping Disabled)         */

      struct {
        __IOM uint32_t NBYTES   : 32;           /*!< [31..0] Minor Byte Transfer Count                                         */
      } DMA_TCD0_NBYTES_MLNO_DMA_b;
    } ;

    union {
      __IOM uint32_t DMA_TCD0_NBYTES_MLOFFNO_DMA;/*!< (@ 0x00001008) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                    Enabled and Offset Disabled)                               */

      struct {
        __IOM uint32_t NBYTES   : 30;           /*!< [29..0] Minor Byte Transfer Count                                         */
        __IOM uint32_t DMLOE    : 1;            /*!< [30..30] Destination Minor Loop Offset enable                             */
        __IOM uint32_t SMLOE    : 1;            /*!< [31..31] Source Minor Loop Offset Enable                                  */
      } DMA_TCD0_NBYTES_MLOFFNO_DMA_b;
    } ;

    union {
      __IOM uint32_t DMA_TCD0_NBYTES_MLOFFYES_DMA;/*!< (@ 0x00001008) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                    and Offset Enabled)                                        */

      struct {
        __IOM uint32_t NBYTES   : 10;           /*!< [9..0] Minor Byte Transfer Count                                          */
        __IOM uint32_t MLOFF    : 20;           /*!< [29..10] If SMLOE or DMLOE is set, this field represents a sign-extended
                                                     offset applied to the source or destination address to
                                                     form the next-state value after the minor loop completes.                 */
        __IOM uint32_t DMLOE    : 1;            /*!< [30..30] Destination Minor Loop Offset enable                             */
        __IOM uint32_t SMLOE    : 1;            /*!< [31..31] Source Minor Loop Offset Enable                                  */
      } DMA_TCD0_NBYTES_MLOFFYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD0_SLAST;              /*!< (@ 0x0000100C) TCD Last Source Address Adjustment                         */

    struct {
      __IOM uint32_t SLAST      : 32;           /*!< [31..0] Last Source Address Adjustment                                    */
    } DMA_TCD0_SLAST_b;
  } ;

  union {
    __IOM uint32_t DMA_TCD0_DADDR;              /*!< (@ 0x00001010) TCD Destination Address                                    */

