nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DADDR      : 32;           /*!< [31..0] Destination Address                                               */
    } DMA_TCD0_DADDR_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD0_DOFF;               /*!< (@ 0x00001014) TCD Signed Destination Address Offset                      */

    struct {
      __IOM uint16_t DOFF       : 16;           /*!< [15..0] Destination Address Signed Offset                                 */
    } DMA_TCD0_DOFF_b;
  } ;

  union {
    union {
      __IOM uint16_t DMA_TCD0_CITER_ELINKNO_DMA;/*!< (@ 0x00001016) TCD Current Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Disabled)                                 */

      struct {
        __IOM uint16_t CITER    : 15;           /*!< [14..0] Current Major Iteration Count                                     */
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enable channel-to-channel linking on minor-loop complete         */
      } DMA_TCD0_CITER_ELINKNO_DMA_b;
    } ;

    union {
      __IOM uint16_t DMA_TCD0_CITER_ELINKYES_DMA;/*!< (@ 0x00001016) TCD Current Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Enabled)                                  */

      struct {
        __IOM uint16_t CITER_LE : 9;            /*!< [8..0] Current Major Iteration Count                                      */
        __IOM uint16_t LINKCH   : 4;            /*!< [12..9] Minor Loop Link Channel Number                                    */
              uint16_t          : 2;
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enable channel-to-channel linking on minor-loop complete         */
      } DMA_TCD0_CITER_ELINKYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD0_DLASTSGA;           /*!< (@ 0x00001018) TCD Last Destination Address Adjustment/Scatter
                                                                    Gather Address                                             */

    struct {
      __IOM uint32_t DLASTSGA   : 32;           /*!< [31..0] DLASTSGA                                                          */
    } DMA_TCD0_DLASTSGA_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD0_CSR;                /*!< (@ 0x0000101C) TCD Control and Status                                     */

    struct {
      __IOM uint16_t START      : 1;            /*!< [0..0] Channel Start                                                      */
      __IOM uint16_t INTMAJOR   : 1;            /*!< [1..1] Enable an interrupt when major iteration count completes.          */
      __IOM uint16_t INTHALF    : 1;            /*!< [2..2] Enable an interrupt when major counter is half complete.           */
      __IOM uint16_t DREQ       : 1;            /*!< [3..3] Disable Request                                                    */
      __IOM uint16_t ESG        : 1;            /*!< [4..4] Enable Scatter/Gather Processing                                   */
      __IOM uint16_t MAJORELINK : 1;            /*!< [5..5] Enable channel-to-channel linking on major loop complete           */
      __IOM uint16_t ACTIVE     : 1;            /*!< [6..6] Channel Active                                                     */
      __IOM uint16_t DONE       : 1;            /*!< [7..7] Channel Done                                                       */
      __IOM uint16_t MAJORLINKCH : 4;           /*!< [11..8] Major Loop Link Channel Number                                    */
            uint16_t            : 2;
      __IOM uint16_t BWC        : 2;            /*!< [15..14] Bandwidth Control                                                */
    } DMA_TCD0_CSR_b;
  } ;

  union {
    union {
      __IOM uint16_t DMA_TCD0_BITER_ELINKNO_DMA;/*!< (@ 0x0000101E) TCD Beginning Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Disabled)                                 */

      struct {
        __IOM uint16_t BITER    : 15;           /*!< [14..0] Starting Major Iteration Count                                    */
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enables channel-to-channel linking on minor loop complete        */
      } DMA_TCD0_BITER_ELINKNO_DMA_b;
    } ;

    union {
      __IOM uint16_t DMA_TCD0_BITER_ELINKYES_DMA;/*!< (@ 0x0000101E) TCD Beginning Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Enabled)                                  */

      struct {
        __IOM uint16_t BITER    : 9;            /*!< [8..0] Starting major iteration count                                     */
        __IOM uint16_t LINKCH   : 4;            /*!< [12..9] Link Channel Number                                               */
              uint16_t          : 2;
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enables channel-to-channel linking on minor loop complete        */
      } DMA_TCD0_BITER_ELINKYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD1_SADDR;              /*!< (@ 0x00001020) TCD Source Address                                         */

    struct {
      __IOM uint32_t SADDR      : 32;           /*!< [31..0] Source Address                                                    */
    } DMA_TCD1_SADDR_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD1_SOFF;               /*!< (@ 0x00001024) TCD Signed Source Address Offset                           */

    struct {
      __IOM uint16_t SOFF       : 16;           /*!< [15..0] Source address signed offset                                      */
    } DMA_TCD1_SOFF_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD1_ATTR;               /*!< (@ 0x00001026) TCD Transfer Attributes                                    */

    struct {
      __IOM uint16_t DSIZE      : 3;            /*!< [2..0] Destination data transfer size                                     */
      __IOM uint16_t DMOD       : 5;            /*!< [7..3] Destination Address Modulo                                         */
      __IOM uint16_t SSIZE      : 3;            /*!< [10..8] Source data transfer size                                         */
      __IOM uint16_t SMOD       : 5;            /*!< [15..11] Source Address Modulo                                            */
    } DMA_TCD1_ATTR_b;
  } ;

  union {
    union {
      __IOM uint32_t DMA_TCD1_NBYTES_MLNO_DMA;  /*!< (@ 0x00001028) TCD Minor Byte Count (Minor Loop Mapping Disabled)         */

