nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
      struct {
        __IOM uint16_t BITER    : 15;           /*!< [14..0] Starting Major Iteration Count                                    */
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enables channel-to-channel linking on minor loop complete        */
      } DMA_TCD1_BITER_ELINKNO_DMA_b;
    } ;

    union {
      __IOM uint16_t DMA_TCD1_BITER_ELINKYES_DMA;/*!< (@ 0x0000103E) TCD Beginning Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Enabled)                                  */

      struct {
        __IOM uint16_t BITER    : 9;            /*!< [8..0] Starting major iteration count                                     */
        __IOM uint16_t LINKCH   : 4;            /*!< [12..9] Link Channel Number                                               */
              uint16_t          : 2;
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enables channel-to-channel linking on minor loop complete        */
      } DMA_TCD1_BITER_ELINKYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD2_SADDR;              /*!< (@ 0x00001040) TCD Source Address                                         */

    struct {
      __IOM uint32_t SADDR      : 32;           /*!< [31..0] Source Address                                                    */
    } DMA_TCD2_SADDR_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD2_SOFF;               /*!< (@ 0x00001044) TCD Signed Source Address Offset                           */

    struct {
      __IOM uint16_t SOFF       : 16;           /*!< [15..0] Source address signed offset                                      */
    } DMA_TCD2_SOFF_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD2_ATTR;               /*!< (@ 0x00001046) TCD Transfer Attributes                                    */

    struct {
      __IOM uint16_t DSIZE      : 3;            /*!< [2..0] Destination data transfer size                                     */
      __IOM uint16_t DMOD       : 5;            /*!< [7..3] Destination Address Modulo                                         */
      __IOM uint16_t SSIZE      : 3;            /*!< [10..8] Source data transfer size                                         */
      __IOM uint16_t SMOD       : 5;            /*!< [15..11] Source Address Modulo                                            */
    } DMA_TCD2_ATTR_b;
  } ;

  union {
    union {
      __IOM uint32_t DMA_TCD2_NBYTES_MLNO_DMA;  /*!< (@ 0x00001048) TCD Minor Byte Count (Minor Loop Mapping Disabled)         */

      struct {
        __IOM uint32_t NBYTES   : 32;           /*!< [31..0] Minor Byte Transfer Count                                         */
      } DMA_TCD2_NBYTES_MLNO_DMA_b;
    } ;

    union {
      __IOM uint32_t DMA_TCD2_NBYTES_MLOFFNO_DMA;/*!< (@ 0x00001048) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                    Enabled and Offset Disabled)                               */

      struct {
        __IOM uint32_t NBYTES   : 30;           /*!< [29..0] Minor Byte Transfer Count                                         */
        __IOM uint32_t DMLOE    : 1;            /*!< [30..30] Destination Minor Loop Offset enable                             */
        __IOM uint32_t SMLOE    : 1;            /*!< [31..31] Source Minor Loop Offset Enable                                  */
      } DMA_TCD2_NBYTES_MLOFFNO_DMA_b;
    } ;

    union {
      __IOM uint32_t DMA_TCD2_NBYTES_MLOFFYES_DMA;/*!< (@ 0x00001048) TCD Signed Minor Loop Offset (Minor Loop Mapping
                                                                    and Offset Enabled)                                        */

      struct {
        __IOM uint32_t NBYTES   : 10;           /*!< [9..0] Minor Byte Transfer Count                                          */
        __IOM uint32_t MLOFF    : 20;           /*!< [29..10] If SMLOE or DMLOE is set, this field represents a sign-extended
                                                     offset applied to the source or destination address to
                                                     form the next-state value after the minor loop completes.                 */
        __IOM uint32_t DMLOE    : 1;            /*!< [30..30] Destination Minor Loop Offset enable                             */
        __IOM uint32_t SMLOE    : 1;            /*!< [31..31] Source Minor Loop Offset Enable                                  */
      } DMA_TCD2_NBYTES_MLOFFYES_DMA_b;
    } ;
  };

  union {
    __IOM uint32_t DMA_TCD2_SLAST;              /*!< (@ 0x0000104C) TCD Last Source Address Adjustment                         */

    struct {
      __IOM uint32_t SLAST      : 32;           /*!< [31..0] Last Source Address Adjustment                                    */
    } DMA_TCD2_SLAST_b;
  } ;

  union {
    __IOM uint32_t DMA_TCD2_DADDR;              /*!< (@ 0x00001050) TCD Destination Address                                    */

    struct {
      __IOM uint32_t DADDR      : 32;           /*!< [31..0] Destination Address                                               */
    } DMA_TCD2_DADDR_b;
  } ;

  union {
    __IOM uint16_t DMA_TCD2_DOFF;               /*!< (@ 0x00001054) TCD Signed Destination Address Offset                      */

    struct {
      __IOM uint16_t DOFF       : 16;           /*!< [15..0] Destination Address Signed Offset                                 */
    } DMA_TCD2_DOFF_b;
  } ;

  union {
    union {
      __IOM uint16_t DMA_TCD2_CITER_ELINKNO_DMA;/*!< (@ 0x00001056) TCD Current Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Disabled)                                 */

      struct {
        __IOM uint16_t CITER    : 15;           /*!< [14..0] Current Major Iteration Count                                     */
        __IOM uint16_t ELINK    : 1;            /*!< [15..15] Enable channel-to-channel linking on minor-loop complete         */
      } DMA_TCD2_CITER_ELINKNO_DMA_b;
    } ;

    union {
      __IOM uint16_t DMA_TCD2_CITER_ELINKYES_DMA;/*!< (@ 0x00001056) TCD Current Minor Loop Link, Major Loop Count
                                                                    (Channel Linking Enabled)                                  */

