nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t VLD        : 1;            /*!< [0..0] Valid                                                              */
            uint32_t            : 7;
      __IM  uint32_t NRGD       : 4;            /*!< [11..8] Number Of Region Descriptors                                      */
      __IM  uint32_t NSP        : 4;            /*!< [15..12] Number Of Slave Ports                                            */
      __IM  uint32_t HRL        : 4;            /*!< [19..16] Hardware Revision Level                                          */
            uint32_t            : 10;
      __IOM uint32_t SPERR1     : 1;            /*!< [30..30] Slave Port 1 Error                                               */
      __IOM uint32_t SPERR0     : 1;            /*!< [31..31] Slave Port 0 Error                                               */
    } MPU_CESR_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IM  uint32_t MPU_EAR0;                    /*!< (@ 0x00000010) Error Address Register, slave port 0                       */

    struct {
      __IM  uint32_t EADDR      : 32;           /*!< [31..0] Error Address                                                     */
    } MPU_EAR0_b;
  } ;

  union {
    __IM  uint32_t MPU_EDR0;                    /*!< (@ 0x00000014) Error Detail Register, slave port 0                        */

    struct {
      __IM  uint32_t ERW        : 1;            /*!< [0..0] Error Read/Write                                                   */
      __IM  uint32_t EATTR      : 3;            /*!< [3..1] Error Attributes                                                   */
      __IM  uint32_t EMN        : 4;            /*!< [7..4] Error Master Number                                                */
      __IM  uint32_t EPID       : 8;            /*!< [15..8] Error Process Identification                                      */
      __IM  uint32_t EACD       : 16;           /*!< [31..16] Error Access Control Detail                                      */
    } MPU_EDR0_b;
  } ;

  union {
    __IM  uint32_t MPU_EAR1;                    /*!< (@ 0x00000018) Error Address Register, slave port 1                       */

    struct {
      __IM  uint32_t EADDR      : 32;           /*!< [31..0] Error Address                                                     */
    } MPU_EAR1_b;
  } ;

  union {
    __IM  uint32_t MPU_EDR1;                    /*!< (@ 0x0000001C) Error Detail Register, slave port 1                        */

    struct {
      __IM  uint32_t ERW        : 1;            /*!< [0..0] Error Read/Write                                                   */
      __IM  uint32_t EATTR      : 3;            /*!< [3..1] Error Attributes                                                   */
      __IM  uint32_t EMN        : 4;            /*!< [7..4] Error Master Number                                                */
      __IM  uint32_t EPID       : 8;            /*!< [15..8] Error Process Identification                                      */
      __IM  uint32_t EACD       : 16;           /*!< [31..16] Error Access Control Detail                                      */
    } MPU_EDR1_b;
  } ;
  __IM  uint32_t  RESERVED1[248];

  union {
    __IOM uint32_t MPU_RGD0_WORD0;              /*!< (@ 0x00000400) Region Descriptor 0, Word 0                                */

    struct {
            uint32_t            : 5;
      __IOM uint32_t SRTADDR    : 27;           /*!< [31..5] Start Address                                                     */
    } MPU_RGD0_WORD0_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD0_WORD1;              /*!< (@ 0x00000404) Region Descriptor 0, Word 1                                */

    struct {
            uint32_t            : 5;
      __IOM uint32_t ENDADDR    : 27;           /*!< [31..5] End Address                                                       */
    } MPU_RGD0_WORD1_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD0_WORD2;              /*!< (@ 0x00000408) Region Descriptor 0, Word 2                                */

    struct {
      __IOM uint32_t M0UM       : 3;            /*!< [2..0] Bus Master 0 User Mode Access Control                              */
      __IOM uint32_t M0SM       : 2;            /*!< [4..3] Bus Master 0 Supervisor Mode Access Control                        */
      __IOM uint32_t M0PE       : 1;            /*!< [5..5] Bus Master 0 Process Identifier enable                             */
      __IOM uint32_t M1UM       : 3;            /*!< [8..6] Bus Master 1 User Mode Access Control                              */
      __IOM uint32_t M1SM       : 2;            /*!< [10..9] Bus Master 1 Supervisor Mode Access Control                       */
            uint32_t            : 1;
      __IOM uint32_t M2UM       : 3;            /*!< [14..12] Bus Master 2 User Mode Access control                            */
      __IOM uint32_t M2SM       : 2;            /*!< [16..15] Bus Master 2 Supervisor Mode Access Control                      */
            uint32_t            : 1;
      __IOM uint32_t M3UM       : 3;            /*!< [20..18] Bus Master 3 User Mode Access Control                            */
      __IOM uint32_t M3SM       : 2;            /*!< [22..21] Bus Master 3 Supervisor Mode Access Control                      */
            uint32_t            : 1;
      __IOM uint32_t M4WE       : 1;            /*!< [24..24] Bus Master 4 Write Enable                                        */
      __IOM uint32_t M4RE       : 1;            /*!< [25..25] Bus Master 4 Read Enable                                         */
      __IOM uint32_t M5WE       : 1;            /*!< [26..26] Bus Master 5 Write Enable                                        */
      __IOM uint32_t M5RE       : 1;            /*!< [27..27] Bus Master 5 Read Enable                                         */
      __IOM uint32_t M6WE       : 1;            /*!< [28..28] Bus Master 6 Write Enable                                        */
      __IOM uint32_t M6RE       : 1;            /*!< [29..29] Bus Master 6 Read Enable                                         */
      __IOM uint32_t M7WE       : 1;            /*!< [30..30] Bus Master 7 Write Enable                                        */
      __IOM uint32_t M7RE       : 1;            /*!< [31..31] Bus Master 7 Read Enable                                         */
    } MPU_RGD0_WORD2_b;
  } ;

  union {
    __IOM uint32_t MPU_RGD0_WORD3;              /*!< (@ 0x0000040C) Region Descriptor 0, Word 3                                */

