nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint8_t SOURCE      : 6;            /*!< [5..0] DMA Channel Source (Slot)                                          */
      __IOM uint8_t TRIG        : 1;            /*!< [6..6] DMA Channel Trigger Enable                                         */
      __IOM uint8_t ENBL        : 1;            /*!< [7..7] DMA Channel Enable                                                 */
    } DMAMUX_CHCFG0_b;
  } ;

  union {
    __IOM uint8_t DMAMUX_CHCFG1;                /*!< (@ 0x00000001) Channel Configuration register                             */

    struct {
      __IOM uint8_t SOURCE      : 6;            /*!< [5..0] DMA Channel Source (Slot)                                          */
      __IOM uint8_t TRIG        : 1;            /*!< [6..6] DMA Channel Trigger Enable                                         */
      __IOM uint8_t ENBL        : 1;            /*!< [7..7] DMA Channel Enable                                                 */
    } DMAMUX_CHCFG1_b;
  } ;

  union {
    __IOM uint8_t DMAMUX_CHCFG2;                /*!< (@ 0x00000002) Channel Configuration register                             */

    struct {
      __IOM uint8_t SOURCE      : 6;            /*!< [5..0] DMA Channel Source (Slot)                                          */
      __IOM uint8_t TRIG        : 1;            /*!< [6..6] DMA Channel Trigger Enable                                         */
      __IOM uint8_t ENBL        : 1;            /*!< [7..7] DMA Channel Enable                                                 */
    } DMAMUX_CHCFG2_b;
  } ;

  union {
    __IOM uint8_t DMAMUX_CHCFG3;                /*!< (@ 0x00000003) Channel Configuration register                             */

    struct {
      __IOM uint8_t SOURCE      : 6;            /*!< [5..0] DMA Channel Source (Slot)                                          */
      __IOM uint8_t TRIG        : 1;            /*!< [6..6] DMA Channel Trigger Enable                                         */
      __IOM uint8_t ENBL        : 1;            /*!< [7..7] DMA Channel Enable                                                 */
    } DMAMUX_CHCFG3_b;
  } ;
} DMAMUX_Type;                                  /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           CAN0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Flex Controller Area Network module (CAN0)
  */

typedef struct {                                /*!< (@ 0x40024000) CAN0 Structure                                             */

  union {
    __IOM uint32_t CAN0_MCR;                    /*!< (@ 0x00000000) Module Configuration Register                              */

    struct {
      __IOM uint32_t MAXMB      : 7;            /*!< [6..0] Number Of The Last Message Buffer                                  */
            uint32_t            : 1;
      __IOM uint32_t IDAM       : 2;            /*!< [9..8] ID Acceptance Mode                                                 */
            uint32_t            : 1;
      __IOM uint32_t FDEN       : 1;            /*!< [11..11] CAN FD operation enable                                          */
      __IOM uint32_t AEN        : 1;            /*!< [12..12] Abort Enable                                                     */
      __IOM uint32_t LPRIOEN    : 1;            /*!< [13..13] Local Priority Enable                                            */
      __IOM uint32_t PNET_EN    : 1;            /*!< [14..14] Pretended Networking Enable                                      */
      __IOM uint32_t DMA        : 1;            /*!< [15..15] DMA Enable                                                       */
      __IOM uint32_t IRMQ       : 1;            /*!< [16..16] Individual Rx Masking And Queue Enable                           */
      __IOM uint32_t SRXDIS     : 1;            /*!< [17..17] Self Reception Disable                                           */
            uint32_t            : 2;
      __IM  uint32_t LPMACK     : 1;            /*!< [20..20] Low-Power Mode Acknowledge                                       */
      __IOM uint32_t WRNEN      : 1;            /*!< [21..21] Warning Interrupt Enable                                         */
            uint32_t            : 1;
      __IOM uint32_t SUPV       : 1;            /*!< [23..23] Supervisor Mode                                                  */
      __IM  uint32_t FRZACK     : 1;            /*!< [24..24] Freeze Mode Acknowledge                                          */
      __IOM uint32_t SOFTRST    : 1;            /*!< [25..25] Soft Reset                                                       */
            uint32_t            : 1;
      __IM  uint32_t NOTRDY     : 1;            /*!< [27..27] FlexCAN Not Ready                                                */
      __IOM uint32_t HALT       : 1;            /*!< [28..28] Halt FlexCAN                                                     */
      __IOM uint32_t RFEN       : 1;            /*!< [29..29] Rx FIFO Enable                                                   */
      __IOM uint32_t FRZ        : 1;            /*!< [30..30] Freeze Enable                                                    */
      __IOM uint32_t MDIS       : 1;            /*!< [31..31] Module Disable                                                   */
    } CAN0_MCR_b;
  } ;

  union {
    __IOM uint32_t CAN0_CTRL1;                  /*!< (@ 0x00000004) Control 1 register                                         */

    struct {
      __IOM uint32_t PROPSEG    : 3;            /*!< [2..0] Propagation Segment                                                */
      __IOM uint32_t LOM        : 1;            /*!< [3..3] Listen-Only Mode                                                   */
      __IOM uint32_t LBUF       : 1;            /*!< [4..4] Lowest Buffer Transmitted First                                    */
      __IOM uint32_t TSYN       : 1;            /*!< [5..5] Timer Sync                                                         */
      __IOM uint32_t BOFFREC    : 1;            /*!< [6..6] Bus Off Recovery                                                   */
      __IOM uint32_t SMP        : 1;            /*!< [7..7] CAN Bit Sampling                                                   */
            uint32_t            : 2;
      __IOM uint32_t RWRNMSK    : 1;            /*!< [10..10] Rx Warning Interrupt Mask                                        */
      __IOM uint32_t TWRNMSK    : 1;            /*!< [11..11] Tx Warning Interrupt Mask                                        */
      __IOM uint32_t LPB        : 1;            /*!< [12..12] Loop Back Mode                                                   */
      __IOM uint32_t CLKSRC     : 1;            /*!< [13..13] CAN Engine Clock Source                                          */
      __IOM uint32_t ERRMSK     : 1;            /*!< [14..14] Error Interrupt Mask                                             */
      __IOM uint32_t BOFFMSK    : 1;            /*!< [15..15] Bus Off Interrupt Mask                                           */
      __IOM uint32_t PSEG2      : 3;            /*!< [18..16] Phase Segment 2                                                  */
      __IOM uint32_t PSEG1      : 3;            /*!< [21..19] Phase Segment 1                                                  */
      __IOM uint32_t RJW        : 2;            /*!< [23..22] Resync Jump Width                                                */
      __IOM uint32_t PRESDIV    : 8;            /*!< [31..24] Prescaler Division Factor                                        */
    } CAN0_CTRL1_b;
  } ;

  union {
    __IOM uint32_t CAN0_TIMER;                  /*!< (@ 0x00000008) Free Running Timer                                         */

