nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn81_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn82;                 /*!< (@ 0x000001C8) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn82_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn83;                 /*!< (@ 0x000001CC) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn83_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn84;                 /*!< (@ 0x000001D0) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn84_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn85;                 /*!< (@ 0x000001D4) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn85_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn86;                 /*!< (@ 0x000001D8) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn86_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn87;                 /*!< (@ 0x000001DC) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn87_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn88;                 /*!< (@ 0x000001E0) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn88_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn89;                 /*!< (@ 0x000001E4) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn89_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn90;                 /*!< (@ 0x000001E8) Embedded RAM                                               */

