nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn99_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn100;                /*!< (@ 0x00000210) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn100_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn101;                /*!< (@ 0x00000214) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn101_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn102;                /*!< (@ 0x00000218) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn102_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn103;                /*!< (@ 0x0000021C) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn103_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn104;                /*!< (@ 0x00000220) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn104_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn105;                /*!< (@ 0x00000224) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn105_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn106;                /*!< (@ 0x00000228) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn106_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn107;                /*!< (@ 0x0000022C) Embedded RAM                                               */

    struct {
      __IOM uint32_t DATA_BYTE_3 : 8;           /*!< [7..0] Data byte 3 of Rx/Tx frame.                                        */
      __IOM uint32_t DATA_BYTE_2 : 8;           /*!< [15..8] Data byte 2 of Rx/Tx frame.                                       */
      __IOM uint32_t DATA_BYTE_1 : 8;           /*!< [23..16] Data byte 1 of Rx/Tx frame.                                      */
      __IOM uint32_t DATA_BYTE_0 : 8;           /*!< [31..24] Data byte 0 of Rx/Tx frame.                                      */
    } CAN0_RAMn107_b;
  } ;

  union {
    __IOM uint32_t CAN0_RAMn108;                /*!< (@ 0x00000230) Embedded RAM                                               */

