nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR15_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR16;                /*!< (@ 0x000008C0) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR16_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR17;                /*!< (@ 0x000008C4) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR17_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR18;                /*!< (@ 0x000008C8) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR18_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR19;                /*!< (@ 0x000008CC) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR19_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR20;                /*!< (@ 0x000008D0) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR20_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR21;                /*!< (@ 0x000008D4) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR21_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR22;                /*!< (@ 0x000008D8) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR22_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR23;                /*!< (@ 0x000008DC) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR23_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR24;                /*!< (@ 0x000008E0) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR24_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR25;                /*!< (@ 0x000008E4) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR25_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR26;                /*!< (@ 0x000008E8) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR26_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR27;                /*!< (@ 0x000008EC) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR27_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR28;                /*!< (@ 0x000008F0) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR28_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR29;                /*!< (@ 0x000008F4) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR29_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR30;                /*!< (@ 0x000008F8) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR30_b;
  } ;

  union {
    __IOM uint32_t CAN0_RXIMR31;                /*!< (@ 0x000008FC) Rx Individual Mask Registers                               */

    struct {
      __IOM uint32_t MI         : 32;           /*!< [31..0] Individual Mask Bits                                              */
    } CAN0_RXIMR31_b;
  } ;
  __IM  uint32_t  RESERVED6[128];

  union {
    __IOM uint32_t CAN0_CTRL1_PN;               /*!< (@ 0x00000B00) Pretended Networking Control 1 Register                    */

    struct {
      __IOM uint32_t FCS        : 2;            /*!< [1..0] Filtering Combination Selection                                    */
      __IOM uint32_t IDFS       : 2;            /*!< [3..2] ID Filtering Selection                                             */
      __IOM uint32_t PLFS       : 2;            /*!< [5..4] Payload Filtering Selection                                        */
            uint32_t            : 2;
      __IOM uint32_t NMATCH     : 8;            /*!< [15..8] Number of Messages Matching the Same Filtering Criteria           */
      __IOM uint32_t WUMF_MSK   : 1;            /*!< [16..16] Wake Up by Match Flag Mask Bit                                   */
      __IOM uint32_t WTOF_MSK   : 1;            /*!< [17..17] Wake Up by Timeout Flag Mask Bit                                 */
            uint32_t            : 14;
    } CAN0_CTRL1_PN_b;
  } ;

  union {
    __IOM uint32_t CAN0_CTRL2_PN;               /*!< (@ 0x00000B04) Pretended Networking Control 2 Register                    */

