nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t MATCHTO    : 16;           /*!< [15..0] Timeout for No Message Matching the Filtering Criteria            */
            uint32_t            : 16;
    } CAN0_CTRL2_PN_b;
  } ;

  union {
    __IOM uint32_t CAN0_WU_MTC;                 /*!< (@ 0x00000B08) Pretended Networking Wake Up Match Register                */

    struct {
            uint32_t            : 8;
      __IM  uint32_t MCOUNTER   : 8;            /*!< [15..8] Number of Matches while in Pretended Networking                   */
      __IOM uint32_t WUMF       : 1;            /*!< [16..16] Wake Up by Match Flag Bit                                        */
      __IOM uint32_t WTOF       : 1;            /*!< [17..17] Wake Up by Timeout Flag Bit                                      */
            uint32_t            : 14;
    } CAN0_WU_MTC_b;
  } ;

  union {
    __IOM uint32_t CAN0_FLT_ID1;                /*!< (@ 0x00000B0C) Pretended Networking ID Filter 1 Register                  */

    struct {
      __IOM uint32_t FLT_ID1    : 29;           /*!< [28..0] ID Filter 1 for Pretended Networking filtering                    */
      __IOM uint32_t FLT_RTR    : 1;            /*!< [29..29] Remote Transmission Request Filter                               */
      __IOM uint32_t FLT_IDE    : 1;            /*!< [30..30] ID Extended Filter                                               */
            uint32_t            : 1;
    } CAN0_FLT_ID1_b;
  } ;

  union {
    __IOM uint32_t CAN0_FLT_DLC;                /*!< (@ 0x00000B10) Pretended Networking DLC Filter Register                   */

    struct {
      __IOM uint32_t FLT_DLC_HI : 4;            /*!< [3..0] Upper Limit for Length of Data Bytes Filter                        */
            uint32_t            : 12;
      __IOM uint32_t FLT_DLC_LO : 4;            /*!< [19..16] Lower Limit for Length of Data Bytes Filter                      */
            uint32_t            : 12;
    } CAN0_FLT_DLC_b;
  } ;

  union {
    __IOM uint32_t CAN0_PL1_LO;                 /*!< (@ 0x00000B14) Pretended Networking Payload Low Filter 1 Register         */

    struct {
      __IOM uint32_t Data_byte_3 : 8;           /*!< [7..0] Payload Filter 1 low order bits for Pretended Networking
                                                     payload filtering corresponding to the data byte 3.                       */
      __IOM uint32_t Data_byte_2 : 8;           /*!< [15..8] Payload Filter 1 low order bits for Pretended Networking
                                                     payload filtering corresponding to the data byte 2.                       */
      __IOM uint32_t Data_byte_1 : 8;           /*!< [23..16] Payload Filter 1 low order bits for Pretended Networking
                                                     payload filtering corresponding to the data byte 1.                       */
      __IOM uint32_t Data_byte_0 : 8;           /*!< [31..24] Payload Filter 1 low order bits for Pretended Networking
                                                     payload filtering corresponding to the data byte 0.                       */
    } CAN0_PL1_LO_b;
  } ;

  union {
    __IOM uint32_t CAN0_PL1_HI;                 /*!< (@ 0x00000B18) Pretended Networking Payload High Filter 1 Register        */

    struct {
      __IOM uint32_t Data_byte_7 : 8;           /*!< [7..0] Payload Filter 1 high order bits for Pretended Networking
                                                     payload filtering corresponding to the data byte 7.                       */
      __IOM uint32_t Data_byte_6 : 8;           /*!< [15..8] Payload Filter 1 high order bits for Pretended Networking
                                                     payload filtering corresponding to the data byte 6.                       */
      __IOM uint32_t Data_byte_5 : 8;           /*!< [23..16] Payload Filter 1 high order bits for Pretended Networking
                                                     payload filtering corresponding to the data byte 5.                       */
      __IOM uint32_t Data_byte_4 : 8;           /*!< [31..24] Payload Filter 1 high order bits for Pretended Networking
                                                     payload filtering corresponding to the data byte 4.                       */
    } CAN0_PL1_HI_b;
  } ;

  union {
    __IOM uint32_t CAN0_FLT_ID2_IDMASK;         /*!< (@ 0x00000B1C) Pretended Networking ID Filter 2 Register / ID
                                                                    Mask Register                                              */

    struct {
      __IOM uint32_t FLT_ID2_IDMASK : 29;       /*!< [28..0] ID Filter 2 for Pretended Networking Filtering / ID
                                                     Mask Bits for Pretended Networking ID Filtering                           */
      __IOM uint32_t RTR_MSK    : 1;            /*!< [29..29] Remote Transmission Request Mask Bit                             */
      __IOM uint32_t IDE_MSK    : 1;            /*!< [30..30] ID Extended Mask Bit                                             */
            uint32_t            : 1;
    } CAN0_FLT_ID2_IDMASK_b;
  } ;

  union {
    __IOM uint32_t CAN0_PL2_PLMASK_LO;          /*!< (@ 0x00000B20) Pretended Networking Payload Low Filter 2 Register
                                                                    / Payload Low Mask Register                                */

    struct {
      __IOM uint32_t Data_byte_3 : 8;           /*!< [7..0] Payload Filter 2 low order bits / Payload Mask low order
                                                     bits for Pretended Networking payload filtering corresponding
                                                     to the data byte 3.                                                       */
      __IOM uint32_t Data_byte_2 : 8;           /*!< [15..8] Payload Filter 2 low order bits / Payload Mask low order
                                                     bits for Pretended Networking payload filtering corresponding
                                                     to the data byte 2.                                                       */
      __IOM uint32_t Data_byte_1 : 8;           /*!< [23..16] Payload Filter 2 low order bits / Payload Mask low
                                                     order bits for Pretended Networking payload filtering corresponding
                                                     to the data byte 1.                                                       */
      __IOM uint32_t Data_byte_0 : 8;           /*!< [31..24] Payload Filter 2 low order bits / Payload Mask low
                                                     order bits for Pretended Networking payload filtering corresponding
                                                     to the data byte 0.                                                       */
    } CAN0_PL2_PLMASK_LO_b;
  } ;

  union {
    __IOM uint32_t CAN0_PL2_PLMASK_HI;          /*!< (@ 0x00000B24) Pretended Networking Payload High Filter 2 low
                                                                    order bits / Payload High Mask Register                    */

