nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Module Identification Number                                      */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } LPSPI0_VERID_b;
  } ;

  union {
    __IM  uint32_t LPSPI0_PARAM;                /*!< (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t TXFIFO     : 8;            /*!< [7..0] Transmit FIFO Size                                                 */
      __IM  uint32_t RXFIFO     : 8;            /*!< [15..8] Receive FIFO Size                                                 */
            uint32_t            : 16;
    } LPSPI0_PARAM_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t LPSPI0_CR;                   /*!< (@ 0x00000010) Control Register                                           */

    struct {
      __IOM uint32_t MEN        : 1;            /*!< [0..0] Module Enable                                                      */
      __IOM uint32_t RST        : 1;            /*!< [1..1] Software Reset                                                     */
      __IOM uint32_t DOZEN      : 1;            /*!< [2..2] Doze mode enable                                                   */
      __IOM uint32_t DBGEN      : 1;            /*!< [3..3] Debug Enable                                                       */
            uint32_t            : 4;
      __OM  uint32_t RTF        : 1;            /*!< [8..8] Reset Transmit FIFO                                                */
      __OM  uint32_t RRF        : 1;            /*!< [9..9] Reset Receive FIFO                                                 */
            uint32_t            : 22;
    } LPSPI0_CR_b;
  } ;

  union {
    __IOM uint32_t LPSPI0_SR;                   /*!< (@ 0x00000014) Status Register                                            */

    struct {
      __IM  uint32_t TDF        : 1;            /*!< [0..0] Transmit Data Flag                                                 */
      __IM  uint32_t RDF        : 1;            /*!< [1..1] Receive Data Flag                                                  */
            uint32_t            : 6;
      __IOM uint32_t WCF        : 1;            /*!< [8..8] Word Complete Flag                                                 */
      __IOM uint32_t FCF        : 1;            /*!< [9..9] Frame Complete Flag                                                */
      __IOM uint32_t TCF        : 1;            /*!< [10..10] Transfer Complete Flag                                           */
      __IOM uint32_t TEF        : 1;            /*!< [11..11] Transmit Error Flag                                              */
      __IOM uint32_t REF        : 1;            /*!< [12..12] Receive Error Flag                                               */
      __IOM uint32_t DMF        : 1;            /*!< [13..13] Data Match Flag                                                  */
            uint32_t            : 10;
      __IM  uint32_t MBF        : 1;            /*!< [24..24] Module Busy Flag                                                 */
            uint32_t            : 7;
    } LPSPI0_SR_b;
  } ;

  union {
    __IOM uint32_t LPSPI0_IER;                  /*!< (@ 0x00000018) Interrupt Enable Register                                  */

    struct {
      __IOM uint32_t TDIE       : 1;            /*!< [0..0] Transmit Data Interrupt Enable                                     */
      __IOM uint32_t RDIE       : 1;            /*!< [1..1] Receive Data Interrupt Enable                                      */
            uint32_t            : 6;
      __IOM uint32_t WCIE       : 1;            /*!< [8..8] Word Complete Interrupt Enable                                     */
      __IOM uint32_t FCIE       : 1;            /*!< [9..9] Frame Complete Interrupt Enable                                    */
      __IOM uint32_t TCIE       : 1;            /*!< [10..10] Transfer Complete Interrupt Enable                               */
      __IOM uint32_t TEIE       : 1;            /*!< [11..11] Transmit Error Interrupt Enable                                  */
      __IOM uint32_t REIE       : 1;            /*!< [12..12] Receive Error Interrupt Enable                                   */
      __IOM uint32_t DMIE       : 1;            /*!< [13..13] Data Match Interrupt Enable                                      */
            uint32_t            : 18;
    } LPSPI0_IER_b;
  } ;

  union {
    __IOM uint32_t LPSPI0_DER;                  /*!< (@ 0x0000001C) DMA Enable Register                                        */

    struct {
      __IOM uint32_t TDDE       : 1;            /*!< [0..0] Transmit Data DMA Enable                                           */
      __IOM uint32_t RDDE       : 1;            /*!< [1..1] Receive Data DMA Enable                                            */
            uint32_t            : 30;
    } LPSPI0_DER_b;
  } ;

  union {
    __IOM uint32_t LPSPI0_CFGR0;                /*!< (@ 0x00000020) Configuration Register 0                                   */

    struct {
      __IOM uint32_t HREN       : 1;            /*!< [0..0] Host Request Enable                                                */
      __IOM uint32_t HRPOL      : 1;            /*!< [1..1] Host Request Polarity                                              */
      __IOM uint32_t HRSEL      : 1;            /*!< [2..2] Host Request Select                                                */
            uint32_t            : 5;
      __IOM uint32_t CIRFIFO    : 1;            /*!< [8..8] Circular FIFO Enable                                               */
      __IOM uint32_t RDMO       : 1;            /*!< [9..9] Receive Data Match Only                                            */
            uint32_t            : 22;
    } LPSPI0_CFGR0_b;
  } ;

  union {
    __IOM uint32_t LPSPI0_CFGR1;                /*!< (@ 0x00000024) Configuration Register 1                                   */

