nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t MASTER     : 1;            /*!< [0..0] Master Mode                                                        */
      __IOM uint32_t SAMPLE     : 1;            /*!< [1..1] Sample Point                                                       */
      __IOM uint32_t AUTOPCS    : 1;            /*!< [2..2] Automatic PCS                                                      */
      __IOM uint32_t NOSTALL    : 1;            /*!< [3..3] No Stall                                                           */
            uint32_t            : 4;
      __IOM uint32_t PCSPOL     : 4;            /*!< [11..8] Peripheral Chip Select Polarity                                   */
            uint32_t            : 4;
      __IOM uint32_t MATCFG     : 3;            /*!< [18..16] Match Configuration                                              */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [25..24] Pin Configuration                                                */
      __IOM uint32_t OUTCFG     : 1;            /*!< [26..26] Output Config                                                    */
      __IOM uint32_t PCSCFG     : 1;            /*!< [27..27] Peripheral Chip Select Configuration                             */
            uint32_t            : 4;
    } LPSPI0_CFGR1_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t LPSPI0_DMR0;                 /*!< (@ 0x00000030) Data Match Register 0                                      */

    struct {
      __IOM uint32_t MATCH0     : 32;           /*!< [31..0] Match 0 Value                                                     */
    } LPSPI0_DMR0_b;
  } ;

  union {
    __IOM uint32_t LPSPI0_DMR1;                 /*!< (@ 0x00000034) Data Match Register 1                                      */

    struct {
      __IOM uint32_t MATCH1     : 32;           /*!< [31..0] Match 1 Value                                                     */
    } LPSPI0_DMR1_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t LPSPI0_CCR;                  /*!< (@ 0x00000040) Clock Configuration Register                               */

    struct {
      __IOM uint32_t SCKDIV     : 8;            /*!< [7..0] SCK Divider                                                        */
      __IOM uint32_t DBT        : 8;            /*!< [15..8] Delay Between Transfers                                           */
      __IOM uint32_t PCSSCK     : 8;            /*!< [23..16] PCS to SCK Delay                                                 */
      __IOM uint32_t SCKPCS     : 8;            /*!< [31..24] SCK to PCS Delay                                                 */
    } LPSPI0_CCR_b;
  } ;
  __IM  uint32_t  RESERVED3[5];

  union {
    __IOM uint32_t LPSPI0_FCR;                  /*!< (@ 0x00000058) FIFO Control Register                                      */

    struct {
      __IOM uint32_t TXWATER    : 2;            /*!< [1..0] Transmit FIFO Watermark                                            */
            uint32_t            : 14;
      __IOM uint32_t RXWATER    : 2;            /*!< [17..16] Receive FIFO Watermark                                           */
            uint32_t            : 14;
    } LPSPI0_FCR_b;
  } ;

  union {
    __IM  uint32_t LPSPI0_FSR;                  /*!< (@ 0x0000005C) FIFO Status Register                                       */

    struct {
      __IM  uint32_t TXCOUNT    : 3;            /*!< [2..0] Transmit FIFO Count                                                */
            uint32_t            : 13;
      __IM  uint32_t RXCOUNT    : 3;            /*!< [18..16] Receive FIFO Count                                               */
            uint32_t            : 13;
    } LPSPI0_FSR_b;
  } ;

  union {
    __IOM uint32_t LPSPI0_TCR;                  /*!< (@ 0x00000060) Transmit Command Register                                  */

    struct {
      __IOM uint32_t FRAMESZ    : 12;           /*!< [11..0] Frame Size                                                        */
            uint32_t            : 4;
      __IOM uint32_t WIDTH      : 2;            /*!< [17..16] Transfer Width                                                   */
      __IOM uint32_t TXMSK      : 1;            /*!< [18..18] Transmit Data Mask                                               */
      __IOM uint32_t RXMSK      : 1;            /*!< [19..19] Receive Data Mask                                                */
      __IOM uint32_t CONTC      : 1;            /*!< [20..20] Continuing Command                                               */
      __IOM uint32_t CONT       : 1;            /*!< [21..21] Continuous Transfer                                              */
      __IOM uint32_t BYSW       : 1;            /*!< [22..22] Byte Swap                                                        */
      __IOM uint32_t LSBF       : 1;            /*!< [23..23] LSB First                                                        */
      __IOM uint32_t PCS        : 2;            /*!< [25..24] Peripheral Chip Select                                           */
            uint32_t            : 1;
      __IOM uint32_t PRESCALE   : 3;            /*!< [29..27] Prescaler Value                                                  */
      __IOM uint32_t CPHA       : 1;            /*!< [30..30] Clock Phase                                                      */
      __IOM uint32_t CPOL       : 1;            /*!< [31..31] Clock Polarity                                                   */
    } LPSPI0_TCR_b;
  } ;

  union {
    __OM  uint32_t LPSPI0_TDR;                  /*!< (@ 0x00000064) Transmit Data Register                                     */

    struct {
      __OM  uint32_t DATA       : 32;           /*!< [31..0] Transmit Data                                                     */
    } LPSPI0_TDR_b;
  } ;
  __IM  uint32_t  RESERVED4[2];

  union {
    __IM  uint32_t LPSPI0_RSR;                  /*!< (@ 0x00000070) Receive Status Register                                    */

