nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t SOF        : 1;            /*!< [0..0] Start Of Frame                                                     */
      __IM  uint32_t RXEMPTY    : 1;            /*!< [1..1] RX FIFO Empty                                                      */
            uint32_t            : 30;
    } LPSPI0_RSR_b;
  } ;

  union {
    __IM  uint32_t LPSPI0_RDR;                  /*!< (@ 0x00000074) Receive Data Register                                      */

    struct {
      __IM  uint32_t DATA       : 32;           /*!< [31..0] Receive Data                                                      */
    } LPSPI0_RDR_b;
  } ;
} LPSPI0_Type;                                  /*!< Size = 120 (0x78)                                                         */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cyclic Redundancy Check (CRC)
  */

typedef struct {                                /*!< (@ 0x40032000) CRC Structure                                              */

  union {
    union {
      __IOM uint32_t CRC_DATA_CRC;              /*!< (@ 0x00000000) CRC Data register                                          */

      struct {
        __IOM uint32_t LL       : 8;            /*!< [7..0] CRC Low Lower Byte                                                 */
        __IOM uint32_t LU       : 8;            /*!< [15..8] CRC Low Upper Byte                                                */
        __IOM uint32_t HL       : 8;            /*!< [23..16] CRC High Lower Byte                                              */
        __IOM uint32_t HU       : 8;            /*!< [31..24] CRC High Upper Byte                                              */
      } CRC_DATA_CRC_b;
    } ;

    struct {
      union {
        union {
          __IOM uint16_t CRC_DATAL_CRC;         /*!< (@ 0x00000000) CRC_DATAL register.                                        */

          struct {
            __IOM uint16_t DATAL : 16;          /*!< [15..0] DATAL stores the lower 16 bits of the 16/32 bit CRC               */
          } CRC_DATAL_CRC_b;
        } ;

        struct {
          union {
            __IOM uint8_t CRC_DATALL_CRC;       /*!< (@ 0x00000000) CRC_DATALL register.                                       */

            struct {
              __IOM uint8_t DATALL : 8;         /*!< [7..0] CRCLL stores the first 8 bits of the 32 bit DATA                   */
            } CRC_DATALL_CRC_b;
          } ;

          union {
            __IOM uint8_t CRC_DATALU;           /*!< (@ 0x00000001) CRC_DATALU register.                                       */

            struct {
              __IOM uint8_t DATALU : 8;         /*!< [7..0] DATALL stores the second 8 bits of the 32 bit CRC                  */
            } CRC_DATALU_b;
          } ;
        };
      };

      union {
        union {
          __IOM uint16_t CRC_DATAH_CRC;         /*!< (@ 0x00000002) CRC_DATAH register.                                        */

          struct {
            __IOM uint16_t DATAH : 16;          /*!< [15..0] DATAH stores the high 16 bits of the 16/32 bit CRC                */
          } CRC_DATAH_CRC_b;
        } ;

        struct {
          union {
            __IOM uint8_t CRC_DATAHL_CRC;       /*!< (@ 0x00000002) CRC_DATAHL register.                                       */

            struct {
              __IOM uint8_t DATAHL : 8;         /*!< [7..0] DATAHL stores the third 8 bits of the 32 bit CRC                   */
            } CRC_DATAHL_CRC_b;
          } ;

          union {
            __IOM uint8_t CRC_DATAHU;           /*!< (@ 0x00000003) CRC_DATAHU register.                                       */

            struct {
              __IOM uint8_t DATAHU : 8;         /*!< [7..0] DATAHU stores the fourth 8 bits of the 32 bit CRC                  */
            } CRC_DATAHU_b;
          } ;
        };
      };
    };
  };

  union {
    __IOM uint32_t CRC_GPOLY;                   /*!< (@ 0x00000004) CRC Polynomial register                                    */

    struct {
      __IOM uint32_t LOW        : 16;           /*!< [15..0] Low Polynominal Half-word                                         */
      __IOM uint32_t HIGH       : 16;           /*!< [31..16] High Polynominal Half-word                                       */
    } CRC_GPOLY_b;
  } ;

  union {
    __IOM uint32_t CRC_CTRL;                    /*!< (@ 0x00000008) CRC Control register                                       */

    struct {
            uint32_t            : 24;
      __IOM uint32_t TCRC       : 1;            /*!< [24..24] TCRC                                                             */
      __IOM uint32_t WAS        : 1;            /*!< [25..25] Write CRC Data Register As Seed                                  */
      __IOM uint32_t FXOR       : 1;            /*!< [26..26] Complement Read Of CRC Data Register                             */
            uint32_t            : 1;
      __IOM uint32_t TOTR       : 2;            /*!< [29..28] Type Of Transpose For Read                                       */
      __IOM uint32_t TOT        : 2;            /*!< [31..30] Type Of Transpose For Writes                                     */
    } CRC_CTRL_b;
  } ;
} CRC_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           PDB0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Programmable Delay Block (PDB0)
  */

typedef struct {                                /*!< (@ 0x40036000) PDB0 Structure                                             */

  union {
    __IOM uint32_t PDB0_SC;                     /*!< (@ 0x00000000) Status and Control register                                */

