nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH0DLY6_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH0DLY7;                /*!< (@ 0x00000034) Channel n Delay 7 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH0DLY7_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1C1;                  /*!< (@ 0x00000038) Channel n Control register 1                               */

    struct {
      __IOM uint32_t EN         : 8;            /*!< [7..0] PDB Channel Pre-Trigger Enable                                     */
      __IOM uint32_t TOS        : 8;            /*!< [15..8] PDB Channel Pre-Trigger Output Select                             */
      __IOM uint32_t BB         : 8;            /*!< [23..16] PDB Channel Pre-Trigger Back-to-Back Operation Enable            */
            uint32_t            : 8;
    } PDB0_CH1C1_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1S;                   /*!< (@ 0x0000003C) Channel n Status register                                  */

    struct {
      __IOM uint32_t ERR        : 8;            /*!< [7..0] PDB Channel Sequence Error Flags                                   */
            uint32_t            : 8;
      __IOM uint32_t CF         : 8;            /*!< [23..16] PDB Channel Flags                                                */
            uint32_t            : 8;
    } PDB0_CH1S_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1DLY0;                /*!< (@ 0x00000040) Channel n Delay 0 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH1DLY0_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1DLY1;                /*!< (@ 0x00000044) Channel n Delay 1 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH1DLY1_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1DLY2;                /*!< (@ 0x00000048) Channel n Delay 2 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH1DLY2_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1DLY3;                /*!< (@ 0x0000004C) Channel n Delay 3 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH1DLY3_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1DLY4;                /*!< (@ 0x00000050) Channel n Delay 4 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH1DLY4_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1DLY5;                /*!< (@ 0x00000054) Channel n Delay 5 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH1DLY5_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1DLY6;                /*!< (@ 0x00000058) Channel n Delay 6 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH1DLY6_b;
  } ;

  union {
    __IOM uint32_t PDB0_CH1DLY7;                /*!< (@ 0x0000005C) Channel n Delay 7 register                                 */

    struct {
      __IOM uint32_t DLY        : 16;           /*!< [15..0] PDB Channel Delay                                                 */
            uint32_t            : 16;
    } PDB0_CH1DLY7_b;
  } ;
  __IM  uint32_t  RESERVED[76];

  union {
    __IOM uint32_t PDB0_POEN;                   /*!< (@ 0x00000190) Pulse-Out n Enable register                                */

    struct {
      __IOM uint32_t POEN       : 8;            /*!< [7..0] PDB Pulse-Out Enable                                               */
            uint32_t            : 24;
    } PDB0_POEN_b;
  } ;

  union {
    union {
      __IOM uint32_t PDB0_PODLY_PDB0;           /*!< (@ 0x00000194) Pulse-Out n Delay register                                 */

      struct {
        __IOM uint32_t DLY2     : 16;           /*!< [15..0] PDB Pulse-Out Delay 2                                             */
        __IOM uint32_t DLY1     : 16;           /*!< [31..16] PDB Pulse-Out Delay 1                                            */
      } PDB0_PODLY_PDB0_b;
    } ;

    struct {
      union {
        __IOM uint16_t PDB0_DLY2_PDB0;          /*!< (@ 0x00000194) PDB0_DLY2 register.                                        */

        struct {
          __IOM uint16_t DLY2   : 16;           /*!< [15..0] DLY2                                                              */
        } PDB0_DLY2_PDB0_b;
      } ;

      union {
        __IOM uint16_t PDB0_DLY1;               /*!< (@ 0x00000196) PDB0_DLY1 register.                                        */

        struct {
          __IOM uint16_t DLY1   : 16;           /*!< [15..0] DLY1                                                              */
        } PDB0_DLY1_b;
      } ;
    };
  };
} PDB0_Type;                                    /*!< Size = 408 (0x198)                                                        */



/* =========================================================================================================================== */
/* ================                                           LPIT0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low Power Periodic Interrupt Timer (LPIT) (LPIT0)
  */

typedef struct {                                /*!< (@ 0x40037000) LPIT0 Structure                                            */

  union {
    __IM  uint32_t LPIT0_VERID;                 /*!< (@ 0x00000000) Version ID Register                                        */

