nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Feature Number                                                    */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } LPIT0_VERID_b;
  } ;

  union {
    __IM  uint32_t LPIT0_PARAM;                 /*!< (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t CHANNEL    : 8;            /*!< [7..0] Number of Timer Channels                                           */
      __IM  uint32_t EXT_TRIG   : 8;            /*!< [15..8] Number of External Trigger Inputs                                 */
            uint32_t            : 16;
    } LPIT0_PARAM_b;
  } ;

  union {
    __IOM uint32_t LPIT0_MCR;                   /*!< (@ 0x00000008) Module Control Register                                    */

    struct {
      __IOM uint32_t M_CEN      : 1;            /*!< [0..0] Module Clock Enable                                                */
      __IOM uint32_t SW_RST     : 1;            /*!< [1..1] Software Reset Bit                                                 */
      __IOM uint32_t DOZE_EN    : 1;            /*!< [2..2] DOZE Mode Enable Bit                                               */
      __IOM uint32_t DBG_EN     : 1;            /*!< [3..3] Debug Enable Bit                                                   */
            uint32_t            : 28;
    } LPIT0_MCR_b;
  } ;

  union {
    __IOM uint32_t LPIT0_MSR;                   /*!< (@ 0x0000000C) Module Status Register                                     */

    struct {
      __IOM uint32_t TIF0       : 1;            /*!< [0..0] Channel 0 Timer Interrupt Flag                                     */
      __IOM uint32_t TIF1       : 1;            /*!< [1..1] Channel 1 Timer Interrupt Flag                                     */
      __IOM uint32_t TIF2       : 1;            /*!< [2..2] Channel 2 Timer Interrupt Flag                                     */
      __IOM uint32_t TIF3       : 1;            /*!< [3..3] Channel 3 Timer Interrupt Flag                                     */
            uint32_t            : 28;
    } LPIT0_MSR_b;
  } ;

  union {
    __IOM uint32_t LPIT0_MIER;                  /*!< (@ 0x00000010) Module Interrupt Enable Register                           */

    struct {
      __IOM uint32_t TIE0       : 1;            /*!< [0..0] Channel 0 Timer Interrupt Enable                                   */
      __IOM uint32_t TIE1       : 1;            /*!< [1..1] Channel 1 Timer Interrupt Enable                                   */
      __IOM uint32_t TIE2       : 1;            /*!< [2..2] Channel 2 Timer Interrupt Enable                                   */
      __IOM uint32_t TIE3       : 1;            /*!< [3..3] Channel 3 Timer Interrupt Enable                                   */
            uint32_t            : 28;
    } LPIT0_MIER_b;
  } ;

  union {
    __IOM uint32_t LPIT0_SETTEN;                /*!< (@ 0x00000014) Set Timer Enable Register                                  */

    struct {
      __IOM uint32_t SET_T_EN_0 : 1;            /*!< [0..0] Set Timer 0 Enable                                                 */
      __IOM uint32_t SET_T_EN_1 : 1;            /*!< [1..1] Set Timer 1 Enable                                                 */
      __IOM uint32_t SET_T_EN_2 : 1;            /*!< [2..2] Set Timer 2 Enable                                                 */
      __IOM uint32_t SET_T_EN_3 : 1;            /*!< [3..3] Set Timer 3 Enable                                                 */
            uint32_t            : 28;
    } LPIT0_SETTEN_b;
  } ;

  union {
    __IOM uint32_t LPIT0_CLRTEN;                /*!< (@ 0x00000018) Clear Timer Enable Register                                */

    struct {
      __OM  uint32_t CLR_T_EN_0 : 1;            /*!< [0..0] Clear Timer 0 Enable                                               */
      __OM  uint32_t CLR_T_EN_1 : 1;            /*!< [1..1] Clear Timer 1 Enable                                               */
      __OM  uint32_t CLR_T_EN_2 : 1;            /*!< [2..2] Clear Timer 2 Enable                                               */
      __OM  uint32_t CLR_T_EN_3 : 1;            /*!< [3..3] Clear Timer 3 Enable                                               */
            uint32_t            : 28;
    } LPIT0_CLRTEN_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t LPIT0_TVAL0;                 /*!< (@ 0x00000020) Timer Value Register                                       */

    struct {
      __IOM uint32_t TMR_VAL    : 32;           /*!< [31..0] Timer Value                                                       */
    } LPIT0_TVAL0_b;
  } ;

  union {
    __IM  uint32_t LPIT0_CVAL0;                 /*!< (@ 0x00000024) Current Timer Value                                        */

    struct {
      __IM  uint32_t TMR_CUR_VAL : 32;          /*!< [31..0] Current Timer Value                                               */
    } LPIT0_CVAL0_b;
  } ;

  union {
    __IOM uint32_t LPIT0_TCTRL0;                /*!< (@ 0x00000028) Timer Control Register                                     */

    struct {
      __IOM uint32_t T_EN       : 1;            /*!< [0..0] Timer Enable                                                       */
      __IOM uint32_t CHAIN      : 1;            /*!< [1..1] Chain Channel                                                      */
      __IOM uint32_t MODE       : 2;            /*!< [3..2] Timer Operation Mode                                               */
            uint32_t            : 12;
      __IOM uint32_t TSOT       : 1;            /*!< [16..16] Timer Start On Trigger                                           */
      __IOM uint32_t TSOI       : 1;            /*!< [17..17] Timer Stop On Interrupt                                          */
      __IOM uint32_t TROT       : 1;            /*!< [18..18] Timer Reload On Trigger                                          */
            uint32_t            : 4;
      __IOM uint32_t TRG_SRC    : 1;            /*!< [23..23] Trigger Source                                                   */
      __IOM uint32_t TRG_SEL    : 4;            /*!< [27..24] Trigger Select                                                   */
            uint32_t            : 4;
    } LPIT0_TCTRL0_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t LPIT0_TVAL1;                 /*!< (@ 0x00000030) Timer Value Register                                       */

