nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t PS         : 3;            /*!< [2..0] Prescale Factor Selection                                          */
      __IOM uint32_t CLKS       : 2;            /*!< [4..3] Clock Source Selection                                             */
      __IOM uint32_t CPWMS      : 1;            /*!< [5..5] Center-Aligned PWM Select                                          */
      __IOM uint32_t RIE        : 1;            /*!< [6..6] Reload Point Interrupt Enable                                      */
      __IM  uint32_t RF         : 1;            /*!< [7..7] Reload Flag                                                        */
      __IOM uint32_t TOIE       : 1;            /*!< [8..8] Timer Overflow Interrupt Enable                                    */
      __IM  uint32_t TOF        : 1;            /*!< [9..9] Timer Overflow Flag                                                */
            uint32_t            : 6;
      __IOM uint32_t PWMEN0     : 1;            /*!< [16..16] Channel 0 PWM enable bit                                         */
      __IOM uint32_t PWMEN1     : 1;            /*!< [17..17] Channel 1 PWM enable bit                                         */
      __IOM uint32_t PWMEN2     : 1;            /*!< [18..18] Channel 2 PWM enable bit                                         */
      __IOM uint32_t PWMEN3     : 1;            /*!< [19..19] Channel 3 PWM enable bit                                         */
      __IOM uint32_t PWMEN4     : 1;            /*!< [20..20] Channel 4 PWM enable bit                                         */
      __IOM uint32_t PWMEN5     : 1;            /*!< [21..21] Channel 5 PWM enable bit                                         */
      __IOM uint32_t PWMEN6     : 1;            /*!< [22..22] Channel 6 PWM enable bit                                         */
      __IOM uint32_t PWMEN7     : 1;            /*!< [23..23] Channel 7 PWM enable bit                                         */
      __IOM uint32_t FLTPS      : 4;            /*!< [27..24] Filter Prescaler                                                 */
            uint32_t            : 4;
    } FTM0_SC_b;
  } ;

  union {
    __IOM uint32_t FTM0_CNT;                    /*!< (@ 0x00000004) Counter                                                    */

    struct {
      __IOM uint32_t COUNT      : 16;           /*!< [15..0] Counter Value                                                     */
            uint32_t            : 16;
    } FTM0_CNT_b;
  } ;

  union {
    __IOM uint32_t FTM0_MOD;                    /*!< (@ 0x00000008) Modulo                                                     */

    struct {
      __IOM uint32_t MOD        : 16;           /*!< [15..0] MOD                                                               */
            uint32_t            : 16;
    } FTM0_MOD_b;
  } ;

  union {
    __IOM uint32_t FTM0_C0SC;                   /*!< (@ 0x0000000C) Channel (n) Status And Control                             */

    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM0_C0SC_b;
  } ;

  union {
    __IOM uint32_t FTM0_C0V;                    /*!< (@ 0x00000010) Channel (n) Value                                          */

    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM0_C0V_b;
  } ;

  union {
    __IOM uint32_t FTM0_C1SC;                   /*!< (@ 0x00000014) Channel (n) Status And Control                             */

    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM0_C1SC_b;
  } ;

  union {
    __IOM uint32_t FTM0_C1V;                    /*!< (@ 0x00000018) Channel (n) Value                                          */

