nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM0_C5SC_b;
  } ;

  union {
    __IOM uint32_t FTM0_C5V;                    /*!< (@ 0x00000038) Channel (n) Value                                          */

    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM0_C5V_b;
  } ;

  union {
    __IOM uint32_t FTM0_C6SC;                   /*!< (@ 0x0000003C) Channel (n) Status And Control                             */

    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM0_C6SC_b;
  } ;

  union {
    __IOM uint32_t FTM0_C6V;                    /*!< (@ 0x00000040) Channel (n) Value                                          */

    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM0_C6V_b;
  } ;

  union {
    __IOM uint32_t FTM0_C7SC;                   /*!< (@ 0x00000044) Channel (n) Status And Control                             */

    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM0_C7SC_b;
  } ;

  union {
    __IOM uint32_t FTM0_C7V;                    /*!< (@ 0x00000048) Channel (n) Value                                          */

    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM0_C7V_b;
  } ;

  union {
    __IOM uint32_t FTM0_CNTIN;                  /*!< (@ 0x0000004C) Counter Initial Value                                      */

    struct {
      __IOM uint32_t INIT       : 16;           /*!< [15..0] INIT                                                              */
            uint32_t            : 16;
    } FTM0_CNTIN_b;
  } ;

  union {
    __IM  uint32_t FTM0_STATUS;                 /*!< (@ 0x00000050) Capture And Compare Status                                 */

