nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t COMBINE0   : 1;            /*!< [0..0] Combine Channels For n = 0                                         */
      __IOM uint32_t COMP0      : 1;            /*!< [1..1] Complement Of Channel (n) For n = 0                                */
      __IOM uint32_t DECAPEN0   : 1;            /*!< [2..2] Dual Edge Capture Mode Enable For n = 0                            */
      __IOM uint32_t DECAP0     : 1;            /*!< [3..3] Dual Edge Capture Mode Captures For n = 0                          */
      __IOM uint32_t DTEN0      : 1;            /*!< [4..4] Deadtime Enable For n = 0                                          */
      __IOM uint32_t SYNCEN0    : 1;            /*!< [5..5] Synchronization Enable For n = 0                                   */
      __IOM uint32_t FAULTEN0   : 1;            /*!< [6..6] Fault Control Enable For n = 0                                     */
      __IOM uint32_t MCOMBINE0  : 1;            /*!< [7..7] Modified Combine Mode For n = 0                                    */
      __IOM uint32_t COMBINE1   : 1;            /*!< [8..8] Combine Channels For n = 2                                         */
      __IOM uint32_t COMP1      : 1;            /*!< [9..9] Complement Of Channel (n) For n = 2                                */
      __IOM uint32_t DECAPEN1   : 1;            /*!< [10..10] Dual Edge Capture Mode Enable For n = 2                          */
      __IOM uint32_t DECAP1     : 1;            /*!< [11..11] Dual Edge Capture Mode Captures For n = 2                        */
      __IOM uint32_t DTEN1      : 1;            /*!< [12..12] Deadtime Enable For n = 2                                        */
      __IOM uint32_t SYNCEN1    : 1;            /*!< [13..13] Synchronization Enable For n = 2                                 */
      __IOM uint32_t FAULTEN1   : 1;            /*!< [14..14] Fault Control Enable For n = 2                                   */
      __IOM uint32_t MCOMBINE1  : 1;            /*!< [15..15] Modified Combine Mode For n = 2                                  */
      __IOM uint32_t COMBINE2   : 1;            /*!< [16..16] Combine Channels For n = 4                                       */
      __IOM uint32_t COMP2      : 1;            /*!< [17..17] Complement Of Channel (n) For n = 4                              */
      __IOM uint32_t DECAPEN2   : 1;            /*!< [18..18] Dual Edge Capture Mode Enable For n = 4                          */
      __IOM uint32_t DECAP2     : 1;            /*!< [19..19] Dual Edge Capture Mode Captures For n = 4                        */
      __IOM uint32_t DTEN2      : 1;            /*!< [20..20] Deadtime Enable For n = 4                                        */
      __IOM uint32_t SYNCEN2    : 1;            /*!< [21..21] Synchronization Enable For n = 4                                 */
      __IOM uint32_t FAULTEN2   : 1;            /*!< [22..22] Fault Control Enable For n = 4                                   */
      __IOM uint32_t MCOMBINE2  : 1;            /*!< [23..23] Modified Combine Mode For n = 4                                  */
      __IOM uint32_t COMBINE3   : 1;            /*!< [24..24] Combine Channels For n = 6                                       */
      __IOM uint32_t COMP3      : 1;            /*!< [25..25] Complement Of Channel (n) for n = 6                              */
      __IOM uint32_t DECAPEN3   : 1;            /*!< [26..26] Dual Edge Capture Mode Enable For n = 6                          */
      __IOM uint32_t DECAP3     : 1;            /*!< [27..27] Dual Edge Capture Mode Captures For n = 6                        */
      __IOM uint32_t DTEN3      : 1;            /*!< [28..28] Deadtime Enable For n = 6                                        */
      __IOM uint32_t SYNCEN3    : 1;            /*!< [29..29] Synchronization Enable For n = 6                                 */
      __IOM uint32_t FAULTEN3   : 1;            /*!< [30..30] Fault Control Enable For n = 6                                   */
      __IOM uint32_t MCOMBINE3  : 1;            /*!< [31..31] Modified Combine Mode For n = 6                                  */
    } FTM0_COMBINE_b;
  } ;

  union {
    __IOM uint32_t FTM0_DEADTIME;               /*!< (@ 0x00000068) Deadtime Configuration                                     */

    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM0_DEADTIME_b;
  } ;

  union {
    __IOM uint32_t FTM0_EXTTRIG;                /*!< (@ 0x0000006C) FTM External Trigger                                       */

    struct {
      __IOM uint32_t CH2TRIG    : 1;            /*!< [0..0] Channel 2 External Trigger Enable                                  */
      __IOM uint32_t CH3TRIG    : 1;            /*!< [1..1] Channel 3 External Trigger Enable                                  */
      __IOM uint32_t CH4TRIG    : 1;            /*!< [2..2] Channel 4 External Trigger Enable                                  */
      __IOM uint32_t CH5TRIG    : 1;            /*!< [3..3] Channel 5 External Trigger Enable                                  */
      __IOM uint32_t CH0TRIG    : 1;            /*!< [4..4] Channel 0 External Trigger Enable                                  */
      __IOM uint32_t CH1TRIG    : 1;            /*!< [5..5] Channel 1 External Trigger Enable                                  */
      __IOM uint32_t INITTRIGEN : 1;            /*!< [6..6] Initialization Trigger Enable                                      */
      __IM  uint32_t TRIGF      : 1;            /*!< [7..7] Channel Trigger Flag                                               */
      __IOM uint32_t CH6TRIG    : 1;            /*!< [8..8] Channel 6 External Trigger Enable                                  */
      __IOM uint32_t CH7TRIG    : 1;            /*!< [9..9] Channel 7 External Trigger Enable                                  */
            uint32_t            : 22;
    } FTM0_EXTTRIG_b;
  } ;

  union {
    __IOM uint32_t FTM0_POL;                    /*!< (@ 0x00000070) Channels Polarity                                          */

