nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t FLT0POL    : 1;            /*!< [0..0] Fault Input 0 Polarity                                             */
      __IOM uint32_t FLT1POL    : 1;            /*!< [1..1] Fault Input 1 Polarity                                             */
      __IOM uint32_t FLT2POL    : 1;            /*!< [2..2] Fault Input 2 Polarity                                             */
      __IOM uint32_t FLT3POL    : 1;            /*!< [3..3] Fault Input 3 Polarity                                             */
            uint32_t            : 28;
    } FTM0_FLTPOL_b;
  } ;

  union {
    __IOM uint32_t FTM0_SYNCONF;                /*!< (@ 0x0000008C) Synchronization Configuration                              */

    struct {
      __IOM uint32_t HWTRIGMODE : 1;            /*!< [0..0] Hardware Trigger Mode                                              */
            uint32_t            : 1;
      __IOM uint32_t CNTINC     : 1;            /*!< [2..2] CNTIN Register Synchronization                                     */
            uint32_t            : 1;
      __IOM uint32_t INVC       : 1;            /*!< [4..4] INVCTRL Register Synchronization                                   */
      __IOM uint32_t SWOC       : 1;            /*!< [5..5] SWOCTRL Register Synchronization                                   */
            uint32_t            : 1;
      __IOM uint32_t SYNCMODE   : 1;            /*!< [7..7] Synchronization Mode                                               */
      __IOM uint32_t SWRSTCNT   : 1;            /*!< [8..8] FTM counter synchronization is activated by the software
                                                     trigger                                                                   */
      __IOM uint32_t SWWRBUF    : 1;            /*!< [9..9] MOD, HCR, CNTIN, and CV registers synchronization is
                                                     activated by the software trigger                                         */
      __IOM uint32_t SWOM       : 1;            /*!< [10..10] Output mask synchronization is activated by the software
                                                     trigger                                                                   */
      __IOM uint32_t SWINVC     : 1;            /*!< [11..11] Inverting control synchronization is activated by the
                                                     software trigger                                                          */
      __IOM uint32_t SWSOC      : 1;            /*!< [12..12] Software output control synchronization is activated
                                                     by the software trigger                                                   */
            uint32_t            : 3;
      __IOM uint32_t HWRSTCNT   : 1;            /*!< [16..16] FTM counter synchronization is activated by a hardware
                                                     trigger                                                                   */
      __IOM uint32_t HWWRBUF    : 1;            /*!< [17..17] MOD, HCR, CNTIN, and CV registers synchronization is
                                                     activated by a hardware trigger                                           */
      __IOM uint32_t HWOM       : 1;            /*!< [18..18] Output mask synchronization is activated by a hardware
                                                     trigger                                                                   */
      __IOM uint32_t HWINVC     : 1;            /*!< [19..19] Inverting control synchronization is activated by a
                                                     hardware trigger                                                          */
      __IOM uint32_t HWSOC      : 1;            /*!< [20..20] Software output control synchronization is activated
                                                     by a hardware trigger                                                     */
            uint32_t            : 11;
    } FTM0_SYNCONF_b;
  } ;

  union {
    __IOM uint32_t FTM0_INVCTRL;                /*!< (@ 0x00000090) FTM Inverting Control                                      */

    struct {
      __IOM uint32_t INV0EN     : 1;            /*!< [0..0] Pair Channels 0 Inverting Enable                                   */
      __IOM uint32_t INV1EN     : 1;            /*!< [1..1] Pair Channels 1 Inverting Enable                                   */
      __IOM uint32_t INV2EN     : 1;            /*!< [2..2] Pair Channels 2 Inverting Enable                                   */
      __IOM uint32_t INV3EN     : 1;            /*!< [3..3] Pair Channels 3 Inverting Enable                                   */
            uint32_t            : 28;
    } FTM0_INVCTRL_b;
  } ;

  union {
    __IOM uint32_t FTM0_SWOCTRL;                /*!< (@ 0x00000094) FTM Software Output Control                                */

    struct {
      __IOM uint32_t CH0OC      : 1;            /*!< [0..0] Channel 0 Software Output Control Enable                           */
      __IOM uint32_t CH1OC      : 1;            /*!< [1..1] Channel 1 Software Output Control Enable                           */
      __IOM uint32_t CH2OC      : 1;            /*!< [2..2] Channel 2 Software Output Control Enable                           */
      __IOM uint32_t CH3OC      : 1;            /*!< [3..3] Channel 3 Software Output Control Enable                           */
      __IOM uint32_t CH4OC      : 1;            /*!< [4..4] Channel 4 Software Output Control Enable                           */
      __IOM uint32_t CH5OC      : 1;            /*!< [5..5] Channel 5 Software Output Control Enable                           */
      __IOM uint32_t CH6OC      : 1;            /*!< [6..6] Channel 6 Software Output Control Enable                           */
      __IOM uint32_t CH7OC      : 1;            /*!< [7..7] Channel 7 Software Output Control Enable                           */
      __IOM uint32_t CH0OCV     : 1;            /*!< [8..8] Channel 0 Software Output Control Value                            */
      __IOM uint32_t CH1OCV     : 1;            /*!< [9..9] Channel 1 Software Output Control Value                            */
      __IOM uint32_t CH2OCV     : 1;            /*!< [10..10] Channel 2 Software Output Control Value                          */
      __IOM uint32_t CH3OCV     : 1;            /*!< [11..11] Channel 3 Software Output Control Value                          */
      __IOM uint32_t CH4OCV     : 1;            /*!< [12..12] Channel 4 Software Output Control Value                          */
      __IOM uint32_t CH5OCV     : 1;            /*!< [13..13] Channel 5 Software Output Control Value                          */
      __IOM uint32_t CH6OCV     : 1;            /*!< [14..14] Channel 6 Software Output Control Value                          */
      __IOM uint32_t CH7OCV     : 1;            /*!< [15..15] Channel 7 Software Output Control Value                          */
            uint32_t            : 16;
    } FTM0_SWOCTRL_b;
  } ;

  union {
    __IOM uint32_t FTM0_PWMLOAD;                /*!< (@ 0x00000098) FTM PWM Load                                               */

