nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t CH0SEL     : 1;            /*!< [0..0] Channel 0 Select                                                   */
      __IOM uint32_t CH1SEL     : 1;            /*!< [1..1] Channel 1 Select                                                   */
      __IOM uint32_t CH2SEL     : 1;            /*!< [2..2] Channel 2 Select                                                   */
      __IOM uint32_t CH3SEL     : 1;            /*!< [3..3] Channel 3 Select                                                   */
      __IOM uint32_t CH4SEL     : 1;            /*!< [4..4] Channel 4 Select                                                   */
      __IOM uint32_t CH5SEL     : 1;            /*!< [5..5] Channel 5 Select                                                   */
      __IOM uint32_t CH6SEL     : 1;            /*!< [6..6] Channel 6 Select                                                   */
      __IOM uint32_t CH7SEL     : 1;            /*!< [7..7] Channel 7 Select                                                   */
      __IOM uint32_t HCSEL      : 1;            /*!< [8..8] Half Cycle Select                                                  */
      __IOM uint32_t LDOK       : 1;            /*!< [9..9] Load Enable                                                        */
      __IOM uint32_t GLEN       : 1;            /*!< [10..10] Global Load Enable                                               */
      __OM  uint32_t GLDOK      : 1;            /*!< [11..11] Global Load OK                                                   */
            uint32_t            : 20;
    } FTM0_PWMLOAD_b;
  } ;

  union {
    __IOM uint32_t FTM0_HCR;                    /*!< (@ 0x0000009C) Half Cycle Register                                        */

    struct {
      __IOM uint32_t HCVAL      : 16;           /*!< [15..0] Half Cycle Value                                                  */
            uint32_t            : 16;
    } FTM0_HCR_b;
  } ;

  union {
    __IOM uint32_t FTM0_PAIR0DEADTIME;          /*!< (@ 0x000000A0) Pair 0 Deadtime Configuration                              */

    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM0_PAIR0DEADTIME_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t FTM0_PAIR1DEADTIME;          /*!< (@ 0x000000A8) Pair 1 Deadtime Configuration                              */

    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM0_PAIR1DEADTIME_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t FTM0_PAIR2DEADTIME;          /*!< (@ 0x000000B0) Pair 2 Deadtime Configuration                              */

    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM0_PAIR2DEADTIME_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t FTM0_PAIR3DEADTIME;          /*!< (@ 0x000000B8) Pair 3 Deadtime Configuration                              */

    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM0_PAIR3DEADTIME_b;
  } ;
  __IM  uint32_t  RESERVED3[81];

  union {
    __IOM uint32_t FTM0_MOD_MIRROR;             /*!< (@ 0x00000200) Mirror of Modulo Value                                     */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACMOD    : 5;            /*!< [15..11] Modulo Fractional Value                                          */
      __IOM uint32_t MOD        : 16;           /*!< [31..16] Mirror of the Modulo Integer Value                               */
    } FTM0_MOD_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM0_C0V_MIRROR;             /*!< (@ 0x00000204) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM0_C0V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM0_C1V_MIRROR;             /*!< (@ 0x00000208) Mirror of Channel (n) Match Value                          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t FRACVAL    : 5;            /*!< [15..11] Channel (n) Match Fractional Value                               */
      __IOM uint32_t VAL        : 16;           /*!< [31..16] Mirror of the Channel (n) Match Integer Value                    */
    } FTM0_C1V_MIRROR_b;
  } ;

  union {
    __IOM uint32_t FTM0_C2V_MIRROR;             /*!< (@ 0x0000020C) Mirror of Channel (n) Match Value                          */

