nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM1_C6V_b;
  } ;

  union {
    __IOM uint32_t FTM1_C7SC;                   /*!< (@ 0x00000044) Channel (n) Status And Control                             */

    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] DMA Enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< [1..1] FTM counter reset by the selected input capture event.             */
      __IOM uint32_t ELSA       : 1;            /*!< [2..2] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t ELSB       : 1;            /*!< [3..3] Channel (n) Edge or Level Select                                   */
      __IOM uint32_t MSA        : 1;            /*!< [4..4] Channel (n) Mode Select                                            */
      __IOM uint32_t MSB        : 1;            /*!< [5..5] Channel (n) Mode Select                                            */
      __IOM uint32_t CHIE       : 1;            /*!< [6..6] Channel (n) Interrupt Enable                                       */
      __IM  uint32_t CHF        : 1;            /*!< [7..7] Channel (n) Flag                                                   */
      __IOM uint32_t TRIGMODE   : 1;            /*!< [8..8] Trigger mode control                                               */
      __IM  uint32_t CHIS       : 1;            /*!< [9..9] Channel (n) Input State                                            */
      __IM  uint32_t CHOV       : 1;            /*!< [10..10] Channel (n) Output Value                                         */
            uint32_t            : 21;
    } FTM1_C7SC_b;
  } ;

  union {
    __IOM uint32_t FTM1_C7V;                    /*!< (@ 0x00000048) Channel (n) Value                                          */

    struct {
      __IOM uint32_t VAL        : 16;           /*!< [15..0] Channel Value                                                     */
            uint32_t            : 16;
    } FTM1_C7V_b;
  } ;

  union {
    __IOM uint32_t FTM1_CNTIN;                  /*!< (@ 0x0000004C) Counter Initial Value                                      */

    struct {
      __IOM uint32_t INIT       : 16;           /*!< [15..0] INIT                                                              */
            uint32_t            : 16;
    } FTM1_CNTIN_b;
  } ;

  union {
    __IM  uint32_t FTM1_STATUS;                 /*!< (@ 0x00000050) Capture And Compare Status                                 */

    struct {
      __IM  uint32_t CH0F       : 1;            /*!< [0..0] Channel 0 Flag                                                     */
      __IM  uint32_t CH1F       : 1;            /*!< [1..1] Channel 1 Flag                                                     */
      __IM  uint32_t CH2F       : 1;            /*!< [2..2] Channel 2 Flag                                                     */
      __IM  uint32_t CH3F       : 1;            /*!< [3..3] Channel 3 Flag                                                     */
      __IM  uint32_t CH4F       : 1;            /*!< [4..4] Channel 4 Flag                                                     */
      __IM  uint32_t CH5F       : 1;            /*!< [5..5] Channel 5 Flag                                                     */
      __IM  uint32_t CH6F       : 1;            /*!< [6..6] Channel 6 Flag                                                     */
      __IM  uint32_t CH7F       : 1;            /*!< [7..7] Channel 7 Flag                                                     */
            uint32_t            : 24;
    } FTM1_STATUS_b;
  } ;

  union {
    __IOM uint32_t FTM1_MODE;                   /*!< (@ 0x00000054) Features Mode Selection                                    */

    struct {
      __IOM uint32_t FTMEN      : 1;            /*!< [0..0] FTM Enable                                                         */
      __OM  uint32_t INIT       : 1;            /*!< [1..1] Initialize The Channels Output                                     */
      __IOM uint32_t WPDIS      : 1;            /*!< [2..2] Write Protection Disable                                           */
      __IOM uint32_t PWMSYNC    : 1;            /*!< [3..3] PWM Synchronization Mode                                           */
      __IOM uint32_t CAPTEST    : 1;            /*!< [4..4] Capture Test Mode Enable                                           */
      __IOM uint32_t FAULTM     : 2;            /*!< [6..5] Fault Control Mode                                                 */
      __IOM uint32_t FAULTIE    : 1;            /*!< [7..7] Fault Interrupt Enable                                             */
            uint32_t            : 24;
    } FTM1_MODE_b;
  } ;

  union {
    __IOM uint32_t FTM1_SYNC;                   /*!< (@ 0x00000058) Synchronization                                            */

    struct {
      __IOM uint32_t CNTMIN     : 1;            /*!< [0..0] Minimum Loading Point Enable                                       */
      __IOM uint32_t CNTMAX     : 1;            /*!< [1..1] Maximum Loading Point Enable                                       */
      __IOM uint32_t REINIT     : 1;            /*!< [2..2] FTM Counter Reinitialization by Synchronization                    */
      __IOM uint32_t SYNCHOM    : 1;            /*!< [3..3] Output Mask Synchronization                                        */
      __IOM uint32_t TRIG0      : 1;            /*!< [4..4] PWM Synchronization Hardware Trigger 0                             */
      __IOM uint32_t TRIG1      : 1;            /*!< [5..5] PWM Synchronization Hardware Trigger 1                             */
      __IOM uint32_t TRIG2      : 1;            /*!< [6..6] PWM Synchronization Hardware Trigger 2                             */
      __IOM uint32_t SWSYNC     : 1;            /*!< [7..7] PWM Synchronization Software Trigger                               */
            uint32_t            : 24;
    } FTM1_SYNC_b;
  } ;

  union {
    __IOM uint32_t FTM1_OUTINIT;                /*!< (@ 0x0000005C) Initial State For Channels Output                          */

