nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t QUADEN     : 1;            /*!< [0..0] Quadrature Decoder Mode Enable                                     */
      __IM  uint32_t TOFDIR     : 1;            /*!< [1..1] Timer Overflow Direction In Quadrature Decoder Mode                */
      __IM  uint32_t QUADIR     : 1;            /*!< [2..2] FTM Counter Direction In Quadrature Decoder Mode                   */
      __IOM uint32_t QUADMODE   : 1;            /*!< [3..3] Quadrature Decoder Mode                                            */
      __IOM uint32_t PHBPOL     : 1;            /*!< [4..4] Phase B Input Polarity                                             */
      __IOM uint32_t PHAPOL     : 1;            /*!< [5..5] Phase A Input Polarity                                             */
      __IOM uint32_t PHBFLTREN  : 1;            /*!< [6..6] Phase B Input Filter Enable                                        */
      __IOM uint32_t PHAFLTREN  : 1;            /*!< [7..7] Phase A Input Filter Enable                                        */
            uint32_t            : 24;
    } FTM1_QDCTRL_b;
  } ;

  union {
    __IOM uint32_t FTM1_CONF;                   /*!< (@ 0x00000084) Configuration                                              */

    struct {
      __IOM uint32_t LDFQ       : 5;            /*!< [4..0] Frequency of the Reload Opportunities                              */
            uint32_t            : 1;
      __IOM uint32_t BDMMODE    : 2;            /*!< [7..6] Debug Mode                                                         */
            uint32_t            : 1;
      __IOM uint32_t GTBEEN     : 1;            /*!< [9..9] Global Time Base Enable                                            */
      __IOM uint32_t GTBEOUT    : 1;            /*!< [10..10] Global Time Base Output                                          */
      __IOM uint32_t ITRIGR     : 1;            /*!< [11..11] Initialization trigger on Reload Point                           */
            uint32_t            : 20;
    } FTM1_CONF_b;
  } ;

  union {
    __IOM uint32_t FTM1_FLTPOL;                 /*!< (@ 0x00000088) FTM Fault Input Polarity                                   */

    struct {
      __IOM uint32_t FLT0POL    : 1;            /*!< [0..0] Fault Input 0 Polarity                                             */
      __IOM uint32_t FLT1POL    : 1;            /*!< [1..1] Fault Input 1 Polarity                                             */
      __IOM uint32_t FLT2POL    : 1;            /*!< [2..2] Fault Input 2 Polarity                                             */
      __IOM uint32_t FLT3POL    : 1;            /*!< [3..3] Fault Input 3 Polarity                                             */
            uint32_t            : 28;
    } FTM1_FLTPOL_b;
  } ;

  union {
    __IOM uint32_t FTM1_SYNCONF;                /*!< (@ 0x0000008C) Synchronization Configuration                              */

    struct {
      __IOM uint32_t HWTRIGMODE : 1;            /*!< [0..0] Hardware Trigger Mode                                              */
            uint32_t            : 1;
      __IOM uint32_t CNTINC     : 1;            /*!< [2..2] CNTIN Register Synchronization                                     */
            uint32_t            : 1;
      __IOM uint32_t INVC       : 1;            /*!< [4..4] INVCTRL Register Synchronization                                   */
      __IOM uint32_t SWOC       : 1;            /*!< [5..5] SWOCTRL Register Synchronization                                   */
            uint32_t            : 1;
      __IOM uint32_t SYNCMODE   : 1;            /*!< [7..7] Synchronization Mode                                               */
      __IOM uint32_t SWRSTCNT   : 1;            /*!< [8..8] FTM counter synchronization is activated by the software
                                                     trigger                                                                   */
      __IOM uint32_t SWWRBUF    : 1;            /*!< [9..9] MOD, HCR, CNTIN, and CV registers synchronization is
                                                     activated by the software trigger                                         */
      __IOM uint32_t SWOM       : 1;            /*!< [10..10] Output mask synchronization is activated by the software
                                                     trigger                                                                   */
      __IOM uint32_t SWINVC     : 1;            /*!< [11..11] Inverting control synchronization is activated by the
                                                     software trigger                                                          */
      __IOM uint32_t SWSOC      : 1;            /*!< [12..12] Software output control synchronization is activated
                                                     by the software trigger                                                   */
            uint32_t            : 3;
      __IOM uint32_t HWRSTCNT   : 1;            /*!< [16..16] FTM counter synchronization is activated by a hardware
                                                     trigger                                                                   */
      __IOM uint32_t HWWRBUF    : 1;            /*!< [17..17] MOD, HCR, CNTIN, and CV registers synchronization is
                                                     activated by a hardware trigger                                           */
      __IOM uint32_t HWOM       : 1;            /*!< [18..18] Output mask synchronization is activated by a hardware
                                                     trigger                                                                   */
      __IOM uint32_t HWINVC     : 1;            /*!< [19..19] Inverting control synchronization is activated by a
                                                     hardware trigger                                                          */
      __IOM uint32_t HWSOC      : 1;            /*!< [20..20] Software output control synchronization is activated
                                                     by a hardware trigger                                                     */
            uint32_t            : 11;
    } FTM1_SYNCONF_b;
  } ;

  union {
    __IOM uint32_t FTM1_INVCTRL;                /*!< (@ 0x00000090) FTM Inverting Control                                      */

