nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t INV0EN     : 1;            /*!< [0..0] Pair Channels 0 Inverting Enable                                   */
      __IOM uint32_t INV1EN     : 1;            /*!< [1..1] Pair Channels 1 Inverting Enable                                   */
      __IOM uint32_t INV2EN     : 1;            /*!< [2..2] Pair Channels 2 Inverting Enable                                   */
      __IOM uint32_t INV3EN     : 1;            /*!< [3..3] Pair Channels 3 Inverting Enable                                   */
            uint32_t            : 28;
    } FTM1_INVCTRL_b;
  } ;

  union {
    __IOM uint32_t FTM1_SWOCTRL;                /*!< (@ 0x00000094) FTM Software Output Control                                */

    struct {
      __IOM uint32_t CH0OC      : 1;            /*!< [0..0] Channel 0 Software Output Control Enable                           */
      __IOM uint32_t CH1OC      : 1;            /*!< [1..1] Channel 1 Software Output Control Enable                           */
      __IOM uint32_t CH2OC      : 1;            /*!< [2..2] Channel 2 Software Output Control Enable                           */
      __IOM uint32_t CH3OC      : 1;            /*!< [3..3] Channel 3 Software Output Control Enable                           */
      __IOM uint32_t CH4OC      : 1;            /*!< [4..4] Channel 4 Software Output Control Enable                           */
      __IOM uint32_t CH5OC      : 1;            /*!< [5..5] Channel 5 Software Output Control Enable                           */
      __IOM uint32_t CH6OC      : 1;            /*!< [6..6] Channel 6 Software Output Control Enable                           */
      __IOM uint32_t CH7OC      : 1;            /*!< [7..7] Channel 7 Software Output Control Enable                           */
      __IOM uint32_t CH0OCV     : 1;            /*!< [8..8] Channel 0 Software Output Control Value                            */
      __IOM uint32_t CH1OCV     : 1;            /*!< [9..9] Channel 1 Software Output Control Value                            */
      __IOM uint32_t CH2OCV     : 1;            /*!< [10..10] Channel 2 Software Output Control Value                          */
      __IOM uint32_t CH3OCV     : 1;            /*!< [11..11] Channel 3 Software Output Control Value                          */
      __IOM uint32_t CH4OCV     : 1;            /*!< [12..12] Channel 4 Software Output Control Value                          */
      __IOM uint32_t CH5OCV     : 1;            /*!< [13..13] Channel 5 Software Output Control Value                          */
      __IOM uint32_t CH6OCV     : 1;            /*!< [14..14] Channel 6 Software Output Control Value                          */
      __IOM uint32_t CH7OCV     : 1;            /*!< [15..15] Channel 7 Software Output Control Value                          */
            uint32_t            : 16;
    } FTM1_SWOCTRL_b;
  } ;

  union {
    __IOM uint32_t FTM1_PWMLOAD;                /*!< (@ 0x00000098) FTM PWM Load                                               */

    struct {
      __IOM uint32_t CH0SEL     : 1;            /*!< [0..0] Channel 0 Select                                                   */
      __IOM uint32_t CH1SEL     : 1;            /*!< [1..1] Channel 1 Select                                                   */
      __IOM uint32_t CH2SEL     : 1;            /*!< [2..2] Channel 2 Select                                                   */
      __IOM uint32_t CH3SEL     : 1;            /*!< [3..3] Channel 3 Select                                                   */
      __IOM uint32_t CH4SEL     : 1;            /*!< [4..4] Channel 4 Select                                                   */
      __IOM uint32_t CH5SEL     : 1;            /*!< [5..5] Channel 5 Select                                                   */
      __IOM uint32_t CH6SEL     : 1;            /*!< [6..6] Channel 6 Select                                                   */
      __IOM uint32_t CH7SEL     : 1;            /*!< [7..7] Channel 7 Select                                                   */
      __IOM uint32_t HCSEL      : 1;            /*!< [8..8] Half Cycle Select                                                  */
      __IOM uint32_t LDOK       : 1;            /*!< [9..9] Load Enable                                                        */
      __IOM uint32_t GLEN       : 1;            /*!< [10..10] Global Load Enable                                               */
      __OM  uint32_t GLDOK      : 1;            /*!< [11..11] Global Load OK                                                   */
            uint32_t            : 20;
    } FTM1_PWMLOAD_b;
  } ;

  union {
    __IOM uint32_t FTM1_HCR;                    /*!< (@ 0x0000009C) Half Cycle Register                                        */

    struct {
      __IOM uint32_t HCVAL      : 16;           /*!< [15..0] Half Cycle Value                                                  */
            uint32_t            : 16;
    } FTM1_HCR_b;
  } ;

  union {
    __IOM uint32_t FTM1_PAIR0DEADTIME;          /*!< (@ 0x000000A0) Pair 0 Deadtime Configuration                              */

    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM1_PAIR0DEADTIME_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t FTM1_PAIR1DEADTIME;          /*!< (@ 0x000000A8) Pair 1 Deadtime Configuration                              */

    struct {
      __IOM uint32_t DTVAL      : 6;            /*!< [5..0] Deadtime Value                                                     */
      __IOM uint32_t DTPS       : 2;            /*!< [7..6] Deadtime Prescaler Value                                           */
            uint32_t            : 8;
      __IOM uint32_t DTVALEX    : 4;            /*!< [19..16] Extended Deadtime Value                                          */
            uint32_t            : 12;
    } FTM1_PAIR1DEADTIME_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t FTM1_PAIR2DEADTIME;          /*!< (@ 0x000000B0) Pair 2 Deadtime Configuration                              */

