nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t AVGS       : 2;            /*!< [1..0] Hardware Average Select                                            */
      __IOM uint32_t AVGE       : 1;            /*!< [2..2] Hardware Average Enable                                            */
      __IOM uint32_t ADCO       : 1;            /*!< [3..3] Continuous Conversion Enable                                       */
            uint32_t            : 3;
      __IOM uint32_t CAL        : 1;            /*!< [7..7] Calibration                                                        */
            uint32_t            : 24;
    } ADC0_SC3_b;
  } ;

  union {
    __IOM uint32_t ADC0_BASE_OFS;               /*!< (@ 0x00000098) BASE Offset Register                                       */

    struct {
      __IOM uint32_t BA_OFS     : 8;            /*!< [7..0] Base Offset Error Correction Value                                 */
            uint32_t            : 24;
    } ADC0_BASE_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_OFS;                    /*!< (@ 0x0000009C) ADC Offset Correction Register                             */

    struct {
      __IOM uint32_t OFS        : 16;           /*!< [15..0] Offset Error Correction Value                                     */
            uint32_t            : 16;
    } ADC0_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_USR_OFS;                /*!< (@ 0x000000A0) USER Offset Correction Register                            */

    struct {
      __IOM uint32_t USR_OFS    : 8;            /*!< [7..0] USER Offset Error Correction Value                                 */
            uint32_t            : 24;
    } ADC0_USR_OFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_XOFS;                   /*!< (@ 0x000000A4) ADC X Offset Correction Register                           */

    struct {
      __IOM uint32_t XOFS       : 6;            /*!< [5..0] X offset error correction value                                    */
            uint32_t            : 26;
    } ADC0_XOFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_YOFS;                   /*!< (@ 0x000000A8) ADC Y Offset Correction Register                           */

    struct {
      __IOM uint32_t YOFS       : 8;            /*!< [7..0] Y offset error correction value                                    */
            uint32_t            : 24;
    } ADC0_YOFS_b;
  } ;

  union {
    __IOM uint32_t ADC0_G;                      /*!< (@ 0x000000AC) ADC Gain Register                                          */

    struct {
      __IOM uint32_t G          : 11;           /*!< [10..0] Gain error adjustment factor for the overall conversion           */
            uint32_t            : 21;
    } ADC0_G_b;
  } ;

  union {
    __IOM uint32_t ADC0_UG;                     /*!< (@ 0x000000B0) ADC User Gain Register                                     */

    struct {
      __IOM uint32_t UG         : 10;           /*!< [9..0] User gain error correction value                                   */
            uint32_t            : 22;
    } ADC0_UG_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLPS;                   /*!< (@ 0x000000B4) ADC General Calibration Value Register S                   */

    struct {
      __IOM uint32_t CLPS       : 7;            /*!< [6..0] Calibration Value                                                  */
            uint32_t            : 25;
    } ADC0_CLPS_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP3;                   /*!< (@ 0x000000B8) ADC Plus-Side General Calibration Value Register
                                                                    3                                                          */

    struct {
      __IOM uint32_t CLP3       : 10;           /*!< [9..0] Calibration Value                                                  */
            uint32_t            : 22;
    } ADC0_CLP3_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP2;                   /*!< (@ 0x000000BC) ADC Plus-Side General Calibration Value Register
                                                                    2                                                          */

    struct {
      __IOM uint32_t CLP2       : 10;           /*!< [9..0] Calibration Value                                                  */
            uint32_t            : 22;
    } ADC0_CLP2_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP1;                   /*!< (@ 0x000000C0) ADC Plus-Side General Calibration Value Register
                                                                    1                                                          */

    struct {
      __IOM uint32_t CLP1       : 9;            /*!< [8..0] Calibration Value                                                  */
            uint32_t            : 23;
    } ADC0_CLP1_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP0;                   /*!< (@ 0x000000C4) ADC Plus-Side General Calibration Value Register
                                                                    0                                                          */

    struct {
      __IOM uint32_t CLP0       : 8;            /*!< [7..0] Calibration Value                                                  */
            uint32_t            : 24;
    } ADC0_CLP0_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLPX;                   /*!< (@ 0x000000C8) ADC Plus-Side General Calibration Value Register
                                                                    X                                                          */

    struct {
      __IOM uint32_t CLPX       : 7;            /*!< [6..0] Calibration Value                                                  */
            uint32_t            : 25;
    } ADC0_CLPX_b;
  } ;

  union {
    __IOM uint32_t ADC0_CLP9;                   /*!< (@ 0x000000CC) ADC Plus-Side General Calibration Value Register
                                                                    9                                                          */

