nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t COMPARE    : 16;           /*!< [15..0] Compare Value                                                     */
            uint32_t            : 16;
    } LPTMR0_CMR_b;
  } ;

  union {
    __IOM uint32_t LPTMR0_CNR;                  /*!< (@ 0x0000000C) Low Power Timer Counter Register                           */

    struct {
      __IOM uint32_t COUNTER    : 16;           /*!< [15..0] Counter Value                                                     */
            uint32_t            : 16;
    } LPTMR0_CNR_b;
  } ;
} LPTMR0_Type;                                  /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            SIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System Integration Module (SIM)
  */

typedef struct {                                /*!< (@ 0x40048000) SIM Structure                                              */
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t SIM_CHIPCTL;                 /*!< (@ 0x00000004) Chip Control register                                      */

    struct {
      __IOM uint32_t ADC_INTERLEAVE_EN : 4;     /*!< [3..0] ADC interleave channel enable                                      */
      __IOM uint32_t CLKOUTSEL  : 4;            /*!< [7..4] CLKOUT Select                                                      */
      __IOM uint32_t CLKOUTDIV  : 3;            /*!< [10..8] CLKOUT Divide Ratio                                               */
      __IOM uint32_t CLKOUTEN   : 1;            /*!< [11..11] CLKOUT enable                                                    */
      __IOM uint32_t TRACECLK_SEL : 1;          /*!< [12..12] Debug trace clock select                                         */
      __IOM uint32_t PDB_BB_SEL : 1;            /*!< [13..13] PDB back-to-back select                                          */
            uint32_t            : 2;
      __IOM uint32_t ADC_SUPPLY : 3;            /*!< [18..16] ADC_SUPPLY                                                       */
      __IOM uint32_t ADC_SUPPLYEN : 1;          /*!< [19..19] ADC_SUPPLYEN                                                     */
      __IOM uint32_t SRAMU_RETEN : 1;           /*!< [20..20] SRAMU_RETEN                                                      */
      __IOM uint32_t SRAML_RETEN : 1;           /*!< [21..21] SRAML_RETEN                                                      */
            uint32_t            : 10;
    } SIM_CHIPCTL_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t SIM_FTMOPT0;                 /*!< (@ 0x0000000C) FTM Option Register 0                                      */

    struct {
      __IOM uint32_t FTM0FLTxSEL : 3;           /*!< [2..0] FTM0 Fault X Select                                                */
            uint32_t            : 1;
      __IOM uint32_t FTM1FLTxSEL : 3;           /*!< [6..4] FTM1 Fault X Select                                                */
            uint32_t            : 1;
      __IOM uint32_t FTM2FLTxSEL : 3;           /*!< [10..8] FTM2 Fault X Select                                               */
            uint32_t            : 1;
      __IOM uint32_t FTM3FLTxSEL : 3;           /*!< [14..12] FTM3 Fault X Select                                              */
            uint32_t            : 9;
      __IOM uint32_t FTM0CLKSEL : 2;            /*!< [25..24] FTM0 External Clock Pin Select                                   */
      __IOM uint32_t FTM1CLKSEL : 2;            /*!< [27..26] FTM1 External Clock Pin Select                                   */
      __IOM uint32_t FTM2CLKSEL : 2;            /*!< [29..28] FTM2 External Clock Pin Select                                   */
      __IOM uint32_t FTM3CLKSEL : 2;            /*!< [31..30] FTM3 External Clock Pin Select                                   */
    } SIM_FTMOPT0_b;
  } ;

  union {
    __IOM uint32_t SIM_LPOCLKS;                 /*!< (@ 0x00000010) LPO Clock Select Register                                  */

    struct {
      __IOM uint32_t LPO1KCLKEN : 1;            /*!< [0..0] 1 kHz LPO_CLK enable                                               */
      __IOM uint32_t LPO32KCLKEN : 1;           /*!< [1..1] 32 kHz LPO_CLK enable                                              */
      __IOM uint32_t LPOCLKSEL  : 2;            /*!< [3..2] LPO clock source select                                            */
      __IOM uint32_t RTCCLKSEL  : 2;            /*!< [5..4] 32 kHz clock source select                                         */
            uint32_t            : 26;
    } SIM_LPOCLKS_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t SIM_ADCOPT;                  /*!< (@ 0x00000018) ADC Options Register                                       */

    struct {
      __IOM uint32_t ADC0TRGSEL : 1;            /*!< [0..0] ADC0 trigger source select                                         */
      __IOM uint32_t ADC0SWPRETRG : 3;          /*!< [3..1] ADC0 software pretrigger sources                                   */
      __IOM uint32_t ADC0PRETRGSEL : 2;         /*!< [5..4] ADC0 pretrigger source select                                      */
            uint32_t            : 2;
      __IOM uint32_t ADC1TRGSEL : 1;            /*!< [8..8] ADC1 trigger source select                                         */
      __IOM uint32_t ADC1SWPRETRG : 3;          /*!< [11..9] ADC1 software pretrigger sources                                  */
      __IOM uint32_t ADC1PRETRGSEL : 2;         /*!< [13..12] ADC1 pretrigger source select                                    */
            uint32_t            : 18;
    } SIM_ADCOPT_b;
  } ;

  union {
    __IOM uint32_t SIM_FTMOPT1;                 /*!< (@ 0x0000001C) FTM Option Register 1                                      */

