nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t FTM0SYNCBIT : 1;           /*!< [0..0] FTM0 Sync Bit                                                      */
      __IOM uint32_t FTM1SYNCBIT : 1;           /*!< [1..1] FTM1 Sync Bit                                                      */
      __IOM uint32_t FTM2SYNCBIT : 1;           /*!< [2..2] FTM2 Sync Bit                                                      */
      __IOM uint32_t FTM3SYNCBIT : 1;           /*!< [3..3] FTM3 Sync Bit                                                      */
      __IOM uint32_t FTM1CH0SEL : 2;            /*!< [5..4] FTM1 CH0 Select                                                    */
      __IOM uint32_t FTM2CH0SEL : 2;            /*!< [7..6] FTM2 CH0 Select                                                    */
      __IOM uint32_t FTM2CH1SEL : 1;            /*!< [8..8] FTM2 CH1 Select                                                    */
            uint32_t            : 6;
      __IOM uint32_t FTMGLDOK   : 1;            /*!< [15..15] FTM global load enable                                           */
      __IOM uint32_t FTM0_OUTSEL : 8;           /*!< [23..16] FTM0 channel modulation select with FTM1_CH1                     */
      __IOM uint32_t FTM3_OUTSEL : 8;           /*!< [31..24] FTM3 channel modulation select with FTM2_CH1                     */
    } SIM_FTMOPT1_b;
  } ;

  union {
    __IOM uint32_t SIM_MISCTRL0;                /*!< (@ 0x00000020) Miscellaneous control register 0                           */

    struct {
            uint32_t            : 9;
      __IOM uint32_t STOP1_MONITOR : 1;         /*!< [9..9] STOP1 monitor bit                                                  */
      __IOM uint32_t STOP2_MONITOR : 1;         /*!< [10..10] STOP2 monitor bit                                                */
            uint32_t            : 5;
      __IOM uint32_t FTM0_OBE_CTRL : 1;         /*!< [16..16] FTM0 OBE CTRL bit                                                */
      __IOM uint32_t FTM1_OBE_CTRL : 1;         /*!< [17..17] FTM1 OBE CTRL bit                                                */
      __IOM uint32_t FTM2_OBE_CTRL : 1;         /*!< [18..18] FTM2 OBE CTRL bit                                                */
      __IOM uint32_t FTM3_OBE_CTRL : 1;         /*!< [19..19] FTM3 OBE CTRL bit                                                */
            uint32_t            : 12;
    } SIM_MISCTRL0_b;
  } ;

  union {
    __IM  uint32_t SIM_SDID;                    /*!< (@ 0x00000024) System Device Identification Register                      */

    struct {
      __IM  uint32_t FEATURES   : 8;            /*!< [7..0] Features                                                           */
      __IM  uint32_t PACKAGE    : 4;            /*!< [11..8] Package                                                           */
      __IM  uint32_t REVID      : 4;            /*!< [15..12] Device revision number                                           */
      __IM  uint32_t RAMSIZE    : 4;            /*!< [19..16] RAM size                                                         */
      __IM  uint32_t DERIVATE   : 4;            /*!< [23..20] Derivate                                                         */
      __IM  uint32_t SUBSERIES  : 4;            /*!< [27..24] Subseries                                                        */
      __IM  uint32_t GENERATION : 4;            /*!< [31..28] S32K product series generation                                   */
    } SIM_SDID_b;
  } ;
  __IM  uint32_t  RESERVED3[6];

  union {
    __IOM uint32_t SIM_PLATCGC;                 /*!< (@ 0x00000040) Platform Clock Gating Control Register                     */

    struct {
      __IOM uint32_t CGCMSCM    : 1;            /*!< [0..0] MSCM Clock Gating Control                                          */
      __IOM uint32_t CGCMPU     : 1;            /*!< [1..1] MPU Clock Gating Control                                           */
      __IOM uint32_t CGCDMA     : 1;            /*!< [2..2] DMA Clock Gating Control                                           */
      __IOM uint32_t CGCERM     : 1;            /*!< [3..3] ERM Clock Gating Control                                           */
      __IOM uint32_t CGCEIM     : 1;            /*!< [4..4] EIM Clock Gating Control                                           */
      __IOM uint32_t CGCGPIO    : 1;            /*!< [5..5] GPIO Clock Gating Control                                          */
            uint32_t            : 26;
    } SIM_PLATCGC_b;
  } ;
  __IM  uint32_t  RESERVED4[2];

  union {
    __IOM uint32_t SIM_FCFG1;                   /*!< (@ 0x0000004C) Flash Configuration Register 1                             */

    struct {
            uint32_t            : 12;
      __IM  uint32_t DEPART     : 4;            /*!< [15..12] FlexNVM partition                                                */
      __IM  uint32_t EEERAMSIZE : 4;            /*!< [19..16] EEE SRAM SIZE                                                    */
            uint32_t            : 12;
    } SIM_FCFG1_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IM  uint32_t SIM_UIDH;                    /*!< (@ 0x00000054) Unique Identification Register High                        */

    struct {
      __IM  uint32_t UID127_96  : 32;           /*!< [31..0] Unique Identification                                             */
    } SIM_UIDH_b;
  } ;

  union {
    __IM  uint32_t SIM_UIDMH;                   /*!< (@ 0x00000058) Unique Identification Register Mid-High                    */

    struct {
      __IM  uint32_t UID95_64   : 32;           /*!< [31..0] Unique Identification                                             */
    } SIM_UIDMH_b;
  } ;

  union {
    __IM  uint32_t SIM_UIDML;                   /*!< (@ 0x0000005C) Unique Identification Register Mid Low                     */

    struct {
      __IM  uint32_t UID63_32   : 32;           /*!< [31..0] Unique Identification                                             */
    } SIM_UIDML_b;
  } ;

  union {
    __IM  uint32_t SIM_UIDL;                    /*!< (@ 0x00000060) Unique Identification Register Low                         */

