nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR15_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR16;                 /*!< (@ 0x00000040) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR16_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR17;                 /*!< (@ 0x00000044) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR17_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR18;                 /*!< (@ 0x00000048) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR18_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR19;                 /*!< (@ 0x0000004C) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR19_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR20;                 /*!< (@ 0x00000050) Pin Control Register n                                     */

    struct {
      __IOM uint32_t PS         : 1;            /*!< [0..0] Pull Select                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Pull Enable                                                        */
            uint32_t            : 6;
      __IOM uint32_t MUX        : 3;            /*!< [10..8] Pin Mux Control                                                   */
            uint32_t            : 4;
      __IOM uint32_t LK         : 1;            /*!< [15..15] Lock Register                                                    */
      __IOM uint32_t IRQC       : 4;            /*!< [19..16] Interrupt Configuration                                          */
            uint32_t            : 4;
      __IOM uint32_t ISF        : 1;            /*!< [24..24] Interrupt Status Flag                                            */
            uint32_t            : 7;
    } PORTA_PCR20_b;
  } ;

  union {
    __IOM uint32_t PORTA_PCR21;                 /*!< (@ 0x00000054) Pin Control Register n                                     */

