nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t SEIE       : 4;            /*!< [3..0] Shifter Error Interrupt Enable                                     */
            uint32_t            : 28;
    } FLEXIO_SHIFTEIEN_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMIEN;               /*!< (@ 0x00000028) Timer Interrupt Enable Register                            */

    struct {
      __IOM uint32_t TEIE       : 4;            /*!< [3..0] Timer Status Interrupt Enable                                      */
            uint32_t            : 28;
    } FLEXIO_TIMIEN_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t FLEXIO_SHIFTSDEN;            /*!< (@ 0x00000030) Shifter Status DMA Enable                                  */

    struct {
      __IOM uint32_t SSDE       : 4;            /*!< [3..0] Shifter Status DMA Enable                                          */
            uint32_t            : 28;
    } FLEXIO_SHIFTSDEN_b;
  } ;
  __IM  uint32_t  RESERVED2[19];

  union {
    __IOM uint32_t FLEXIO_SHIFTCTL0;            /*!< (@ 0x00000080) Shifter Control N Register                                 */

    struct {
      __IOM uint32_t SMOD       : 3;            /*!< [2..0] Shifter Mode                                                       */
            uint32_t            : 4;
      __IOM uint32_t PINPOL     : 1;            /*!< [7..7] Shifter Pin Polarity                                               */
      __IOM uint32_t PINSEL     : 3;            /*!< [10..8] Shifter Pin Select                                                */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [17..16] Shifter Pin Configuration                                        */
            uint32_t            : 5;
      __IOM uint32_t TIMPOL     : 1;            /*!< [23..23] Timer Polarity                                                   */
      __IOM uint32_t TIMSEL     : 2;            /*!< [25..24] Timer Select                                                     */
            uint32_t            : 6;
    } FLEXIO_SHIFTCTL0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTCTL1;            /*!< (@ 0x00000084) Shifter Control N Register                                 */

    struct {
      __IOM uint32_t SMOD       : 3;            /*!< [2..0] Shifter Mode                                                       */
            uint32_t            : 4;
      __IOM uint32_t PINPOL     : 1;            /*!< [7..7] Shifter Pin Polarity                                               */
      __IOM uint32_t PINSEL     : 3;            /*!< [10..8] Shifter Pin Select                                                */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [17..16] Shifter Pin Configuration                                        */
            uint32_t            : 5;
      __IOM uint32_t TIMPOL     : 1;            /*!< [23..23] Timer Polarity                                                   */
      __IOM uint32_t TIMSEL     : 2;            /*!< [25..24] Timer Select                                                     */
            uint32_t            : 6;
    } FLEXIO_SHIFTCTL1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTCTL2;            /*!< (@ 0x00000088) Shifter Control N Register                                 */

    struct {
      __IOM uint32_t SMOD       : 3;            /*!< [2..0] Shifter Mode                                                       */
            uint32_t            : 4;
      __IOM uint32_t PINPOL     : 1;            /*!< [7..7] Shifter Pin Polarity                                               */
      __IOM uint32_t PINSEL     : 3;            /*!< [10..8] Shifter Pin Select                                                */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [17..16] Shifter Pin Configuration                                        */
            uint32_t            : 5;
      __IOM uint32_t TIMPOL     : 1;            /*!< [23..23] Timer Polarity                                                   */
      __IOM uint32_t TIMSEL     : 2;            /*!< [25..24] Timer Select                                                     */
            uint32_t            : 6;
    } FLEXIO_SHIFTCTL2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTCTL3;            /*!< (@ 0x0000008C) Shifter Control N Register                                 */

    struct {
      __IOM uint32_t SMOD       : 3;            /*!< [2..0] Shifter Mode                                                       */
            uint32_t            : 4;
      __IOM uint32_t PINPOL     : 1;            /*!< [7..7] Shifter Pin Polarity                                               */
      __IOM uint32_t PINSEL     : 3;            /*!< [10..8] Shifter Pin Select                                                */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 2;            /*!< [17..16] Shifter Pin Configuration                                        */
            uint32_t            : 5;
      __IOM uint32_t TIMPOL     : 1;            /*!< [23..23] Timer Polarity                                                   */
      __IOM uint32_t TIMSEL     : 2;            /*!< [25..24] Timer Select                                                     */
            uint32_t            : 6;
    } FLEXIO_SHIFTCTL3_b;
  } ;
  __IM  uint32_t  RESERVED3[28];

  union {
    __IOM uint32_t FLEXIO_SHIFTCFG0;            /*!< (@ 0x00000100) Shifter Configuration N Register                           */

    struct {
      __IOM uint32_t SSTART     : 2;            /*!< [1..0] Shifter Start bit                                                  */
            uint32_t            : 2;
      __IOM uint32_t SSTOP      : 2;            /*!< [5..4] Shifter Stop bit                                                   */
            uint32_t            : 2;
      __IOM uint32_t INSRC      : 1;            /*!< [8..8] Input Source                                                       */
            uint32_t            : 23;
    } FLEXIO_SHIFTCFG0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTCFG1;            /*!< (@ 0x00000104) Shifter Configuration N Register                           */

