nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t SSTART     : 2;            /*!< [1..0] Shifter Start bit                                                  */
            uint32_t            : 2;
      __IOM uint32_t SSTOP      : 2;            /*!< [5..4] Shifter Stop bit                                                   */
            uint32_t            : 2;
      __IOM uint32_t INSRC      : 1;            /*!< [8..8] Input Source                                                       */
            uint32_t            : 23;
    } FLEXIO_SHIFTCFG1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTCFG2;            /*!< (@ 0x00000108) Shifter Configuration N Register                           */

    struct {
      __IOM uint32_t SSTART     : 2;            /*!< [1..0] Shifter Start bit                                                  */
            uint32_t            : 2;
      __IOM uint32_t SSTOP      : 2;            /*!< [5..4] Shifter Stop bit                                                   */
            uint32_t            : 2;
      __IOM uint32_t INSRC      : 1;            /*!< [8..8] Input Source                                                       */
            uint32_t            : 23;
    } FLEXIO_SHIFTCFG2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTCFG3;            /*!< (@ 0x0000010C) Shifter Configuration N Register                           */

    struct {
      __IOM uint32_t SSTART     : 2;            /*!< [1..0] Shifter Start bit                                                  */
            uint32_t            : 2;
      __IOM uint32_t SSTOP      : 2;            /*!< [5..4] Shifter Stop bit                                                   */
            uint32_t            : 2;
      __IOM uint32_t INSRC      : 1;            /*!< [8..8] Input Source                                                       */
            uint32_t            : 23;
    } FLEXIO_SHIFTCFG3_b;
  } ;
  __IM  uint32_t  RESERVED4[60];

  union {
    __IOM uint32_t FLEXIO_SHIFTBUF0;            /*!< (@ 0x00000200) Shifter Buffer N Register                                  */

    struct {
      __IOM uint32_t SHIFTBUF   : 32;           /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUF0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUF1;            /*!< (@ 0x00000204) Shifter Buffer N Register                                  */

    struct {
      __IOM uint32_t SHIFTBUF   : 32;           /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUF1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUF2;            /*!< (@ 0x00000208) Shifter Buffer N Register                                  */

    struct {
      __IOM uint32_t SHIFTBUF   : 32;           /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUF2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUF3;            /*!< (@ 0x0000020C) Shifter Buffer N Register                                  */

    struct {
      __IOM uint32_t SHIFTBUF   : 32;           /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUF3_b;
  } ;
  __IM  uint32_t  RESERVED5[28];

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBIS0;         /*!< (@ 0x00000280) Shifter Buffer N Bit Swapped Register                      */

    struct {
      __IOM uint32_t SHIFTBUFBIS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBIS0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBIS1;         /*!< (@ 0x00000284) Shifter Buffer N Bit Swapped Register                      */

    struct {
      __IOM uint32_t SHIFTBUFBIS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBIS1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBIS2;         /*!< (@ 0x00000288) Shifter Buffer N Bit Swapped Register                      */

    struct {
      __IOM uint32_t SHIFTBUFBIS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBIS2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBIS3;         /*!< (@ 0x0000028C) Shifter Buffer N Bit Swapped Register                      */

    struct {
      __IOM uint32_t SHIFTBUFBIS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBIS3_b;
  } ;
  __IM  uint32_t  RESERVED6[28];

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBYS0;         /*!< (@ 0x00000300) Shifter Buffer N Byte Swapped Register                     */

    struct {
      __IOM uint32_t SHIFTBUFBYS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBYS0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBYS1;         /*!< (@ 0x00000304) Shifter Buffer N Byte Swapped Register                     */

    struct {
      __IOM uint32_t SHIFTBUFBYS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBYS1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBYS2;         /*!< (@ 0x00000308) Shifter Buffer N Byte Swapped Register                     */

    struct {
      __IOM uint32_t SHIFTBUFBYS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBYS2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBYS3;         /*!< (@ 0x0000030C) Shifter Buffer N Byte Swapped Register                     */

    struct {
      __IOM uint32_t SHIFTBUFBYS : 32;          /*!< [31..0] Shift Buffer                                                      */
    } FLEXIO_SHIFTBUFBYS3_b;
  } ;
  __IM  uint32_t  RESERVED7[28];

  union {
    __IOM uint32_t FLEXIO_SHIFTBUFBBS0;         /*!< (@ 0x00000380) Shifter Buffer N Bit Byte Swapped Register                 */

