nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t TSTART     : 1;            /*!< [1..1] Timer Start Bit                                                    */
            uint32_t            : 2;
      __IOM uint32_t TSTOP      : 2;            /*!< [5..4] Timer Stop Bit                                                     */
            uint32_t            : 2;
      __IOM uint32_t TIMENA     : 3;            /*!< [10..8] Timer Enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIMDIS     : 3;            /*!< [14..12] Timer Disable                                                    */
            uint32_t            : 1;
      __IOM uint32_t TIMRST     : 3;            /*!< [18..16] Timer Reset                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIMDEC     : 2;            /*!< [21..20] Timer Decrement                                                  */
            uint32_t            : 2;
      __IOM uint32_t TIMOUT     : 2;            /*!< [25..24] Timer Output                                                     */
            uint32_t            : 6;
    } FLEXIO_TIMCFG0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCFG1;              /*!< (@ 0x00000484) Timer Configuration N Register                             */

    struct {
            uint32_t            : 1;
      __IOM uint32_t TSTART     : 1;            /*!< [1..1] Timer Start Bit                                                    */
            uint32_t            : 2;
      __IOM uint32_t TSTOP      : 2;            /*!< [5..4] Timer Stop Bit                                                     */
            uint32_t            : 2;
      __IOM uint32_t TIMENA     : 3;            /*!< [10..8] Timer Enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIMDIS     : 3;            /*!< [14..12] Timer Disable                                                    */
            uint32_t            : 1;
      __IOM uint32_t TIMRST     : 3;            /*!< [18..16] Timer Reset                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIMDEC     : 2;            /*!< [21..20] Timer Decrement                                                  */
            uint32_t            : 2;
      __IOM uint32_t TIMOUT     : 2;            /*!< [25..24] Timer Output                                                     */
            uint32_t            : 6;
    } FLEXIO_TIMCFG1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCFG2;              /*!< (@ 0x00000488) Timer Configuration N Register                             */

    struct {
            uint32_t            : 1;
      __IOM uint32_t TSTART     : 1;            /*!< [1..1] Timer Start Bit                                                    */
            uint32_t            : 2;
      __IOM uint32_t TSTOP      : 2;            /*!< [5..4] Timer Stop Bit                                                     */
            uint32_t            : 2;
      __IOM uint32_t TIMENA     : 3;            /*!< [10..8] Timer Enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIMDIS     : 3;            /*!< [14..12] Timer Disable                                                    */
            uint32_t            : 1;
      __IOM uint32_t TIMRST     : 3;            /*!< [18..16] Timer Reset                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIMDEC     : 2;            /*!< [21..20] Timer Decrement                                                  */
            uint32_t            : 2;
      __IOM uint32_t TIMOUT     : 2;            /*!< [25..24] Timer Output                                                     */
            uint32_t            : 6;
    } FLEXIO_TIMCFG2_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCFG3;              /*!< (@ 0x0000048C) Timer Configuration N Register                             */

    struct {
            uint32_t            : 1;
      __IOM uint32_t TSTART     : 1;            /*!< [1..1] Timer Start Bit                                                    */
            uint32_t            : 2;
      __IOM uint32_t TSTOP      : 2;            /*!< [5..4] Timer Stop Bit                                                     */
            uint32_t            : 2;
      __IOM uint32_t TIMENA     : 3;            /*!< [10..8] Timer Enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIMDIS     : 3;            /*!< [14..12] Timer Disable                                                    */
            uint32_t            : 1;
      __IOM uint32_t TIMRST     : 3;            /*!< [18..16] Timer Reset                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIMDEC     : 2;            /*!< [21..20] Timer Decrement                                                  */
            uint32_t            : 2;
      __IOM uint32_t TIMOUT     : 2;            /*!< [25..24] Timer Output                                                     */
            uint32_t            : 6;
    } FLEXIO_TIMCFG3_b;
  } ;
  __IM  uint32_t  RESERVED10[28];

  union {
    __IOM uint32_t FLEXIO_TIMCMP0;              /*!< (@ 0x00000500) Timer Compare N Register                                   */

    struct {
      __IOM uint32_t CMP        : 16;           /*!< [15..0] Timer Compare Value                                               */
            uint32_t            : 16;
    } FLEXIO_TIMCMP0_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCMP1;              /*!< (@ 0x00000504) Timer Compare N Register                                   */

    struct {
      __IOM uint32_t CMP        : 16;           /*!< [15..0] Timer Compare Value                                               */
            uint32_t            : 16;
    } FLEXIO_TIMCMP1_b;
  } ;

  union {
    __IOM uint32_t FLEXIO_TIMCMP2;              /*!< (@ 0x00000508) Timer Compare N Register                                   */

