nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_LPSPI0_b;
  } ;
  __IM  uint32_t  RESERVED3[5];

  union {
    __IOM uint32_t PCC_CRC;                     /*!< (@ 0x000000C8) PCC CRC Register                                           */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_CRC_b;
  } ;
  __IM  uint32_t  RESERVED4[3];

  union {
    __IOM uint32_t PCC_PDB0;                    /*!< (@ 0x000000D8) PCC PDB0 Register                                          */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_PDB0_b;
  } ;

  union {
    __IOM uint32_t PCC_LPIT;                    /*!< (@ 0x000000DC) PCC LPIT Register                                          */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_LPIT_b;
  } ;

  union {
    __IOM uint32_t PCC_FTM0;                    /*!< (@ 0x000000E0) PCC FTM0 Register                                          */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_FTM0_b;
  } ;

  union {
    __IOM uint32_t PCC_FTM1;                    /*!< (@ 0x000000E4) PCC FTM1 Register                                          */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_FTM1_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t PCC_ADC0;                    /*!< (@ 0x000000EC) PCC ADC0 Register                                          */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_ADC0_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t PCC_RTC;                     /*!< (@ 0x000000F4) PCC RTC Register                                           */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_RTC_b;
  } ;

  union {
    __IOM uint32_t PCC_CMU0;                    /*!< (@ 0x000000F8) PCC CMU0 Register                                          */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_CMU0_b;
  } ;

  union {
    __IOM uint32_t PCC_CMU1;                    /*!< (@ 0x000000FC) PCC CMU1 Register                                          */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_CMU1_b;
  } ;

  union {
    __IOM uint32_t PCC_LPTMR0;                  /*!< (@ 0x00000100) PCC LPTMR0 Register                                        */

    struct {
      __IOM uint32_t PCD        : 4;            /*!< [3..0] Peripheral Clock Divider Select                                    */
      __IOM uint32_t FRAC       : 1;            /*!< [4..4] Peripheral Clock Divider Fraction                                  */
            uint32_t            : 19;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_LPTMR0_b;
  } ;
  __IM  uint32_t  RESERVED7[8];

  union {
    __IOM uint32_t PCC_PORTA;                   /*!< (@ 0x00000124) PCC PORTA Register                                         */

