nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_PORTA_b;
  } ;

  union {
    __IOM uint32_t PCC_PORTB;                   /*!< (@ 0x00000128) PCC PORTB Register                                         */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_PORTB_b;
  } ;

  union {
    __IOM uint32_t PCC_PORTC;                   /*!< (@ 0x0000012C) PCC PORTC Register                                         */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_PORTC_b;
  } ;

  union {
    __IOM uint32_t PCC_PORTD;                   /*!< (@ 0x00000130) PCC PORTD Register                                         */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_PORTD_b;
  } ;

  union {
    __IOM uint32_t PCC_PORTE;                   /*!< (@ 0x00000134) PCC PORTE Register                                         */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_PORTE_b;
  } ;
  __IM  uint32_t  RESERVED8[12];

  union {
    __IOM uint32_t PCC_FlexIO;                  /*!< (@ 0x00000168) PCC FlexIO Register                                        */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_FlexIO_b;
  } ;
  __IM  uint32_t  RESERVED9[11];

  union {
    __IOM uint32_t PCC_LPI2C0;                  /*!< (@ 0x00000198) PCC LPI2C0 Register                                        */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_LPI2C0_b;
  } ;
  __IM  uint32_t  RESERVED10[3];

  union {
    __IOM uint32_t PCC_LPUART0;                 /*!< (@ 0x000001A8) PCC LPUART0 Register                                       */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_LPUART0_b;
  } ;

  union {
    __IOM uint32_t PCC_LPUART1;                 /*!< (@ 0x000001AC) PCC LPUART1 Register                                       */

    struct {
            uint32_t            : 24;
      __IOM uint32_t PCS        : 3;            /*!< [26..24] Peripheral Clock Source Select                                   */
            uint32_t            : 3;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_LPUART1_b;
  } ;
  __IM  uint32_t  RESERVED11[7];

  union {
    __IOM uint32_t PCC_CMP0;                    /*!< (@ 0x000001CC) PCC CMP0 Register                                          */

    struct {
            uint32_t            : 30;
      __IOM uint32_t CGC        : 1;            /*!< [30..30] Clock Gate Control                                               */
      __IM  uint32_t PR         : 1;            /*!< [31..31] Present                                                          */
    } PCC_CMP0_b;
  } ;
} PCC_Type;                                     /*!< Size = 464 (0x1d0)                                                        */



/* =========================================================================================================================== */
/* ================                                          LPI2C0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief The LPI2C Memory Map/Register Definition can be found here. (LPI2C0)
  */

