nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t HREN       : 1;            /*!< [0..0] Host Request Enable                                                */
      __IOM uint32_t HRPOL      : 1;            /*!< [1..1] Host Request Polarity                                              */
      __IOM uint32_t HRSEL      : 1;            /*!< [2..2] Host Request Select                                                */
            uint32_t            : 5;
      __IOM uint32_t CIRFIFO    : 1;            /*!< [8..8] Circular FIFO Enable                                               */
      __IOM uint32_t RDMO       : 1;            /*!< [9..9] Receive Data Match Only                                            */
            uint32_t            : 22;
    } LPI2C0_MCFGR0_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_MCFGR1;               /*!< (@ 0x00000024) Master Configuration Register 1                            */

    struct {
      __IOM uint32_t PRESCALE   : 3;            /*!< [2..0] Prescaler                                                          */
            uint32_t            : 5;
      __IOM uint32_t AUTOSTOP   : 1;            /*!< [8..8] Automatic STOP Generation                                          */
      __IOM uint32_t IGNACK     : 1;            /*!< [9..9] IGNACK                                                             */
      __IOM uint32_t TIMECFG    : 1;            /*!< [10..10] Timeout Configuration                                            */
            uint32_t            : 5;
      __IOM uint32_t MATCFG     : 3;            /*!< [18..16] Match Configuration                                              */
            uint32_t            : 5;
      __IOM uint32_t PINCFG     : 3;            /*!< [26..24] Pin Configuration                                                */
            uint32_t            : 5;
    } LPI2C0_MCFGR1_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_MCFGR2;               /*!< (@ 0x00000028) Master Configuration Register 2                            */

    struct {
      __IOM uint32_t BUSIDLE    : 12;           /*!< [11..0] Bus Idle Timeout                                                  */
            uint32_t            : 4;
      __IOM uint32_t FILTSCL    : 4;            /*!< [19..16] Glitch Filter SCL                                                */
            uint32_t            : 4;
      __IOM uint32_t FILTSDA    : 4;            /*!< [27..24] Glitch Filter SDA                                                */
            uint32_t            : 4;
    } LPI2C0_MCFGR2_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_MCFGR3;               /*!< (@ 0x0000002C) Master Configuration Register 3                            */

    struct {
            uint32_t            : 8;
      __IOM uint32_t PINLOW     : 12;           /*!< [19..8] Pin Low Timeout                                                   */
            uint32_t            : 12;
    } LPI2C0_MCFGR3_b;
  } ;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t LPI2C0_MDMR;                 /*!< (@ 0x00000040) Master Data Match Register                                 */

    struct {
      __IOM uint32_t MATCH0     : 8;            /*!< [7..0] Match 0 Value                                                      */
            uint32_t            : 8;
      __IOM uint32_t MATCH1     : 8;            /*!< [23..16] Match 1 Value                                                    */
            uint32_t            : 8;
    } LPI2C0_MDMR_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t LPI2C0_MCCR0;                /*!< (@ 0x00000048) Master Clock Configuration Register 0                      */

    struct {
      __IOM uint32_t CLKLO      : 6;            /*!< [5..0] Clock Low Period                                                   */
            uint32_t            : 2;
      __IOM uint32_t CLKHI      : 6;            /*!< [13..8] Clock High Period                                                 */
            uint32_t            : 2;
      __IOM uint32_t SETHOLD    : 6;            /*!< [21..16] Setup Hold Delay                                                 */
            uint32_t            : 2;
      __IOM uint32_t DATAVD     : 6;            /*!< [29..24] Data Valid Delay                                                 */
            uint32_t            : 2;
    } LPI2C0_MCCR0_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t LPI2C0_MCCR1;                /*!< (@ 0x00000050) Master Clock Configuration Register 1                      */

    struct {
      __IOM uint32_t CLKLO      : 6;            /*!< [5..0] Clock Low Period                                                   */
            uint32_t            : 2;
      __IOM uint32_t CLKHI      : 6;            /*!< [13..8] Clock High Period                                                 */
            uint32_t            : 2;
      __IOM uint32_t SETHOLD    : 6;            /*!< [21..16] Setup Hold Delay                                                 */
            uint32_t            : 2;
      __IOM uint32_t DATAVD     : 6;            /*!< [29..24] Data Valid Delay                                                 */
            uint32_t            : 2;
    } LPI2C0_MCCR1_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t LPI2C0_MFCR;                 /*!< (@ 0x00000058) Master FIFO Control Register                               */

    struct {
      __IOM uint32_t TXWATER    : 2;            /*!< [1..0] Transmit FIFO Watermark                                            */
            uint32_t            : 14;
      __IOM uint32_t RXWATER    : 2;            /*!< [17..16] Receive FIFO Watermark                                           */
            uint32_t            : 14;
    } LPI2C0_MFCR_b;
  } ;

  union {
    __IM  uint32_t LPI2C0_MFSR;                 /*!< (@ 0x0000005C) Master FIFO Status Register                                */

    struct {
      __IM  uint32_t TXCOUNT    : 3;            /*!< [2..0] Transmit FIFO Count                                                */
            uint32_t            : 13;
      __IM  uint32_t RXCOUNT    : 3;            /*!< [18..16] Receive FIFO Count                                               */
            uint32_t            : 13;
    } LPI2C0_MFSR_b;
  } ;

  union {
    __IOM uint32_t LPI2C0_MTDR;                 /*!< (@ 0x00000060) Master Transmit Data Register                              */

