nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t MA1        : 10;           /*!< [9..0] Match Address 1                                                    */
            uint32_t            : 6;
      __IOM uint32_t MA2        : 10;           /*!< [25..16] Match Address 2                                                  */
            uint32_t            : 6;
    } LPUART0_MATCH_b;
  } ;

  union {
    __IOM uint32_t LPUART0_MODIR;               /*!< (@ 0x00000024) LPUART Modem IrDA Register                                 */

    struct {
      __IOM uint32_t TXCTSE     : 1;            /*!< [0..0] Transmitter clear-to-send enable                                   */
      __IOM uint32_t TXRTSE     : 1;            /*!< [1..1] Transmitter request-to-send enable                                 */
      __IOM uint32_t TXRTSPOL   : 1;            /*!< [2..2] Transmitter request-to-send polarity                               */
      __IOM uint32_t RXRTSE     : 1;            /*!< [3..3] Receiver request-to-send enable                                    */
      __IOM uint32_t TXCTSC     : 1;            /*!< [4..4] Transmit CTS Configuration                                         */
      __IOM uint32_t TXCTSSRC   : 1;            /*!< [5..5] Transmit CTS Source                                                */
            uint32_t            : 2;
      __IOM uint32_t RTSWATER   : 2;            /*!< [9..8] Receive RTS Configuration                                          */
            uint32_t            : 6;
      __IOM uint32_t TNP        : 2;            /*!< [17..16] Transmitter narrow pulse                                         */
      __IOM uint32_t IREN       : 1;            /*!< [18..18] Infrared enable                                                  */
            uint32_t            : 13;
    } LPUART0_MODIR_b;
  } ;

  union {
    __IOM uint32_t LPUART0_FIFO;                /*!< (@ 0x00000028) LPUART FIFO Register                                       */

    struct {
      __IM  uint32_t RXFIFOSIZE : 3;            /*!< [2..0] Receive FIFO. Buffer Depth                                         */
      __IOM uint32_t RXFE       : 1;            /*!< [3..3] Receive FIFO Enable                                                */
      __IM  uint32_t TXFIFOSIZE : 3;            /*!< [6..4] Transmit FIFO. Buffer Depth                                        */
      __IOM uint32_t TXFE       : 1;            /*!< [7..7] Transmit FIFO Enable                                               */
      __IOM uint32_t RXUFE      : 1;            /*!< [8..8] Receive FIFO Underflow Interrupt Enable                            */
      __IOM uint32_t TXOFE      : 1;            /*!< [9..9] Transmit FIFO Overflow Interrupt Enable                            */
      __IOM uint32_t RXIDEN     : 3;            /*!< [12..10] Receiver Idle Empty Enable                                       */
            uint32_t            : 1;
      __OM  uint32_t RXFLUSH    : 1;            /*!< [14..14] Receive FIFO/Buffer Flush                                        */
      __OM  uint32_t TXFLUSH    : 1;            /*!< [15..15] Transmit FIFO/Buffer Flush                                       */
      __IOM uint32_t RXUF       : 1;            /*!< [16..16] Receiver Buffer Underflow Flag                                   */
      __IOM uint32_t TXOF       : 1;            /*!< [17..17] Transmitter Buffer Overflow Flag                                 */
            uint32_t            : 4;
      __IM  uint32_t RXEMPT     : 1;            /*!< [22..22] Receive Buffer/FIFO Empty                                        */
      __IM  uint32_t TXEMPT     : 1;            /*!< [23..23] Transmit Buffer/FIFO Empty                                       */
            uint32_t            : 8;
    } LPUART0_FIFO_b;
  } ;

  union {
    __IOM uint32_t LPUART0_WATER;               /*!< (@ 0x0000002C) LPUART Watermark Register                                  */

    struct {
      __IOM uint32_t TXWATER    : 2;            /*!< [1..0] Transmit Watermark                                                 */
            uint32_t            : 6;
      __IM  uint32_t TXCOUNT    : 3;            /*!< [10..8] Transmit Counter                                                  */
            uint32_t            : 5;
      __IOM uint32_t RXWATER    : 2;            /*!< [17..16] Receive Watermark                                                */
            uint32_t            : 6;
      __IM  uint32_t RXCOUNT    : 3;            /*!< [26..24] Receive Counter                                                  */
            uint32_t            : 5;
    } LPUART0_WATER_b;
  } ;
} LPUART0_Type;                                 /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                          LPUART1                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal Asynchronous Receiver/Transmitter (LPUART1)
  */

typedef struct {                                /*!< (@ 0x4006B000) LPUART1 Structure                                          */

  union {
    __IM  uint32_t LPUART1_VERID;               /*!< (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Feature Identification Number                                     */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } LPUART1_VERID_b;
  } ;

  union {
    __IM  uint32_t LPUART1_PARAM;               /*!< (@ 0x00000004) Parameter Register                                         */

