nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t TXFIFO     : 8;            /*!< [7..0] Transmit FIFO Size                                                 */
      __IM  uint32_t RXFIFO     : 8;            /*!< [15..8] Receive FIFO Size                                                 */
            uint32_t            : 16;
    } LPUART1_PARAM_b;
  } ;

  union {
    __IOM uint32_t LPUART1_GLOBAL;              /*!< (@ 0x00000008) LPUART Global Register                                     */

    struct {
            uint32_t            : 1;
      __IOM uint32_t RST        : 1;            /*!< [1..1] Software Reset                                                     */
            uint32_t            : 30;
    } LPUART1_GLOBAL_b;
  } ;

  union {
    __IOM uint32_t LPUART1_PINCFG;              /*!< (@ 0x0000000C) LPUART Pin Configuration Register                          */

    struct {
      __IOM uint32_t TRGSEL     : 2;            /*!< [1..0] Trigger Select                                                     */
            uint32_t            : 30;
    } LPUART1_PINCFG_b;
  } ;

  union {
    __IOM uint32_t LPUART1_BAUD;                /*!< (@ 0x00000010) LPUART Baud Rate Register                                  */

    struct {
      __IOM uint32_t SBR        : 13;           /*!< [12..0] Baud Rate Modulo Divisor.                                         */
      __IOM uint32_t SBNS       : 1;            /*!< [13..13] Stop Bit Number Select                                           */
      __IOM uint32_t RXEDGIE    : 1;            /*!< [14..14] RX Input Active Edge Interrupt Enable                            */
      __IOM uint32_t LBKDIE     : 1;            /*!< [15..15] LIN Break Detect Interrupt Enable                                */
      __IOM uint32_t RESYNCDIS  : 1;            /*!< [16..16] Resynchronization Disable                                        */
      __IOM uint32_t BOTHEDGE   : 1;            /*!< [17..17] Both Edge Sampling                                               */
      __IOM uint32_t MATCFG     : 2;            /*!< [19..18] Match Configuration                                              */
      __IOM uint32_t RIDMAE     : 1;            /*!< [20..20] Receiver Idle DMA Enable                                         */
      __IOM uint32_t RDMAE      : 1;            /*!< [21..21] Receiver Full DMA Enable                                         */
            uint32_t            : 1;
      __IOM uint32_t TDMAE      : 1;            /*!< [23..23] Transmitter DMA Enable                                           */
      __IOM uint32_t OSR        : 5;            /*!< [28..24] Oversampling Ratio                                               */
      __IOM uint32_t M10        : 1;            /*!< [29..29] 10-bit Mode select                                               */
      __IOM uint32_t MAEN2      : 1;            /*!< [30..30] Match Address Mode Enable 2                                      */
      __IOM uint32_t MAEN1      : 1;            /*!< [31..31] Match Address Mode Enable 1                                      */
    } LPUART1_BAUD_b;
  } ;

  union {
    __IOM uint32_t LPUART1_STAT;                /*!< (@ 0x00000014) LPUART Status Register                                     */

    struct {
            uint32_t            : 14;
      __IOM uint32_t MA2F       : 1;            /*!< [14..14] Match 2 Flag                                                     */
      __IOM uint32_t MA1F       : 1;            /*!< [15..15] Match 1 Flag                                                     */
      __IOM uint32_t PF         : 1;            /*!< [16..16] Parity Error Flag                                                */
      __IOM uint32_t FE         : 1;            /*!< [17..17] Framing Error Flag                                               */
      __IOM uint32_t NF         : 1;            /*!< [18..18] Noise Flag                                                       */
      __IOM uint32_t OR         : 1;            /*!< [19..19] Receiver Overrun Flag                                            */
      __IOM uint32_t IDLE       : 1;            /*!< [20..20] Idle Line Flag                                                   */
      __IM  uint32_t RDRF       : 1;            /*!< [21..21] Receive Data Register Full Flag                                  */
      __IM  uint32_t TC         : 1;            /*!< [22..22] Transmission Complete Flag                                       */
      __IM  uint32_t TDRE       : 1;            /*!< [23..23] Transmit Data Register Empty Flag                                */
      __IM  uint32_t RAF        : 1;            /*!< [24..24] Receiver Active Flag                                             */
      __IOM uint32_t LBKDE      : 1;            /*!< [25..25] LIN Break Detection Enable                                       */
      __IOM uint32_t BRK13      : 1;            /*!< [26..26] Break Character Generation Length                                */
      __IOM uint32_t RWUID      : 1;            /*!< [27..27] Receive Wake Up Idle Detect                                      */
      __IOM uint32_t RXINV      : 1;            /*!< [28..28] Receive Data Inversion                                           */
      __IOM uint32_t MSBF       : 1;            /*!< [29..29] MSB First                                                        */
      __IOM uint32_t RXEDGIF    : 1;            /*!< [30..30] RXD Pin Active Edge Interrupt Flag                               */
      __IOM uint32_t LBKDIF     : 1;            /*!< [31..31] LIN Break Detect Interrupt Flag                                  */
    } LPUART1_STAT_b;
  } ;

  union {
    __IOM uint32_t LPUART1_CTRL;                /*!< (@ 0x00000018) LPUART Control Register                                    */

    struct {
      __IOM uint32_t PT         : 1;            /*!< [0..0] Parity Type                                                        */
      __IOM uint32_t PE         : 1;            /*!< [1..1] Parity Enable                                                      */
      __IOM uint32_t ILT        : 1;            /*!< [2..2] Idle Line Type Select                                              */
      __IOM uint32_t WAKE       : 1;            /*!< [3..3] Receiver Wakeup Method Select                                      */
      __IOM uint32_t M          : 1;            /*!< [4..4] 9-Bit or 8-Bit Mode Select                                         */
      __IOM uint32_t RSRC       : 1;            /*!< [5..5] Receiver Source Select                                             */
      __IOM uint32_t DOZEEN     : 1;            /*!< [6..6] Doze Enable                                                        */
      __IOM uint32_t LOOPS      : 1;            /*!< [7..7] Loop Mode Select                                                   */
      __IOM uint32_t IDLECFG    : 3;            /*!< [10..8] Idle Configuration                                                */
      __IOM uint32_t M7         : 1;            /*!< [11..11] 7-Bit Mode Select                                                */
            uint32_t            : 2;
      __IOM uint32_t MA2IE      : 1;            /*!< [14..14] Match 2 Interrupt Enable                                         */
      __IOM uint32_t MA1IE      : 1;            /*!< [15..15] Match 1 Interrupt Enable                                         */
      __IOM uint32_t SBK        : 1;            /*!< [16..16] Send Break                                                       */
      __IOM uint32_t RWU        : 1;            /*!< [17..17] Receiver Wakeup Control                                          */
      __IOM uint32_t RE         : 1;            /*!< [18..18] Receiver Enable                                                  */
      __IOM uint32_t TE         : 1;            /*!< [19..19] Transmitter Enable                                               */
      __IOM uint32_t ILIE       : 1;            /*!< [20..20] Idle Line Interrupt Enable                                       */
      __IOM uint32_t RIE        : 1;            /*!< [21..21] Receiver Interrupt Enable                                        */
      __IOM uint32_t TCIE       : 1;            /*!< [22..22] Transmission Complete Interrupt Enable for                       */
      __IOM uint32_t TIE        : 1;            /*!< [23..23] Transmit Interrupt Enable                                        */
      __IOM uint32_t PEIE       : 1;            /*!< [24..24] Parity Error Interrupt Enable                                    */
      __IOM uint32_t FEIE       : 1;            /*!< [25..25] Framing Error Interrupt Enable                                   */
      __IOM uint32_t NEIE       : 1;            /*!< [26..26] Noise Error Interrupt Enable                                     */
      __IOM uint32_t ORIE       : 1;            /*!< [27..27] Overrun Interrupt Enable                                         */
      __IOM uint32_t TXINV      : 1;            /*!< [28..28] Transmit Data Inversion                                          */
      __IOM uint32_t TXDIR      : 1;            /*!< [29..29] TXD Pin Direction in Single-Wire Mode                            */
      __IOM uint32_t R9T8       : 1;            /*!< [30..30] Receive Bit 9 / Transmit Bit 8                                   */
      __IOM uint32_t R8T9       : 1;            /*!< [31..31] Receive Bit 8 / Transmit Bit 9                                   */
    } LPUART1_CTRL_b;
  } ;

  union {
    __IOM uint32_t LPUART1_DATA;                /*!< (@ 0x0000001C) LPUART Data Register                                       */

