nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Feature Specification Number                                      */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } SMC_VERID_b;
  } ;

  union {
    __IM  uint32_t SMC_PARAM;                   /*!< (@ 0x00000004) SMC Parameter Register                                     */

    struct {
      __IM  uint32_t EHSRUN     : 1;            /*!< [0..0] Existence of HSRUN feature                                         */
            uint32_t            : 2;
      __IM  uint32_t ELLS       : 1;            /*!< [3..3] Existence of LLS feature                                           */
            uint32_t            : 1;
      __IM  uint32_t ELLS2      : 1;            /*!< [5..5] Existence of LLS2 feature                                          */
      __IM  uint32_t EVLLS0     : 1;            /*!< [6..6] Existence of VLLS0 feature                                         */
            uint32_t            : 25;
    } SMC_PARAM_b;
  } ;

  union {
    __IOM uint32_t SMC_PMPROT;                  /*!< (@ 0x00000008) Power Mode Protection register                             */

    struct {
            uint32_t            : 5;
      __IOM uint32_t AVLP       : 1;            /*!< [5..5] Allow Very-Low-Power Modes                                         */
            uint32_t            : 26;
    } SMC_PMPROT_b;
  } ;

  union {
    __IOM uint32_t SMC_PMCTRL;                  /*!< (@ 0x0000000C) Power Mode Control register                                */

    struct {
      __IOM uint32_t STOPM      : 3;            /*!< [2..0] Stop Mode Control                                                  */
      __IM  uint32_t VLPSA      : 1;            /*!< [3..3] Very Low Power Stop Aborted                                        */
            uint32_t            : 1;
      __IOM uint32_t RUNM       : 2;            /*!< [6..5] Run Mode Control                                                   */
            uint32_t            : 25;
    } SMC_PMCTRL_b;
  } ;

  union {
    __IOM uint32_t SMC_STOPCTRL;                /*!< (@ 0x00000010) Stop Control Register                                      */

    struct {
            uint32_t            : 6;
      __IOM uint32_t STOPO      : 2;            /*!< [7..6] Stop Option                                                        */
            uint32_t            : 24;
    } SMC_STOPCTRL_b;
  } ;

  union {
    __IM  uint32_t SMC_PMSTAT;                  /*!< (@ 0x00000014) Power Mode Status register                                 */

    struct {
      __IM  uint32_t PMSTAT     : 8;            /*!< [7..0] Power Mode Status                                                  */
            uint32_t            : 24;
    } SMC_PMSTAT_b;
  } ;
} SMC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            RCM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset Control Module (RCM)
  */

typedef struct {                                /*!< (@ 0x4007F000) RCM Structure                                              */

  union {
    __IM  uint32_t RCM_VERID;                   /*!< (@ 0x00000000) Version ID Register                                        */

    struct {
      __IM  uint32_t FEATURE    : 16;           /*!< [15..0] Feature Specification Number                                      */
      __IM  uint32_t MINOR      : 8;            /*!< [23..16] Minor Version Number                                             */
      __IM  uint32_t MAJOR      : 8;            /*!< [31..24] Major Version Number                                             */
    } RCM_VERID_b;
  } ;

  union {
    __IM  uint32_t RCM_PARAM;                   /*!< (@ 0x00000004) Parameter Register                                         */

    struct {
      __IM  uint32_t EWAKEUP    : 1;            /*!< [0..0] Existence of SRS[WAKEUP] status indication feature                 */
      __IM  uint32_t ELVD       : 1;            /*!< [1..1] Existence of SRS[LVD] status indication feature                    */
      __IM  uint32_t ELOC       : 1;            /*!< [2..2] Existence of SRS[LOC] status indication feature                    */
      __IM  uint32_t ELOL       : 1;            /*!< [3..3] Existence of SRS[LOL] status indication feature                    */
      __IM  uint32_t ECMU_LOC   : 1;            /*!< [4..4] Existence of SRS[CMU_LOC] status indication feature                */
      __IM  uint32_t EWDOG      : 1;            /*!< [5..5] Existence of SRS[WDOG] status indication feature                   */
      __IM  uint32_t EPIN       : 1;            /*!< [6..6] Existence of SRS[PIN] status indication feature                    */
      __IM  uint32_t EPOR       : 1;            /*!< [7..7] Existence of SRS[POR] status indication feature                    */
      __IM  uint32_t EJTAG      : 1;            /*!< [8..8] Existence of SRS[JTAG] status indication feature                   */
      __IM  uint32_t ELOCKUP    : 1;            /*!< [9..9] Existence of SRS[LOCKUP] status indication feature                 */
      __IM  uint32_t ESW        : 1;            /*!< [10..10] Existence of SRS[SW] status indication feature                   */
      __IM  uint32_t EMDM_AP    : 1;            /*!< [11..11] Existence of SRS[MDM_AP] status indication feature               */
            uint32_t            : 1;
      __IM  uint32_t ESACKERR   : 1;            /*!< [13..13] Existence of SRS[SACKERR] status indication feature              */
            uint32_t            : 1;
      __IM  uint32_t ETAMPER    : 1;            /*!< [15..15] Existence of SRS[TAMPER] status indication feature               */
      __IM  uint32_t ECORE1     : 1;            /*!< [16..16] Existence of SRS[CORE1] status indication feature                */
            uint32_t            : 15;
    } RCM_PARAM_b;
  } ;

  union {
    __IM  uint32_t RCM_SRS;                     /*!< (@ 0x00000008) System Reset Status Register                               */

