nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __OM  uint32_t PTCO       : 32;           /*!< [31..0] Port Clear Output                                                 */
    } GPIOE_PCOR_b;
  } ;

  union {
    __OM  uint32_t GPIOE_PTOR;                  /*!< (@ 0x0000000C) Port Toggle Output Register                                */

    struct {
      __OM  uint32_t PTTO       : 32;           /*!< [31..0] Port Toggle Output                                                */
    } GPIOE_PTOR_b;
  } ;

  union {
    __IM  uint32_t GPIOE_PDIR;                  /*!< (@ 0x00000010) Port Data Input Register                                   */

    struct {
      __IM  uint32_t PDI        : 32;           /*!< [31..0] Port Data Input                                                   */
    } GPIOE_PDIR_b;
  } ;

  union {
    __IOM uint32_t GPIOE_PDDR;                  /*!< (@ 0x00000014) Port Data Direction Register                               */

    struct {
      __IOM uint32_t PDD        : 32;           /*!< [31..0] Port Data Direction                                               */
    } GPIOE_PDDR_b;
  } ;

  union {
    __IOM uint32_t GPIOE_PIDR;                  /*!< (@ 0x00000018) Port Input Disable Register                                */

    struct {
      __IOM uint32_t PID        : 32;           /*!< [31..0] Port Input Disable                                                */
    } GPIOE_PIDR_b;
  } ;
} PTE_Type;                                     /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                          S32_SCB                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief System Control Registers (S32_SCB)
  */

typedef struct {                                /*!< (@ 0xE000E000) S32_SCB Structure                                          */
  __IM  uint32_t  RESERVED[2];
  __IM  uint32_t  SCB_ACTLR;                    /*!< (@ 0x00000008) Auxiliary Control Register,                                */
  __IM  uint32_t  RESERVED1[829];

  union {
    __IM  uint32_t SCB_CPUID;                   /*!< (@ 0x00000D00) CPUID Base Register                                        */

    struct {
      __IM  uint32_t REVISION   : 4;            /*!< [3..0] Indicates patch release: 0x0 = Patch 0                             */
      __IM  uint32_t PARTNO     : 12;           /*!< [15..4] Indicates part number                                             */
            uint32_t            : 4;
      __IM  uint32_t VARIANT    : 4;            /*!< [23..20] Indicates processor revision: 0x2 = Revision 2                   */
      __IM  uint32_t IMPLEMENTER : 8;           /*!< [31..24] Implementer code                                                 */
    } SCB_CPUID_b;
  } ;

  union {
    __IOM uint32_t SCB_ICSR;                    /*!< (@ 0x00000D04) Interrupt Control and State Register                       */

    struct {
      __IM  uint32_t VECTACTIVE : 6;            /*!< [5..0] Active exception number                                            */
            uint32_t            : 6;
      __IM  uint32_t VECTPENDING : 6;           /*!< [17..12] Exception number of the highest priority pending enabled
                                                     exception                                                                 */
            uint32_t            : 4;
      __IM  uint32_t ISRPENDING : 1;            /*!< [22..22] Interrupt pending flag, excluding NMI and Faults                 */
            uint32_t            : 2;
      __OM  uint32_t PENDSTCLR  : 1;            /*!< [25..25] SysTick exception clear-pending bit                              */
      __IOM uint32_t PENDSTSET  : 1;            /*!< [26..26] SysTick exception set-pending bit                                */
      __OM  uint32_t PENDSVCLR  : 1;            /*!< [27..27] PendSV clear-pending bit                                         */
      __IOM uint32_t PENDSVSET  : 1;            /*!< [28..28] PendSV set-pending bit                                           */
            uint32_t            : 2;
      __IOM uint32_t NMIPENDSET : 1;            /*!< [31..31] NMI set-pending bit                                              */
    } SCB_ICSR_b;
  } ;

  union {
    __IOM uint32_t SCB_VTOR;                    /*!< (@ 0x00000D08) Vector Table Offset Register                               */

    struct {
            uint32_t            : 7;
      __IOM uint32_t TBLOFF     : 25;           /*!< [31..7] Vector table base offset                                          */
    } SCB_VTOR_b;
  } ;

  union {
    __IOM uint32_t SCB_AIRCR;                   /*!< (@ 0x00000D0C) Application Interrupt and Reset Control Register           */

    struct {
            uint32_t            : 1;
      __OM  uint32_t VECTCLRACTIVE : 1;         /*!< [1..1] Reserved for debug use. This bit reads as 0. When writing
                                                     to the register you must write 0 to this bit, otherwise
                                                     behavior is Unpredictable.                                                */
      __OM  uint32_t SYSRESETREQ : 1;           /*!< [2..2] System reset request:                                              */
            uint32_t            : 12;
      __IM  uint32_t ENDIANNESS : 1;            /*!< [15..15] Data endianness implemented                                      */
      __IOM uint32_t VECTKEY    : 16;           /*!< [31..16] Register key                                                     */
    } SCB_AIRCR_b;
  } ;

  union {
    __IOM uint32_t SCB_SCR;                     /*!< (@ 0x00000D10) System Control Register                                    */

