nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
    struct {
      __IOM uint32_t PRI_0      : 8;            /*!< [7..0] Priority of interrupt 0                                            */
      __IOM uint32_t PRI_1      : 8;            /*!< [15..8] Priority of interrupt 1                                           */
      __IOM uint32_t PRI_2      : 8;            /*!< [23..16] Priority of interrupt 2                                          */
      __IOM uint32_t PRI_3      : 8;            /*!< [31..24] Priority of interrupt 3                                          */
    } S32_NVIC_IPR5_b;
  } ;

  union {
    __IOM uint32_t S32_NVIC_IPR6;               /*!< (@ 0x00000318) Interrupt Priority Register n                              */

    struct {
      __IOM uint32_t PRI_0      : 8;            /*!< [7..0] Priority of interrupt 0                                            */
      __IOM uint32_t PRI_1      : 8;            /*!< [15..8] Priority of interrupt 1                                           */
      __IOM uint32_t PRI_2      : 8;            /*!< [23..16] Priority of interrupt 2                                          */
      __IOM uint32_t PRI_3      : 8;            /*!< [31..24] Priority of interrupt 3                                          */
    } S32_NVIC_IPR6_b;
  } ;

  union {
    __IOM uint32_t S32_NVIC_IPR7;               /*!< (@ 0x0000031C) Interrupt Priority Register n                              */

    struct {
      __IOM uint32_t PRI_0      : 8;            /*!< [7..0] Priority of interrupt 0                                            */
      __IOM uint32_t PRI_1      : 8;            /*!< [15..8] Priority of interrupt 1                                           */
      __IOM uint32_t PRI_2      : 8;            /*!< [23..16] Priority of interrupt 2                                          */
      __IOM uint32_t PRI_3      : 8;            /*!< [31..24] Priority of interrupt 3                                          */
    } S32_NVIC_IPR7_b;
  } ;
} S32_NVIC_Type;                                /*!< Size = 800 (0x320)                                                        */



/* =========================================================================================================================== */
/* ================                                           LMEM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Local Memory Controller (LMEM)
  */

typedef struct {                                /*!< (@ 0xE0082000) LMEM Structure                                             */

  union {
    __IOM uint32_t LMEM_LMEM_PCCCR;             /*!< (@ 0x00000000) Cache control register                                     */

    struct {
      __IOM uint32_t ENCACHE    : 1;            /*!< [0..0] Cache enable                                                       */
            uint32_t            : 1;
      __IOM uint32_t PCCR2      : 1;            /*!< [2..2] Forces all cacheable spaces to write through                       */
      __IOM uint32_t PCCR3      : 1;            /*!< [3..3] Forces no allocation on cache misses (must also have
                                                     PCCR2 asserted)                                                           */
            uint32_t            : 20;
      __IOM uint32_t INVW0      : 1;            /*!< [24..24] Invalidate Way 0                                                 */
      __IOM uint32_t PUSHW0     : 1;            /*!< [25..25] Push Way 0                                                       */
      __IOM uint32_t INVW1      : 1;            /*!< [26..26] Invalidate Way 1                                                 */
      __IOM uint32_t PUSHW1     : 1;            /*!< [27..27] Push Way 1                                                       */
            uint32_t            : 3;
      __IOM uint32_t GO         : 1;            /*!< [31..31] Initiate Cache Command                                           */
    } LMEM_LMEM_PCCCR_b;
  } ;

  union {
    __IOM uint32_t LMEM_LMEM_PCCLCR;            /*!< (@ 0x00000004) Cache line control register                                */

    struct {
      __IOM uint32_t LGO        : 1;            /*!< [0..0] Initiate Cache Line Command                                        */
            uint32_t            : 1;
      __IOM uint32_t CACHEADDR  : 12;           /*!< [13..2] Cache address                                                     */
      __IOM uint32_t WSEL       : 1;            /*!< [14..14] Way select                                                       */
            uint32_t            : 1;
      __IOM uint32_t TDSEL      : 1;            /*!< [16..16] Tag/Data Select                                                  */
            uint32_t            : 3;
      __IOM uint32_t LCIVB      : 1;            /*!< [20..20] Line Command Initial Valid Bit                                   */
      __IOM uint32_t LCIMB      : 1;            /*!< [21..21] Line Command Initial Modified Bit                                */
      __IOM uint32_t LCWAY      : 1;            /*!< [22..22] Line Command Way                                                 */
            uint32_t            : 1;
      __IOM uint32_t LCMD       : 2;            /*!< [25..24] Line Command                                                     */
      __IOM uint32_t LADSEL     : 1;            /*!< [26..26] Line Address Select                                              */
      __IOM uint32_t LACC       : 1;            /*!< [27..27] Line access type                                                 */
            uint32_t            : 4;
    } LMEM_LMEM_PCCLCR_b;
  } ;

  union {
    __IOM uint32_t LMEM_LMEM_PCCSAR;            /*!< (@ 0x00000008) Cache search address register                              */

    struct {
      __IOM uint32_t LGO        : 1;            /*!< [0..0] Initiate Cache Line Command                                        */
            uint32_t            : 1;
      __IOM uint32_t PHYADDR    : 30;           /*!< [31..2] Physical Address                                                  */
    } LMEM_LMEM_PCCSAR_b;
  } ;

  union {
    __IOM uint32_t LMEM_LMEM_PCCCVR;            /*!< (@ 0x0000000C) Cache read/write value register                            */

