nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         CSE_PRAM                                          ================ */
/* =========================================================================================================================== */

/* ============================================  CSE_PRAM_EmbeddedRAM0_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM0LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM0LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM0HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM0HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM1_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM1LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM1LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM1HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM1HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM2_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM2LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM2LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM2HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM2HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM3_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM3LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM3LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM3HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM3HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM4_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM4LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM4LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM4HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM4HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM5_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM5LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM5LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM5HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM5HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM6_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM6LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM6LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM6HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM6HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM7_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM7LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM7LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM7HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM7HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM8_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM8LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM8LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM8HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM8HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM9_CSE_PRAM  ============================================= */
/* ===========================================  CSE_PRAM_EmbeddedRAM9LL_CSE_PRAM  ============================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM9LU  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM9HL  ================================================ */
/* ================================================  CSE_PRAM_EmbeddedRAM9HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM10_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM10LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM10LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM10HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM10HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM11_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM11LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM11LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM11HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM11HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM12_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM12LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM12LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM12HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM12HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM13_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM13LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM13LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM13HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM13HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM14_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM14LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM14LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM14HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM14HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM15_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM15LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM15LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM15HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM15HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM16_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM16LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM16LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM16HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM16HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM17_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM17LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM17LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM17HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM17HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM18_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM18LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM18LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM18HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM18HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM19_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM19LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM19LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM19HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM19HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM20_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM20LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM20LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM20HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM20HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM21_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM21LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM21LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM21HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM21HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM22_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM22LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM22LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM22HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM22HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM23_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM23LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM23LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM23HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM23HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM24_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM24LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM24LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM24HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM24HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM25_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM25LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM25LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM25HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM25HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM26_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM26LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM26LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM26HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM26HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM27_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM27LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM27LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM27HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM27HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM28_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM28LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM28LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM28HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM28HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM29_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM29LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM29LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM29HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM29HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM30_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM30LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM30LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM30HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM30HU  ================================================ */
/* ============================================  CSE_PRAM_EmbeddedRAM31_CSE_PRAM  ============================================ */
/* ===========================================  CSE_PRAM_EmbeddedRAM31LL_CSE_PRAM  =========================================== */
/* ===============================================  CSE_PRAM_EmbeddedRAM31LU  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM31HL  ================================================ */
/* ===============================================  CSE_PRAM_EmbeddedRAM31HU  ================================================ */


/* =========================================================================================================================== */
/* ================                                           AIPS                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  AIPS_MPRA  ======================================================= */
/* =============================================  AIPS AIPS_MPRA MPL2 [20..20]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MPL2                                                            */
  AIPS_MPRA_MPL2_0                     = 0,     /*!< 0 : Accesses from this master are forced to user-mode.                    */
  AIPS_MPRA_MPL2_1                     = 1,     /*!< 1 : Accesses from this master are not forced to user-mode.                */
} AIPS_MPRA_MPL2_Enum;

