nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  AIPS AIPS_MPRA MTW2 [21..21]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MTW2                                                            */
  AIPS_MPRA_MTW2_0                     = 0,     /*!< 0 : This master is not trusted for write accesses.                        */
  AIPS_MPRA_MTW2_1                     = 1,     /*!< 1 : This master is trusted for write accesses.                            */
} AIPS_MPRA_MTW2_Enum;

/* =============================================  AIPS AIPS_MPRA MTR2 [22..22]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MTR2                                                            */
  AIPS_MPRA_MTR2_0                     = 0,     /*!< 0 : This master is not trusted for read accesses.                         */
  AIPS_MPRA_MTR2_1                     = 1,     /*!< 1 : This master is trusted for read accesses.                             */
} AIPS_MPRA_MTR2_Enum;

/* =============================================  AIPS AIPS_MPRA MPL1 [24..24]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MPL1                                                            */
  AIPS_MPRA_MPL1_0                     = 0,     /*!< 0 : Accesses from this master are forced to user-mode.                    */
  AIPS_MPRA_MPL1_1                     = 1,     /*!< 1 : Accesses from this master are not forced to user-mode.                */
} AIPS_MPRA_MPL1_Enum;

/* =============================================  AIPS AIPS_MPRA MTW1 [25..25]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MTW1                                                            */
  AIPS_MPRA_MTW1_0                     = 0,     /*!< 0 : This master is not trusted for write accesses.                        */
  AIPS_MPRA_MTW1_1                     = 1,     /*!< 1 : This master is trusted for write accesses.                            */
} AIPS_MPRA_MTW1_Enum;

/* =============================================  AIPS AIPS_MPRA MTR1 [26..26]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MTR1                                                            */
  AIPS_MPRA_MTR1_0                     = 0,     /*!< 0 : This master is not trusted for read accesses.                         */
  AIPS_MPRA_MTR1_1                     = 1,     /*!< 1 : This master is trusted for read accesses.                             */
} AIPS_MPRA_MTR1_Enum;

/* =============================================  AIPS AIPS_MPRA MPL0 [28..28]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MPL0                                                            */
  AIPS_MPRA_MPL0_0                     = 0,     /*!< 0 : Accesses from this master are forced to user-mode.                    */
  AIPS_MPRA_MPL0_1                     = 1,     /*!< 1 : Accesses from this master are not forced to user-mode.                */
} AIPS_MPRA_MPL0_Enum;

/* =============================================  AIPS AIPS_MPRA MTW0 [29..29]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MTW0                                                            */
  AIPS_MPRA_MTW0_0                     = 0,     /*!< 0 : This master is not trusted for write accesses.                        */
  AIPS_MPRA_MTW0_1                     = 1,     /*!< 1 : This master is trusted for write accesses.                            */
} AIPS_MPRA_MTW0_Enum;

/* =============================================  AIPS AIPS_MPRA MTR0 [30..30]  ============================================== */
typedef enum {                                  /*!< AIPS_MPRA_MTR0                                                            */
  AIPS_MPRA_MTR0_0                     = 0,     /*!< 0 : This master is not trusted for read accesses.                         */
  AIPS_MPRA_MTR0_1                     = 1,     /*!< 1 : This master is trusted for read accesses.                             */
} AIPS_MPRA_MTR0_Enum;

/* ======================================================  AIPS_PACRA  ======================================================= */
/* =============================================  AIPS AIPS_PACRA TP1 [24..24]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRA_TP1                                                            */
  AIPS_PACRA_TP1_0                     = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_PACRA_TP1_1                     = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_PACRA_TP1_Enum;

/* =============================================  AIPS AIPS_PACRA WP1 [25..25]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRA_WP1                                                            */
  AIPS_PACRA_WP1_0                     = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_PACRA_WP1_1                     = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_PACRA_WP1_Enum;

/* =============================================  AIPS AIPS_PACRA SP1 [26..26]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRA_SP1                                                            */
  AIPS_PACRA_SP1_0                     = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                                    for accesses.                                              */
  AIPS_PACRA_SP1_1                     = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_PACRA_SP1_Enum;

/* =============================================  AIPS AIPS_PACRA TP0 [28..28]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRA_TP0                                                            */
  AIPS_PACRA_TP0_0                     = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_PACRA_TP0_1                     = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_PACRA_TP0_Enum;

/* =============================================  AIPS AIPS_PACRA WP0 [29..29]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRA_WP0                                                            */
  AIPS_PACRA_WP0_0                     = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_PACRA_WP0_1                     = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_PACRA_WP0_Enum;

