nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  AIPS AIPS_PACRA SP0 [30..30]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRA_SP0                                                            */
  AIPS_PACRA_SP0_0                     = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_PACRA_SP0_1                     = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_PACRA_SP0_Enum;

/* ======================================================  AIPS_PACRB  ======================================================= */
/* ==============================================  AIPS AIPS_PACRB TP5 [8..8]  =============================================== */
typedef enum {                                  /*!< AIPS_PACRB_TP5                                                            */
  AIPS_PACRB_TP5_0                     = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_PACRB_TP5_1                     = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_PACRB_TP5_Enum;

/* ==============================================  AIPS AIPS_PACRB WP5 [9..9]  =============================================== */
typedef enum {                                  /*!< AIPS_PACRB_WP5                                                            */
  AIPS_PACRB_WP5_0                     = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_PACRB_WP5_1                     = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_PACRB_WP5_Enum;

/* =============================================  AIPS AIPS_PACRB SP5 [10..10]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRB_SP5                                                            */
  AIPS_PACRB_SP5_0                     = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_PACRB_SP5_1                     = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_PACRB_SP5_Enum;

/* =============================================  AIPS AIPS_PACRB TP1 [24..24]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRB_TP1                                                            */
  AIPS_PACRB_TP1_0                     = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_PACRB_TP1_1                     = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_PACRB_TP1_Enum;

/* =============================================  AIPS AIPS_PACRB WP1 [25..25]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRB_WP1                                                            */
  AIPS_PACRB_WP1_0                     = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_PACRB_WP1_1                     = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_PACRB_WP1_Enum;

/* =============================================  AIPS AIPS_PACRB SP1 [26..26]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRB_SP1                                                            */
  AIPS_PACRB_SP1_0                     = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_PACRB_SP1_1                     = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_PACRB_SP1_Enum;

/* =============================================  AIPS AIPS_PACRB TP0 [28..28]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRB_TP0                                                            */
  AIPS_PACRB_TP0_0                     = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_PACRB_TP0_1                     = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_PACRB_TP0_Enum;

/* =============================================  AIPS AIPS_PACRB WP0 [29..29]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRB_WP0                                                            */
  AIPS_PACRB_WP0_0                     = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_PACRB_WP0_1                     = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_PACRB_WP0_Enum;

/* =============================================  AIPS AIPS_PACRB SP0 [30..30]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRB_SP0                                                            */
  AIPS_PACRB_SP0_0                     = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_PACRB_SP0_1                     = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_PACRB_SP0_Enum;

/* ======================================================  AIPS_PACRC  ======================================================= */
/* ======================================================  AIPS_PACRD  ======================================================= */
/* =============================================  AIPS AIPS_PACRD TP1 [24..24]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRD_TP1                                                            */
  AIPS_PACRD_TP1_0                     = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_PACRD_TP1_1                     = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_PACRD_TP1_Enum;

/* =============================================  AIPS AIPS_PACRD WP1 [25..25]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRD_WP1                                                            */
  AIPS_PACRD_WP1_0                     = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_PACRD_WP1_1                     = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_PACRD_WP1_Enum;

