nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  AIPS AIPS_PACRD SP1 [26..26]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRD_SP1                                                            */
  AIPS_PACRD_SP1_0                     = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_PACRD_SP1_1                     = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_PACRD_SP1_Enum;

/* =============================================  AIPS AIPS_PACRD TP0 [28..28]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRD_TP0                                                            */
  AIPS_PACRD_TP0_0                     = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_PACRD_TP0_1                     = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_PACRD_TP0_Enum;

/* =============================================  AIPS AIPS_PACRD WP0 [29..29]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRD_WP0                                                            */
  AIPS_PACRD_WP0_0                     = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_PACRD_WP0_1                     = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_PACRD_WP0_Enum;

/* =============================================  AIPS AIPS_PACRD SP0 [30..30]  ============================================== */
typedef enum {                                  /*!< AIPS_PACRD_SP0                                                            */
  AIPS_PACRD_SP0_0                     = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_PACRD_SP0_1                     = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_PACRD_SP0_Enum;

/* ======================================================  AIPS_OPACRA  ====================================================== */
/* ==============================================  AIPS AIPS_OPACRA TP7 [0..0]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRA_TP7                                                           */
  AIPS_OPACRA_TP7_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRA_TP7_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRA_TP7_Enum;

/* ==============================================  AIPS AIPS_OPACRA WP7 [1..1]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRA_WP7                                                           */
  AIPS_OPACRA_WP7_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRA_WP7_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRA_WP7_Enum;

/* ==============================================  AIPS AIPS_OPACRA SP7 [2..2]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRA_SP7                                                           */
  AIPS_OPACRA_SP7_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRA_SP7_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRA_SP7_Enum;

/* ==============================================  AIPS AIPS_OPACRA TP6 [4..4]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRA_TP6                                                           */
  AIPS_OPACRA_TP6_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRA_TP6_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRA_TP6_Enum;

/* ==============================================  AIPS AIPS_OPACRA WP6 [5..5]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRA_WP6                                                           */
  AIPS_OPACRA_WP6_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRA_WP6_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRA_WP6_Enum;

/* ==============================================  AIPS AIPS_OPACRA SP6 [6..6]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRA_SP6                                                           */
  AIPS_OPACRA_SP6_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRA_SP6_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRA_SP6_Enum;

