nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  AIPS AIPS_OPACRA TP5 [8..8]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRA_TP5                                                           */
  AIPS_OPACRA_TP5_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRA_TP5_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRA_TP5_Enum;

/* ==============================================  AIPS AIPS_OPACRA WP5 [9..9]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRA_WP5                                                           */
  AIPS_OPACRA_WP5_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRA_WP5_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRA_WP5_Enum;

/* =============================================  AIPS AIPS_OPACRA SP5 [10..10]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_SP5                                                           */
  AIPS_OPACRA_SP5_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRA_SP5_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRA_SP5_Enum;

/* =============================================  AIPS AIPS_OPACRA TP4 [12..12]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_TP4                                                           */
  AIPS_OPACRA_TP4_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRA_TP4_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRA_TP4_Enum;

/* =============================================  AIPS AIPS_OPACRA WP4 [13..13]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_WP4                                                           */
  AIPS_OPACRA_WP4_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRA_WP4_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRA_WP4_Enum;

/* =============================================  AIPS AIPS_OPACRA SP4 [14..14]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_SP4                                                           */
  AIPS_OPACRA_SP4_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRA_SP4_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRA_SP4_Enum;

/* =============================================  AIPS AIPS_OPACRA TP1 [24..24]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_TP1                                                           */
  AIPS_OPACRA_TP1_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRA_TP1_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRA_TP1_Enum;

/* =============================================  AIPS AIPS_OPACRA WP1 [25..25]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_WP1                                                           */
  AIPS_OPACRA_WP1_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRA_WP1_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRA_WP1_Enum;

/* =============================================  AIPS AIPS_OPACRA SP1 [26..26]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_SP1                                                           */
  AIPS_OPACRA_SP1_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRA_SP1_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRA_SP1_Enum;

/* =============================================  AIPS AIPS_OPACRA TP0 [28..28]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_TP0                                                           */
  AIPS_OPACRA_TP0_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRA_TP0_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRA_TP0_Enum;

/* =============================================  AIPS AIPS_OPACRA WP0 [29..29]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_WP0                                                           */
  AIPS_OPACRA_WP0_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRA_WP0_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRA_WP0_Enum;

/* =============================================  AIPS AIPS_OPACRA SP0 [30..30]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRA_SP0                                                           */
  AIPS_OPACRA_SP0_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRA_SP0_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRA_SP0_Enum;

/* ======================================================  AIPS_OPACRB  ====================================================== */
/* ==============================================  AIPS AIPS_OPACRB TP6 [4..4]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRB_TP6                                                           */
  AIPS_OPACRB_TP6_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRB_TP6_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRB_TP6_Enum;

/* ==============================================  AIPS AIPS_OPACRB WP6 [5..5]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRB_WP6                                                           */
  AIPS_OPACRB_WP6_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRB_WP6_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRB_WP6_Enum;

