nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  AIPS AIPS_OPACRB SP6 [6..6]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRB_SP6                                                           */
  AIPS_OPACRB_SP6_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRB_SP6_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRB_SP6_Enum;

/* ==============================================  AIPS AIPS_OPACRB TP5 [8..8]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRB_TP5                                                           */
  AIPS_OPACRB_TP5_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRB_TP5_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRB_TP5_Enum;

/* ==============================================  AIPS AIPS_OPACRB WP5 [9..9]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRB_WP5                                                           */
  AIPS_OPACRB_WP5_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRB_WP5_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRB_WP5_Enum;

/* =============================================  AIPS AIPS_OPACRB SP5 [10..10]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRB_SP5                                                           */
  AIPS_OPACRB_SP5_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRB_SP5_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRB_SP5_Enum;

/* =============================================  AIPS AIPS_OPACRB TP4 [12..12]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRB_TP4                                                           */
  AIPS_OPACRB_TP4_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRB_TP4_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRB_TP4_Enum;

/* =============================================  AIPS AIPS_OPACRB WP4 [13..13]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRB_WP4                                                           */
  AIPS_OPACRB_WP4_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRB_WP4_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRB_WP4_Enum;

/* =============================================  AIPS AIPS_OPACRB SP4 [14..14]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRB_SP4                                                           */
  AIPS_OPACRB_SP4_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRB_SP4_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRB_SP4_Enum;

/* =============================================  AIPS AIPS_OPACRB TP3 [16..16]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRB_TP3                                                           */
  AIPS_OPACRB_TP3_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRB_TP3_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRB_TP3_Enum;

/* =============================================  AIPS AIPS_OPACRB WP3 [17..17]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRB_WP3                                                           */
  AIPS_OPACRB_WP3_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRB_WP3_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRB_WP3_Enum;

/* =============================================  AIPS AIPS_OPACRB SP3 [18..18]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRB_SP3                                                           */
  AIPS_OPACRB_SP3_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRB_SP3_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRB_SP3_Enum;

/* ======================================================  AIPS_OPACRC  ====================================================== */
/* ==============================================  AIPS AIPS_OPACRC TP7 [0..0]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRC_TP7                                                           */
  AIPS_OPACRC_TP7_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRC_TP7_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRC_TP7_Enum;

/* ==============================================  AIPS AIPS_OPACRC WP7 [1..1]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRC_WP7                                                           */
  AIPS_OPACRC_WP7_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRC_WP7_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRC_WP7_Enum;

