nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  AIPS AIPS_OPACRC SP7 [2..2]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRC_SP7                                                           */
  AIPS_OPACRC_SP7_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRC_SP7_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRC_SP7_Enum;

/* ==============================================  AIPS AIPS_OPACRC TP6 [4..4]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRC_TP6                                                           */
  AIPS_OPACRC_TP6_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRC_TP6_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRC_TP6_Enum;

/* ==============================================  AIPS AIPS_OPACRC WP6 [5..5]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRC_WP6                                                           */
  AIPS_OPACRC_WP6_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRC_WP6_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRC_WP6_Enum;

/* ==============================================  AIPS AIPS_OPACRC SP6 [6..6]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRC_SP6                                                           */
  AIPS_OPACRC_SP6_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRC_SP6_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRC_SP6_Enum;

/* =============================================  AIPS AIPS_OPACRC TP2 [20..20]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRC_TP2                                                           */
  AIPS_OPACRC_TP2_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRC_TP2_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRC_TP2_Enum;

/* =============================================  AIPS AIPS_OPACRC WP2 [21..21]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRC_WP2                                                           */
  AIPS_OPACRC_WP2_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRC_WP2_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRC_WP2_Enum;

/* =============================================  AIPS AIPS_OPACRC SP2 [22..22]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRC_SP2                                                           */
  AIPS_OPACRC_SP2_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRC_SP2_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRC_SP2_Enum;

/* =============================================  AIPS AIPS_OPACRC TP1 [24..24]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRC_TP1                                                           */
  AIPS_OPACRC_TP1_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRC_TP1_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRC_TP1_Enum;

/* =============================================  AIPS AIPS_OPACRC WP1 [25..25]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRC_WP1                                                           */
  AIPS_OPACRC_WP1_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRC_WP1_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRC_WP1_Enum;

/* =============================================  AIPS AIPS_OPACRC SP1 [26..26]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRC_SP1                                                           */
  AIPS_OPACRC_SP1_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRC_SP1_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRC_SP1_Enum;

/* ======================================================  AIPS_OPACRD  ====================================================== */
/* ==============================================  AIPS AIPS_OPACRD TP5 [8..8]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRD_TP5                                                           */
  AIPS_OPACRD_TP5_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRD_TP5_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRD_TP5_Enum;

/* ==============================================  AIPS AIPS_OPACRD WP5 [9..9]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRD_WP5                                                           */
  AIPS_OPACRD_WP5_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRD_WP5_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRD_WP5_Enum;

