nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  AIPS AIPS_OPACRD SP5 [10..10]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_SP5                                                           */
  AIPS_OPACRD_SP5_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRD_SP5_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRD_SP5_Enum;

/* =============================================  AIPS AIPS_OPACRD TP3 [16..16]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_TP3                                                           */
  AIPS_OPACRD_TP3_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRD_TP3_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRD_TP3_Enum;

/* =============================================  AIPS AIPS_OPACRD WP3 [17..17]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_WP3                                                           */
  AIPS_OPACRD_WP3_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRD_WP3_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRD_WP3_Enum;

/* =============================================  AIPS AIPS_OPACRD SP3 [18..18]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_SP3                                                           */
  AIPS_OPACRD_SP3_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRD_SP3_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRD_SP3_Enum;

/* =============================================  AIPS AIPS_OPACRD TP2 [20..20]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_TP2                                                           */
  AIPS_OPACRD_TP2_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRD_TP2_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRD_TP2_Enum;

/* =============================================  AIPS AIPS_OPACRD WP2 [21..21]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_WP2                                                           */
  AIPS_OPACRD_WP2_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRD_WP2_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRD_WP2_Enum;

/* =============================================  AIPS AIPS_OPACRD SP2 [22..22]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_SP2                                                           */
  AIPS_OPACRD_SP2_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRD_SP2_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRD_SP2_Enum;

/* =============================================  AIPS AIPS_OPACRD TP1 [24..24]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_TP1                                                           */
  AIPS_OPACRD_TP1_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRD_TP1_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRD_TP1_Enum;

/* =============================================  AIPS AIPS_OPACRD WP1 [25..25]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_WP1                                                           */
  AIPS_OPACRD_WP1_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRD_WP1_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRD_WP1_Enum;

/* =============================================  AIPS AIPS_OPACRD SP1 [26..26]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_SP1                                                           */
  AIPS_OPACRD_SP1_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRD_SP1_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRD_SP1_Enum;

/* =============================================  AIPS AIPS_OPACRD TP0 [28..28]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_TP0                                                           */
  AIPS_OPACRD_TP0_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRD_TP0_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRD_TP0_Enum;

/* =============================================  AIPS AIPS_OPACRD WP0 [29..29]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_WP0                                                           */
  AIPS_OPACRD_WP0_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRD_WP0_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRD_WP0_Enum;

/* =============================================  AIPS AIPS_OPACRD SP0 [30..30]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRD_SP0                                                           */
  AIPS_OPACRD_SP0_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRD_SP0_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRD_SP0_Enum;

