nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  AIPS_OPACRE  ====================================================== */
/* ==============================================  AIPS AIPS_OPACRE TP6 [4..4]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRE_TP6                                                           */
  AIPS_OPACRE_TP6_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRE_TP6_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRE_TP6_Enum;

/* ==============================================  AIPS AIPS_OPACRE WP6 [5..5]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRE_WP6                                                           */
  AIPS_OPACRE_WP6_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRE_WP6_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRE_WP6_Enum;

/* ==============================================  AIPS AIPS_OPACRE SP6 [6..6]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRE_SP6                                                           */
  AIPS_OPACRE_SP6_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRE_SP6_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRE_SP6_Enum;

/* =============================================  AIPS AIPS_OPACRE TP0 [28..28]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRE_TP0                                                           */
  AIPS_OPACRE_TP0_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRE_TP0_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRE_TP0_Enum;

/* =============================================  AIPS AIPS_OPACRE WP0 [29..29]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRE_WP0                                                           */
  AIPS_OPACRE_WP0_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRE_WP0_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRE_WP0_Enum;

/* =============================================  AIPS AIPS_OPACRE SP0 [30..30]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRE_SP0                                                           */
  AIPS_OPACRE_SP0_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRE_SP0_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRE_SP0_Enum;

/* ======================================================  AIPS_OPACRF  ====================================================== */
/* ==============================================  AIPS AIPS_OPACRF TP5 [8..8]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRF_TP5                                                           */
  AIPS_OPACRF_TP5_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRF_TP5_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRF_TP5_Enum;

/* ==============================================  AIPS AIPS_OPACRF WP5 [9..9]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRF_WP5                                                           */
  AIPS_OPACRF_WP5_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRF_WP5_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRF_WP5_Enum;

/* =============================================  AIPS AIPS_OPACRF SP5 [10..10]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_SP5                                                           */
  AIPS_OPACRF_SP5_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRF_SP5_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRF_SP5_Enum;

/* =============================================  AIPS AIPS_OPACRF TP4 [12..12]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_TP4                                                           */
  AIPS_OPACRF_TP4_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRF_TP4_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRF_TP4_Enum;

/* =============================================  AIPS AIPS_OPACRF WP4 [13..13]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_WP4                                                           */
  AIPS_OPACRF_WP4_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRF_WP4_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRF_WP4_Enum;

/* =============================================  AIPS AIPS_OPACRF SP4 [14..14]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_SP4                                                           */
  AIPS_OPACRF_SP4_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRF_SP4_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRF_SP4_Enum;

/* =============================================  AIPS AIPS_OPACRF TP3 [16..16]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_TP3                                                           */
  AIPS_OPACRF_TP3_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRF_TP3_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRF_TP3_Enum;

/* =============================================  AIPS AIPS_OPACRF WP3 [17..17]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRF_WP3                                                           */
  AIPS_OPACRF_WP3_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRF_WP3_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRF_WP3_Enum;

