nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  AIPS_OPACRH  ====================================================== */
/* =============================================  AIPS AIPS_OPACRH TP2 [20..20]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRH_TP2                                                           */
  AIPS_OPACRH_TP2_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRH_TP2_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRH_TP2_Enum;

/* =============================================  AIPS AIPS_OPACRH WP2 [21..21]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRH_WP2                                                           */
  AIPS_OPACRH_WP2_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRH_WP2_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRH_WP2_Enum;

/* =============================================  AIPS AIPS_OPACRH SP2 [22..22]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRH_SP2                                                           */
  AIPS_OPACRH_SP2_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRH_SP2_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRH_SP2_Enum;

/* ======================================================  AIPS_OPACRI  ====================================================== */
/* ==============================================  AIPS AIPS_OPACRI TP6 [4..4]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRI_TP6                                                           */
  AIPS_OPACRI_TP6_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRI_TP6_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRI_TP6_Enum;

/* ==============================================  AIPS AIPS_OPACRI WP6 [5..5]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRI_WP6                                                           */
  AIPS_OPACRI_WP6_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRI_WP6_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRI_WP6_Enum;

/* ==============================================  AIPS AIPS_OPACRI SP6 [6..6]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRI_SP6                                                           */
  AIPS_OPACRI_SP6_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRI_SP6_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRI_SP6_Enum;

/* ==============================================  AIPS AIPS_OPACRI TP5 [8..8]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRI_TP5                                                           */
  AIPS_OPACRI_TP5_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRI_TP5_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRI_TP5_Enum;

/* ==============================================  AIPS AIPS_OPACRI WP5 [9..9]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRI_WP5                                                           */
  AIPS_OPACRI_WP5_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRI_WP5_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRI_WP5_Enum;

/* =============================================  AIPS AIPS_OPACRI SP5 [10..10]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_SP5                                                           */
  AIPS_OPACRI_SP5_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRI_SP5_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRI_SP5_Enum;

/* =============================================  AIPS AIPS_OPACRI TP4 [12..12]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_TP4                                                           */
  AIPS_OPACRI_TP4_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRI_TP4_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRI_TP4_Enum;

/* =============================================  AIPS AIPS_OPACRI WP4 [13..13]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_WP4                                                           */
  AIPS_OPACRI_WP4_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRI_WP4_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRI_WP4_Enum;

/* =============================================  AIPS AIPS_OPACRI SP4 [14..14]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_SP4                                                           */
  AIPS_OPACRI_SP4_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRI_SP4_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRI_SP4_Enum;

/* =============================================  AIPS AIPS_OPACRI TP3 [16..16]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_TP3                                                           */
  AIPS_OPACRI_TP3_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRI_TP3_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRI_TP3_Enum;

/* =============================================  AIPS AIPS_OPACRI WP3 [17..17]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_WP3                                                           */
  AIPS_OPACRI_WP3_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRI_WP3_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRI_WP3_Enum;

/* =============================================  AIPS AIPS_OPACRI SP3 [18..18]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_SP3                                                           */
  AIPS_OPACRI_SP3_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRI_SP3_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRI_SP3_Enum;

/* =============================================  AIPS AIPS_OPACRI TP1 [24..24]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_TP1                                                           */
  AIPS_OPACRI_TP1_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRI_TP1_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRI_TP1_Enum;

/* =============================================  AIPS AIPS_OPACRI WP1 [25..25]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_WP1                                                           */
  AIPS_OPACRI_WP1_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRI_WP1_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRI_WP1_Enum;

