nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  AIPS AIPS_OPACRI SP1 [26..26]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRI_SP1                                                           */
  AIPS_OPACRI_SP1_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRI_SP1_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRI_SP1_Enum;

/* ======================================================  AIPS_OPACRJ  ====================================================== */
/* =============================================  AIPS AIPS_OPACRJ TP4 [12..12]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_TP4                                                           */
  AIPS_OPACRJ_TP4_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRJ_TP4_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRJ_TP4_Enum;

/* =============================================  AIPS AIPS_OPACRJ WP4 [13..13]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_WP4                                                           */
  AIPS_OPACRJ_WP4_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRJ_WP4_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRJ_WP4_Enum;

/* =============================================  AIPS AIPS_OPACRJ SP4 [14..14]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_SP4                                                           */
  AIPS_OPACRJ_SP4_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRJ_SP4_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRJ_SP4_Enum;

/* =============================================  AIPS AIPS_OPACRJ TP3 [16..16]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_TP3                                                           */
  AIPS_OPACRJ_TP3_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRJ_TP3_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRJ_TP3_Enum;

/* =============================================  AIPS AIPS_OPACRJ WP3 [17..17]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_WP3                                                           */
  AIPS_OPACRJ_WP3_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRJ_WP3_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRJ_WP3_Enum;

/* =============================================  AIPS AIPS_OPACRJ SP3 [18..18]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_SP3                                                           */
  AIPS_OPACRJ_SP3_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRJ_SP3_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRJ_SP3_Enum;

/* =============================================  AIPS AIPS_OPACRJ TP2 [20..20]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_TP2                                                           */
  AIPS_OPACRJ_TP2_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRJ_TP2_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRJ_TP2_Enum;

/* =============================================  AIPS AIPS_OPACRJ WP2 [21..21]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_WP2                                                           */
  AIPS_OPACRJ_WP2_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRJ_WP2_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRJ_WP2_Enum;

/* =============================================  AIPS AIPS_OPACRJ SP2 [22..22]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRJ_SP2                                                           */
  AIPS_OPACRJ_SP2_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRJ_SP2_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRJ_SP2_Enum;

