nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  AIPS_OPACRK  ====================================================== */
/* =============================================  AIPS AIPS_OPACRK TP3 [16..16]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRK_TP3                                                           */
  AIPS_OPACRK_TP3_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRK_TP3_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRK_TP3_Enum;

/* =============================================  AIPS AIPS_OPACRK WP3 [17..17]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRK_WP3                                                           */
  AIPS_OPACRK_WP3_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRK_WP3_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRK_WP3_Enum;

/* =============================================  AIPS AIPS_OPACRK SP3 [18..18]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRK_SP3                                                           */
  AIPS_OPACRK_SP3_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRK_SP3_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRK_SP3_Enum;

/* ======================================================  AIPS_OPACRL  ====================================================== */
/* ==============================================  AIPS AIPS_OPACRL TP7 [0..0]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRL_TP7                                                           */
  AIPS_OPACRL_TP7_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRL_TP7_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRL_TP7_Enum;

/* ==============================================  AIPS AIPS_OPACRL WP7 [1..1]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRL_WP7                                                           */
  AIPS_OPACRL_WP7_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRL_WP7_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRL_WP7_Enum;

/* ==============================================  AIPS AIPS_OPACRL SP7 [2..2]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRL_SP7                                                           */
  AIPS_OPACRL_SP7_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRL_SP7_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRL_SP7_Enum;

/* ==============================================  AIPS AIPS_OPACRL TP6 [4..4]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRL_TP6                                                           */
  AIPS_OPACRL_TP6_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRL_TP6_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRL_TP6_Enum;

/* ==============================================  AIPS AIPS_OPACRL WP6 [5..5]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRL_WP6                                                           */
  AIPS_OPACRL_WP6_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRL_WP6_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRL_WP6_Enum;

/* ==============================================  AIPS AIPS_OPACRL SP6 [6..6]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRL_SP6                                                           */
  AIPS_OPACRL_SP6_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRL_SP6_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRL_SP6_Enum;

/* ==============================================  AIPS AIPS_OPACRL TP5 [8..8]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRL_TP5                                                           */
  AIPS_OPACRL_TP5_0                    = 0,     /*!< 0 : Accesses from an untrusted master are allowed.                        */
  AIPS_OPACRL_TP5_1                    = 1,     /*!< 1 : Accesses from an untrusted master are not allowed.                    */
} AIPS_OPACRL_TP5_Enum;

/* ==============================================  AIPS AIPS_OPACRL WP5 [9..9]  ============================================== */
typedef enum {                                  /*!< AIPS_OPACRL_WP5                                                           */
  AIPS_OPACRL_WP5_0                    = 0,     /*!< 0 : This peripheral allows write accesses.                                */
  AIPS_OPACRL_WP5_1                    = 1,     /*!< 1 : This peripheral is write protected.                                   */
} AIPS_OPACRL_WP5_Enum;

/* =============================================  AIPS AIPS_OPACRL SP5 [10..10]  ============================================= */
typedef enum {                                  /*!< AIPS_OPACRL_SP5                                                           */
  AIPS_OPACRL_SP5_0                    = 0,     /*!< 0 : This peripheral does not require supervisor privilege level
                                                     for accesses.                                                             */
  AIPS_OPACRL_SP5_1                    = 1,     /*!< 1 : This peripheral requires supervisor privilege level for
                                                     accesses.                                                                 */
} AIPS_OPACRL_SP5_Enum;



/* =========================================================================================================================== */
/* ================                                           MSCM                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  MSCM_CPxTYPE  ====================================================== */
/* ======================================================  MSCM_CPxNUM  ====================================================== */
/* ====================================================  MSCM_CPxMASTER  ===================================================== */
/* =====================================================  MSCM_CPxCOUNT  ===================================================== */
/* =====================================================  MSCM_CPxCFG0  ====================================================== */
/* =====================================================  MSCM_CPxCFG1  ====================================================== */
/* =====================================================  MSCM_CPxCFG2  ====================================================== */
/* =====================================================  MSCM_CPxCFG3  ====================================================== */
/* =============================================  MSCM MSCM_CPxCFG3 FPU [0..0]  ============================================== */
typedef enum {                                  /*!< MSCM_CPxCFG3_FPU                                                          */
  MSCM_CPxCFG3_FPU_0                   = 0,     /*!< 0 : FPU support is not included.                                          */
  MSCM_CPxCFG3_FPU_1                   = 1,     /*!< 1 : FPU support is included.                                              */
} MSCM_CPxCFG3_FPU_Enum;

/* =============================================  MSCM MSCM_CPxCFG3 SIMD [1..1]  ============================================= */
typedef enum {                                  /*!< MSCM_CPxCFG3_SIMD                                                         */
  MSCM_CPxCFG3_SIMD_0                  = 0,     /*!< 0 : SIMD/NEON support is not included.                                    */
  MSCM_CPxCFG3_SIMD_1                  = 1,     /*!< 1 : SIMD/NEON support is included.                                        */
} MSCM_CPxCFG3_SIMD_Enum;

/* =============================================  MSCM MSCM_CPxCFG3 JAZ [2..2]  ============================================== */
typedef enum {                                  /*!< MSCM_CPxCFG3_JAZ                                                          */
  MSCM_CPxCFG3_JAZ_0                   = 0,     /*!< 0 : Jazelle support is not included.                                      */
  MSCM_CPxCFG3_JAZ_1                   = 1,     /*!< 1 : Jazelle support is included.                                          */
} MSCM_CPxCFG3_JAZ_Enum;

/* =============================================  MSCM MSCM_CPxCFG3 MMU [3..3]  ============================================== */
typedef enum {                                  /*!< MSCM_CPxCFG3_MMU                                                          */
  MSCM_CPxCFG3_MMU_0                   = 0,     /*!< 0 : MMU support is not included.                                          */
  MSCM_CPxCFG3_MMU_1                   = 1,     /*!< 1 : MMU support is included.                                              */
} MSCM_CPxCFG3_MMU_Enum;

/* ==============================================  MSCM MSCM_CPxCFG3 TZ [4..4]  ============================================== */
typedef enum {                                  /*!< MSCM_CPxCFG3_TZ                                                           */
  MSCM_CPxCFG3_TZ_0                    = 0,     /*!< 0 : Trust Zone support is not included.                                   */
  MSCM_CPxCFG3_TZ_1                    = 1,     /*!< 1 : Trust Zone support is included.                                       */
} MSCM_CPxCFG3_TZ_Enum;

/* =============================================  MSCM MSCM_CPxCFG3 CMP [5..5]  ============================================== */
typedef enum {                                  /*!< MSCM_CPxCFG3_CMP                                                          */
  MSCM_CPxCFG3_CMP_0                   = 0,     /*!< 0 : Core Memory Protection is not included.                               */
  MSCM_CPxCFG3_CMP_1                   = 1,     /*!< 1 : Core Memory Protection is included.                                   */
} MSCM_CPxCFG3_CMP_Enum;

