nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  MSCM MSCM_CPxCFG3 BB [6..6]  ============================================== */
typedef enum {                                  /*!< MSCM_CPxCFG3_BB                                                           */
  MSCM_CPxCFG3_BB_0                    = 0,     /*!< 0 : Bit Banding is not supported.                                         */
  MSCM_CPxCFG3_BB_1                    = 1,     /*!< 1 : Bit Banding is supported.                                             */
} MSCM_CPxCFG3_BB_Enum;

/* =====================================================  MSCM_CP0TYPE  ====================================================== */
/* ======================================================  MSCM_CP0NUM  ====================================================== */
/* ====================================================  MSCM_CP0MASTER  ===================================================== */
/* =====================================================  MSCM_CP0COUNT  ===================================================== */
/* =====================================================  MSCM_CP0CFG0  ====================================================== */
/* =====================================================  MSCM_CP0CFG1  ====================================================== */
/* =====================================================  MSCM_CP0CFG2  ====================================================== */
/* =====================================================  MSCM_CP0CFG3  ====================================================== */
/* =============================================  MSCM MSCM_CP0CFG3 FPU [0..0]  ============================================== */
typedef enum {                                  /*!< MSCM_CP0CFG3_FPU                                                          */
  MSCM_CP0CFG3_FPU_0                   = 0,     /*!< 0 : FPU support is not included.                                          */
  MSCM_CP0CFG3_FPU_1                   = 1,     /*!< 1 : FPU support is included.                                              */
} MSCM_CP0CFG3_FPU_Enum;

/* =============================================  MSCM MSCM_CP0CFG3 SIMD [1..1]  ============================================= */
typedef enum {                                  /*!< MSCM_CP0CFG3_SIMD                                                         */
  MSCM_CP0CFG3_SIMD_0                  = 0,     /*!< 0 : SIMD/NEON support is not included.                                    */
  MSCM_CP0CFG3_SIMD_1                  = 1,     /*!< 1 : SIMD/NEON support is included.                                        */
} MSCM_CP0CFG3_SIMD_Enum;

/* =============================================  MSCM MSCM_CP0CFG3 JAZ [2..2]  ============================================== */
typedef enum {                                  /*!< MSCM_CP0CFG3_JAZ                                                          */
  MSCM_CP0CFG3_JAZ_0                   = 0,     /*!< 0 : Jazelle support is not included.                                      */
  MSCM_CP0CFG3_JAZ_1                   = 1,     /*!< 1 : Jazelle support is included.                                          */
} MSCM_CP0CFG3_JAZ_Enum;

/* =============================================  MSCM MSCM_CP0CFG3 MMU [3..3]  ============================================== */
typedef enum {                                  /*!< MSCM_CP0CFG3_MMU                                                          */
  MSCM_CP0CFG3_MMU_0                   = 0,     /*!< 0 : MMU support is not included.                                          */
  MSCM_CP0CFG3_MMU_1                   = 1,     /*!< 1 : MMU support is included.                                              */
} MSCM_CP0CFG3_MMU_Enum;

/* ==============================================  MSCM MSCM_CP0CFG3 TZ [4..4]  ============================================== */
typedef enum {                                  /*!< MSCM_CP0CFG3_TZ                                                           */
  MSCM_CP0CFG3_TZ_0                    = 0,     /*!< 0 : Trust Zone support is not included.                                   */
  MSCM_CP0CFG3_TZ_1                    = 1,     /*!< 1 : Trust Zone support is included.                                       */
} MSCM_CP0CFG3_TZ_Enum;

/* =============================================  MSCM MSCM_CP0CFG3 CMP [5..5]  ============================================== */
typedef enum {                                  /*!< MSCM_CP0CFG3_CMP                                                          */
  MSCM_CP0CFG3_CMP_0                   = 0,     /*!< 0 : Core Memory Protection is not included.                               */
  MSCM_CP0CFG3_CMP_1                   = 1,     /*!< 1 : Core Memory Protection is included.                                   */
} MSCM_CP0CFG3_CMP_Enum;

/* ==============================================  MSCM MSCM_CP0CFG3 BB [6..6]  ============================================== */
typedef enum {                                  /*!< MSCM_CP0CFG3_BB                                                           */
  MSCM_CP0CFG3_BB_0                    = 0,     /*!< 0 : Bit Banding is not supported.                                         */
  MSCM_CP0CFG3_BB_1                    = 1,     /*!< 1 : Bit Banding is supported.                                             */
} MSCM_CP0CFG3_BB_Enum;

/* ======================================================  MSCM_OCMDR0  ====================================================== */
/* ============================================  MSCM MSCM_OCMDR0 OCMT [13..15]  ============================================= */
typedef enum {                                  /*!< MSCM_OCMDR0_OCMT                                                          */
  MSCM_OCMDR0_OCMT_100                 = 4,     /*!< 100 : OCMEMn is a Program Flash.                                          */
  MSCM_OCMDR0_OCMT_101                 = 5,     /*!< 101 : OCMEMn is a Data Flash.                                             */
  MSCM_OCMDR0_OCMT_110                 = 6,     /*!< 110 : OCMEMn is an EEE.                                                   */
} MSCM_OCMDR0_OCMT_Enum;

/* =============================================  MSCM MSCM_OCMDR0 RO [16..16]  ============================================== */
typedef enum {                                  /*!< MSCM_OCMDR0_RO                                                            */
  MSCM_OCMDR0_RO_0                     = 0,     /*!< 0 : Writes to the OCMDRn[11:0] are allowed                                */
  MSCM_OCMDR0_RO_1                     = 1,     /*!< 1 : Writes to the OCMDRn[11:0] are ignored                                */
} MSCM_OCMDR0_RO_Enum;

/* ============================================  MSCM MSCM_OCMDR0 OCMW [17..19]  ============================================= */
typedef enum {                                  /*!< MSCM_OCMDR0_OCMW                                                          */
  MSCM_OCMDR0_OCMW_010                 = 2,     /*!< 010 : OCMEMn 32-bits wide                                                 */
  MSCM_OCMDR0_OCMW_011                 = 3,     /*!< 011 : OCMEMn 64-bits wide                                                 */
  MSCM_OCMDR0_OCMW_100                 = 4,     /*!< 100 : OCMEMn 128-bits wide                                                */
  MSCM_OCMDR0_OCMW_101                 = 5,     /*!< 101 : OCMEMn 256-bits wide                                                */
} MSCM_OCMDR0_OCMW_Enum;

