nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  MSCM MSCM_OCMDR0 OCMSZ [24..27]  ============================================ */
typedef enum {                                  /*!< MSCM_OCMDR0_OCMSZ                                                         */
  MSCM_OCMDR0_OCMSZ_0000               = 0,     /*!< 0000 : no OCMEMn                                                          */
  MSCM_OCMDR0_OCMSZ_0001               = 1,     /*!< 0001 : 1KB OCMEMn                                                         */
  MSCM_OCMDR0_OCMSZ_0010               = 2,     /*!< 0010 : 2KB OCMEMn                                                         */
  MSCM_OCMDR0_OCMSZ_0011               = 3,     /*!< 0011 : 4KB OCMEMn                                                         */
  MSCM_OCMDR0_OCMSZ_0100               = 4,     /*!< 0100 : 8KB OCMEMn                                                         */
  MSCM_OCMDR0_OCMSZ_0101               = 5,     /*!< 0101 : 16KB OCMEMn                                                        */
  MSCM_OCMDR0_OCMSZ_0110               = 6,     /*!< 0110 : 32KB OCMEMn                                                        */
  MSCM_OCMDR0_OCMSZ_0111               = 7,     /*!< 0111 : 64KB OCMEMn                                                        */
  MSCM_OCMDR0_OCMSZ_1000               = 8,     /*!< 1000 : 128KB OCMEMn                                                       */
  MSCM_OCMDR0_OCMSZ_1001               = 9,     /*!< 1001 : 256KB OCMEMn                                                       */
  MSCM_OCMDR0_OCMSZ_1010               = 10,    /*!< 1010 : 512KB OCMEMn                                                       */
  MSCM_OCMDR0_OCMSZ_1011               = 11,    /*!< 1011 : 1MB OCMEMn                                                         */
  MSCM_OCMDR0_OCMSZ_1100               = 12,    /*!< 1100 : 2MB OCMEMn                                                         */
  MSCM_OCMDR0_OCMSZ_1101               = 13,    /*!< 1101 : 4MB OCMEMn                                                         */
  MSCM_OCMDR0_OCMSZ_1110               = 14,    /*!< 1110 : 8MB OCMEMn                                                         */
  MSCM_OCMDR0_OCMSZ_1111               = 15,    /*!< 1111 : 16MB OCMEMn                                                        */
} MSCM_OCMDR0_OCMSZ_Enum;

/* ===========================================  MSCM MSCM_OCMDR0 OCMSZH [28..28]  ============================================ */
typedef enum {                                  /*!< MSCM_OCMDR0_OCMSZH                                                        */
  MSCM_OCMDR0_OCMSZH_0                 = 0,     /*!< 0 : OCMEMn is a power-of-2 capacity.                                      */
  MSCM_OCMDR0_OCMSZH_1                 = 1,     /*!< 1 : OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.          */
} MSCM_OCMDR0_OCMSZH_Enum;

/* ==============================================  MSCM MSCM_OCMDR0 V [31..31]  ============================================== */
typedef enum {                                  /*!< MSCM_OCMDR0_V                                                             */
  MSCM_OCMDR0_V_0                      = 0,     /*!< 0 : OCMEMn is not present.                                                */
  MSCM_OCMDR0_V_1                      = 1,     /*!< 1 : OCMEMn is present.                                                    */
} MSCM_OCMDR0_V_Enum;

/* ======================================================  MSCM_OCMDR1  ====================================================== */
/* ============================================  MSCM MSCM_OCMDR1 OCMT [13..15]  ============================================= */
typedef enum {                                  /*!< MSCM_OCMDR1_OCMT                                                          */
  MSCM_OCMDR1_OCMT_100                 = 4,     /*!< 100 : OCMEMn is a Program Flash.                                          */
  MSCM_OCMDR1_OCMT_101                 = 5,     /*!< 101 : OCMEMn is a Data Flash.                                             */
  MSCM_OCMDR1_OCMT_110                 = 6,     /*!< 110 : OCMEMn is an EEE.                                                   */
} MSCM_OCMDR1_OCMT_Enum;

/* =============================================  MSCM MSCM_OCMDR1 RO [16..16]  ============================================== */
typedef enum {                                  /*!< MSCM_OCMDR1_RO                                                            */
  MSCM_OCMDR1_RO_0                     = 0,     /*!< 0 : Writes to the OCMDRn[11:0] are allowed                                */
  MSCM_OCMDR1_RO_1                     = 1,     /*!< 1 : Writes to the OCMDRn[11:0] are ignored                                */
} MSCM_OCMDR1_RO_Enum;

/* ============================================  MSCM MSCM_OCMDR1 OCMW [17..19]  ============================================= */
typedef enum {                                  /*!< MSCM_OCMDR1_OCMW                                                          */
  MSCM_OCMDR1_OCMW_010                 = 2,     /*!< 010 : OCMEMn 32-bits wide                                                 */
  MSCM_OCMDR1_OCMW_011                 = 3,     /*!< 011 : OCMEMn 64-bits wide                                                 */
  MSCM_OCMDR1_OCMW_100                 = 4,     /*!< 100 : OCMEMn 128-bits wide                                                */
  MSCM_OCMDR1_OCMW_101                 = 5,     /*!< 101 : OCMEMn 256-bits wide                                                */
} MSCM_OCMDR1_OCMW_Enum;

/* ============================================  MSCM MSCM_OCMDR1 OCMSZ [24..27]  ============================================ */
typedef enum {                                  /*!< MSCM_OCMDR1_OCMSZ                                                         */
  MSCM_OCMDR1_OCMSZ_0000               = 0,     /*!< 0000 : no OCMEMn                                                          */
  MSCM_OCMDR1_OCMSZ_0001               = 1,     /*!< 0001 : 1KB OCMEMn                                                         */
  MSCM_OCMDR1_OCMSZ_0010               = 2,     /*!< 0010 : 2KB OCMEMn                                                         */
  MSCM_OCMDR1_OCMSZ_0011               = 3,     /*!< 0011 : 4KB OCMEMn                                                         */
  MSCM_OCMDR1_OCMSZ_0100               = 4,     /*!< 0100 : 8KB OCMEMn                                                         */
  MSCM_OCMDR1_OCMSZ_0101               = 5,     /*!< 0101 : 16KB OCMEMn                                                        */
  MSCM_OCMDR1_OCMSZ_0110               = 6,     /*!< 0110 : 32KB OCMEMn                                                        */
  MSCM_OCMDR1_OCMSZ_0111               = 7,     /*!< 0111 : 64KB OCMEMn                                                        */
  MSCM_OCMDR1_OCMSZ_1000               = 8,     /*!< 1000 : 128KB OCMEMn                                                       */
  MSCM_OCMDR1_OCMSZ_1001               = 9,     /*!< 1001 : 256KB OCMEMn                                                       */
  MSCM_OCMDR1_OCMSZ_1010               = 10,    /*!< 1010 : 512KB OCMEMn                                                       */
  MSCM_OCMDR1_OCMSZ_1011               = 11,    /*!< 1011 : 1MB OCMEMn                                                         */
  MSCM_OCMDR1_OCMSZ_1100               = 12,    /*!< 1100 : 2MB OCMEMn                                                         */
  MSCM_OCMDR1_OCMSZ_1101               = 13,    /*!< 1101 : 4MB OCMEMn                                                         */
  MSCM_OCMDR1_OCMSZ_1110               = 14,    /*!< 1110 : 8MB OCMEMn                                                         */
  MSCM_OCMDR1_OCMSZ_1111               = 15,    /*!< 1111 : 16MB OCMEMn                                                        */
} MSCM_OCMDR1_OCMSZ_Enum;

/* ===========================================  MSCM MSCM_OCMDR1 OCMSZH [28..28]  ============================================ */
typedef enum {                                  /*!< MSCM_OCMDR1_OCMSZH                                                        */
  MSCM_OCMDR1_OCMSZH_0                 = 0,     /*!< 0 : OCMEMn is a power-of-2 capacity.                                      */
  MSCM_OCMDR1_OCMSZH_1                 = 1,     /*!< 1 : OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.          */
} MSCM_OCMDR1_OCMSZH_Enum;

