nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  DMA DMA_EEI EEI11 [11..11]  =============================================== */
typedef enum {                                  /*!< DMA_EEI_EEI11                                                             */
  DMA_EEI_EEI11_0                      = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI11_1                      = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI11_Enum;

/* ==============================================  DMA DMA_EEI EEI12 [12..12]  =============================================== */
typedef enum {                                  /*!< DMA_EEI_EEI12                                                             */
  DMA_EEI_EEI12_0                      = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI12_1                      = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI12_Enum;

/* ==============================================  DMA DMA_EEI EEI13 [13..13]  =============================================== */
typedef enum {                                  /*!< DMA_EEI_EEI13                                                             */
  DMA_EEI_EEI13_0                      = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI13_1                      = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI13_Enum;

/* ==============================================  DMA DMA_EEI EEI14 [14..14]  =============================================== */
typedef enum {                                  /*!< DMA_EEI_EEI14                                                             */
  DMA_EEI_EEI14_0                      = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI14_1                      = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI14_Enum;

/* ==============================================  DMA DMA_EEI EEI15 [15..15]  =============================================== */
typedef enum {                                  /*!< DMA_EEI_EEI15                                                             */
  DMA_EEI_EEI15_0                      = 0,     /*!< 0 : The error signal for corresponding channel does not generate
                                                     an error interrupt                                                        */
  DMA_EEI_EEI15_1                      = 1,     /*!< 1 : The assertion of the error signal for corresponding channel
                                                     generates an error interrupt request                                      */
} DMA_EEI_EEI15_Enum;

/* =======================================================  DMA_CEEI  ======================================================== */
/* ================================================  DMA DMA_CEEI NOP [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_CEEI_NOP                                                              */
  DMA_CEEI_NOP_0                       = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CEEI_NOP_1                       = 1,     /*!< 1 : No operation, ignore the other bits in this register                  */
} DMA_CEEI_NOP_Enum;

/* =======================================================  DMA_SEEI  ======================================================== */
/* ================================================  DMA DMA_SEEI NOP [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_SEEI_NOP                                                              */
  DMA_SEEI_NOP_0                       = 0,     /*!< 0 : Normal operation                                                      */
  DMA_SEEI_NOP_1                       = 1,     /*!< 1 : No operation, ignore the other bits in this register                  */
} DMA_SEEI_NOP_Enum;

/* =======================================================  DMA_CERQ  ======================================================== */
/* ================================================  DMA DMA_CERQ NOP [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_CERQ_NOP                                                              */
  DMA_CERQ_NOP_0                       = 0,     /*!< 0 : Normal operation                                                      */
  DMA_CERQ_NOP_1                       = 1,     /*!< 1 : No operation, ignore the other bits in this register                  */
} DMA_CERQ_NOP_Enum;

/* =======================================================  DMA_SERQ  ======================================================== */
/* ================================================  DMA DMA_SERQ NOP [7..7]  ================================================ */
typedef enum {                                  /*!< DMA_SERQ_NOP                                                              */
  DMA_SERQ_NOP_0                       = 0,     /*!< 0 : Normal operation                                                      */
  DMA_SERQ_NOP_1                       = 1,     /*!< 1 : No operation, ignore the other bits in this register                  */
} DMA_SERQ_NOP_Enum;

/* =======================================================  DMA_CDNE  ======================================================== */
/* ===============================================  DMA DMA_CDNE CADN [6..6]  ================================================ */
typedef enum {                                  /*!< DMA_CDNE_CADN                                                             */
  DMA_CDNE_CADN_0                      = 0,     /*!< 0 : Clears only the TCDn_CSR[DONE] bit specified in the CDNE
                                                     field                                                                     */
  DMA_CDNE_CADN_1                      = 1,     /*!< 1 : Clears all bits in TCDn_CSR[DONE]                                     */
} DMA_CDNE_CADN_Enum;

