nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  DMA DMA_DCHPRI0 ECP [7..7]  =============================================== */
typedef enum {                                  /*!< DMA_DCHPRI0_ECP                                                           */
  DMA_DCHPRI0_ECP_0                    = 0,     /*!< 0 : Channel n cannot be suspended by a higher priority channels
                                                     service request.                                                          */
  DMA_DCHPRI0_ECP_1                    = 1,     /*!< 1 : Channel n can be temporarily suspended by the service request
                                                     of a higher priority channel.                                             */
} DMA_DCHPRI0_ECP_Enum;

/* ====================================================  DMA_TCD0_SADDR  ===================================================== */
/* =====================================================  DMA_TCD0_SOFF  ===================================================== */
/* =====================================================  DMA_TCD0_ATTR  ===================================================== */
/* ============================================  DMA DMA_TCD0_ATTR SSIZE [8..10]  ============================================ */
typedef enum {                                  /*!< DMA_TCD0_ATTR_SSIZE                                                       */
  DMA_TCD0_ATTR_SSIZE_0                = 0,     /*!< 0 : 8-bit                                                                 */
  DMA_TCD0_ATTR_SSIZE_1                = 1,     /*!< 1 : 16-bit                                                                */
  DMA_TCD0_ATTR_SSIZE_10               = 2,     /*!< 10 : 32-bit                                                               */
} DMA_TCD0_ATTR_SSIZE_Enum;

/* ============================================  DMA DMA_TCD0_ATTR SMOD [11..15]  ============================================ */
typedef enum {                                  /*!< DMA_TCD0_ATTR_SMOD                                                        */
  DMA_TCD0_ATTR_SMOD_0                 = 0,     /*!< 0 : Source address modulo feature is disabled                             */
} DMA_TCD0_ATTR_SMOD_Enum;

/* ===============================================  DMA_TCD0_NBYTES_MLNO_DMA  ================================================ */
/* ==============================================  DMA_TCD0_NBYTES_MLOFFNO_DMA  ============================================== */
/* ====================================  DMA DMA_TCD0_NBYTES_MLOFFNO_DMA DMLOE [30..30]  ===================================== */
typedef enum {                                  /*!< DMA_TCD0_NBYTES_MLOFFNO_DMA_DMLOE                                         */
  DMA_TCD0_NBYTES_MLOFFNO_DMA_DMLOE_0  = 0,     /*!< 0 : The minor loop offset is not applied to the DADDR                     */
  DMA_TCD0_NBYTES_MLOFFNO_DMA_DMLOE_1  = 1,     /*!< 1 : The minor loop offset is applied to the DADDR                         */
} DMA_TCD0_NBYTES_MLOFFNO_DMA_DMLOE_Enum;

/* ====================================  DMA DMA_TCD0_NBYTES_MLOFFNO_DMA SMLOE [31..31]  ===================================== */
typedef enum {                                  /*!< DMA_TCD0_NBYTES_MLOFFNO_DMA_SMLOE                                         */
  DMA_TCD0_NBYTES_MLOFFNO_DMA_SMLOE_0  = 0,     /*!< 0 : The minor loop offset is not applied to the SADDR                     */
  DMA_TCD0_NBYTES_MLOFFNO_DMA_SMLOE_1  = 1,     /*!< 1 : The minor loop offset is applied to the SADDR                         */
} DMA_TCD0_NBYTES_MLOFFNO_DMA_SMLOE_Enum;

/* =============================================  DMA_TCD0_NBYTES_MLOFFYES_DMA  ============================================== */
/* ====================================  DMA DMA_TCD0_NBYTES_MLOFFYES_DMA DMLOE [30..30]  ==================================== */
typedef enum {                                  /*!< DMA_TCD0_NBYTES_MLOFFYES_DMA_DMLOE                                        */
  DMA_TCD0_NBYTES_MLOFFYES_DMA_DMLOE_0 = 0,     /*!< 0 : The minor loop offset is not applied to the DADDR                     */
  DMA_TCD0_NBYTES_MLOFFYES_DMA_DMLOE_1 = 1,     /*!< 1 : The minor loop offset is applied to the DADDR                         */
} DMA_TCD0_NBYTES_MLOFFYES_DMA_DMLOE_Enum;

/* ====================================  DMA DMA_TCD0_NBYTES_MLOFFYES_DMA SMLOE [31..31]  ==================================== */
typedef enum {                                  /*!< DMA_TCD0_NBYTES_MLOFFYES_DMA_SMLOE                                        */
  DMA_TCD0_NBYTES_MLOFFYES_DMA_SMLOE_0 = 0,     /*!< 0 : The minor loop offset is not applied to the SADDR                     */
  DMA_TCD0_NBYTES_MLOFFYES_DMA_SMLOE_1 = 1,     /*!< 1 : The minor loop offset is applied to the SADDR                         */
} DMA_TCD0_NBYTES_MLOFFYES_DMA_SMLOE_Enum;

/* ====================================================  DMA_TCD0_SLAST  ===================================================== */
/* ====================================================  DMA_TCD0_DADDR  ===================================================== */
/* =====================================================  DMA_TCD0_DOFF  ===================================================== */
/* ==============================================  DMA_TCD0_CITER_ELINKNO_DMA  =============================================== */
/* =====================================  DMA DMA_TCD0_CITER_ELINKNO_DMA ELINK [15..15]  ===================================== */
typedef enum {                                  /*!< DMA_TCD0_CITER_ELINKNO_DMA_ELINK                                          */
  DMA_TCD0_CITER_ELINKNO_DMA_ELINK_0   = 0,     /*!< 0 : The channel-to-channel linking is disabled                            */
  DMA_TCD0_CITER_ELINKNO_DMA_ELINK_1   = 1,     /*!< 1 : The channel-to-channel linking is enabled                             */
} DMA_TCD0_CITER_ELINKNO_DMA_ELINK_Enum;

/* ==============================================  DMA_TCD0_CITER_ELINKYES_DMA  ============================================== */
/* ====================================  DMA DMA_TCD0_CITER_ELINKYES_DMA ELINK [15..15]  ===================================== */
typedef enum {                                  /*!< DMA_TCD0_CITER_ELINKYES_DMA_ELINK                                         */
  DMA_TCD0_CITER_ELINKYES_DMA_ELINK_0  = 0,     /*!< 0 : The channel-to-channel linking is disabled                            */
  DMA_TCD0_CITER_ELINKYES_DMA_ELINK_1  = 1,     /*!< 1 : The channel-to-channel linking is enabled                             */
} DMA_TCD0_CITER_ELINKYES_DMA_ELINK_Enum;

/* ===================================================  DMA_TCD0_DLASTSGA  =================================================== */
/* =====================================================  DMA_TCD0_CSR  ====================================================== */
/* =============================================  DMA DMA_TCD0_CSR START [0..0]  ============================================= */
typedef enum {                                  /*!< DMA_TCD0_CSR_START                                                        */
  DMA_TCD0_CSR_START_0                 = 0,     /*!< 0 : The channel is not explicitly started.                                */
  DMA_TCD0_CSR_START_1                 = 1,     /*!< 1 : The channel is explicitly started via a software initiated
                                                     service request.                                                          */
} DMA_TCD0_CSR_START_Enum;

/* ===========================================  DMA DMA_TCD0_CSR INTMAJOR [1..1]  ============================================ */
typedef enum {                                  /*!< DMA_TCD0_CSR_INTMAJOR                                                     */
  DMA_TCD0_CSR_INTMAJOR_0              = 0,     /*!< 0 : The end-of-major loop interrupt is disabled.                          */
  DMA_TCD0_CSR_INTMAJOR_1              = 1,     /*!< 1 : The end-of-major loop interrupt is enabled.                           */
} DMA_TCD0_CSR_INTMAJOR_Enum;

/* ============================================  DMA DMA_TCD0_CSR INTHALF [2..2]  ============================================ */
typedef enum {                                  /*!< DMA_TCD0_CSR_INTHALF                                                      */
  DMA_TCD0_CSR_INTHALF_0               = 0,     /*!< 0 : The half-point interrupt is disabled.                                 */
  DMA_TCD0_CSR_INTHALF_1               = 1,     /*!< 1 : The half-point interrupt is enabled.                                  */
} DMA_TCD0_CSR_INTHALF_Enum;

/* ==============================================  DMA DMA_TCD0_CSR ESG [4..4]  ============================================== */
typedef enum {                                  /*!< DMA_TCD0_CSR_ESG                                                          */
  DMA_TCD0_CSR_ESG_0                   = 0,     /*!< 0 : The current channels TCD is normal format.                            */
  DMA_TCD0_CSR_ESG_1                   = 1,     /*!< 1 : The current channels TCD specifies a scatter gather format.
                                                     The DLASTSGA field provides a memory pointer to the next
                                                     TCD to be loaded into this channel after the major loop
                                                     completes its execution.                                                  */
} DMA_TCD0_CSR_ESG_Enum;

