nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  DMA DMA_TCD0_CSR MAJORELINK [5..5]  =========================================== */
typedef enum {                                  /*!< DMA_TCD0_CSR_MAJORELINK                                                   */
  DMA_TCD0_CSR_MAJORELINK_0            = 0,     /*!< 0 : The channel-to-channel linking is disabled.                           */
  DMA_TCD0_CSR_MAJORELINK_1            = 1,     /*!< 1 : The channel-to-channel linking is enabled.                            */
} DMA_TCD0_CSR_MAJORELINK_Enum;

/* =============================================  DMA DMA_TCD0_CSR BWC [14..15]  ============================================= */
typedef enum {                                  /*!< DMA_TCD0_CSR_BWC                                                          */
  DMA_TCD0_CSR_BWC_0                   = 0,     /*!< 0 : No eDMA engine stalls.                                                */
  DMA_TCD0_CSR_BWC_10                  = 2,     /*!< 10 : eDMA engine stalls for 4 cycles after each R/W.                      */
  DMA_TCD0_CSR_BWC_11                  = 3,     /*!< 11 : eDMA engine stalls for 8 cycles after each R/W.                      */
} DMA_TCD0_CSR_BWC_Enum;

/* ==============================================  DMA_TCD0_BITER_ELINKNO_DMA  =============================================== */
/* =====================================  DMA DMA_TCD0_BITER_ELINKNO_DMA ELINK [15..15]  ===================================== */
typedef enum {                                  /*!< DMA_TCD0_BITER_ELINKNO_DMA_ELINK                                          */
  DMA_TCD0_BITER_ELINKNO_DMA_ELINK_0   = 0,     /*!< 0 : The channel-to-channel linking is disabled                            */
  DMA_TCD0_BITER_ELINKNO_DMA_ELINK_1   = 1,     /*!< 1 : The channel-to-channel linking is enabled                             */
} DMA_TCD0_BITER_ELINKNO_DMA_ELINK_Enum;

/* ==============================================  DMA_TCD0_BITER_ELINKYES_DMA  ============================================== */
/* ====================================  DMA DMA_TCD0_BITER_ELINKYES_DMA ELINK [15..15]  ===================================== */
typedef enum {                                  /*!< DMA_TCD0_BITER_ELINKYES_DMA_ELINK                                         */
  DMA_TCD0_BITER_ELINKYES_DMA_ELINK_0  = 0,     /*!< 0 : The channel-to-channel linking is disabled                            */
  DMA_TCD0_BITER_ELINKYES_DMA_ELINK_1  = 1,     /*!< 1 : The channel-to-channel linking is enabled                             */
} DMA_TCD0_BITER_ELINKYES_DMA_ELINK_Enum;

/* ====================================================  DMA_TCD1_SADDR  ===================================================== */
/* =====================================================  DMA_TCD1_SOFF  ===================================================== */
/* =====================================================  DMA_TCD1_ATTR  ===================================================== */
/* ============================================  DMA DMA_TCD1_ATTR SSIZE [8..10]  ============================================ */
typedef enum {                                  /*!< DMA_TCD1_ATTR_SSIZE                                                       */
  DMA_TCD1_ATTR_SSIZE_0                = 0,     /*!< 0 : 8-bit                                                                 */
  DMA_TCD1_ATTR_SSIZE_1                = 1,     /*!< 1 : 16-bit                                                                */
  DMA_TCD1_ATTR_SSIZE_10               = 2,     /*!< 10 : 32-bit                                                               */
} DMA_TCD1_ATTR_SSIZE_Enum;

/* ============================================  DMA DMA_TCD1_ATTR SMOD [11..15]  ============================================ */
typedef enum {                                  /*!< DMA_TCD1_ATTR_SMOD                                                        */
  DMA_TCD1_ATTR_SMOD_0                 = 0,     /*!< 0 : Source address modulo feature is disabled                             */
} DMA_TCD1_ATTR_SMOD_Enum;

/* ===============================================  DMA_TCD1_NBYTES_MLNO_DMA  ================================================ */
/* ==============================================  DMA_TCD1_NBYTES_MLOFFNO_DMA  ============================================== */
/* ====================================  DMA DMA_TCD1_NBYTES_MLOFFNO_DMA DMLOE [30..30]  ===================================== */
typedef enum {                                  /*!< DMA_TCD1_NBYTES_MLOFFNO_DMA_DMLOE                                         */
  DMA_TCD1_NBYTES_MLOFFNO_DMA_DMLOE_0  = 0,     /*!< 0 : The minor loop offset is not applied to the DADDR                     */
  DMA_TCD1_NBYTES_MLOFFNO_DMA_DMLOE_1  = 1,     /*!< 1 : The minor loop offset is applied to the DADDR                         */
} DMA_TCD1_NBYTES_MLOFFNO_DMA_DMLOE_Enum;

/* ====================================  DMA DMA_TCD1_NBYTES_MLOFFNO_DMA SMLOE [31..31]  ===================================== */
typedef enum {                                  /*!< DMA_TCD1_NBYTES_MLOFFNO_DMA_SMLOE                                         */
  DMA_TCD1_NBYTES_MLOFFNO_DMA_SMLOE_0  = 0,     /*!< 0 : The minor loop offset is not applied to the SADDR                     */
  DMA_TCD1_NBYTES_MLOFFNO_DMA_SMLOE_1  = 1,     /*!< 1 : The minor loop offset is applied to the SADDR                         */
} DMA_TCD1_NBYTES_MLOFFNO_DMA_SMLOE_Enum;

/* =============================================  DMA_TCD1_NBYTES_MLOFFYES_DMA  ============================================== */
/* ====================================  DMA DMA_TCD1_NBYTES_MLOFFYES_DMA DMLOE [30..30]  ==================================== */
typedef enum {                                  /*!< DMA_TCD1_NBYTES_MLOFFYES_DMA_DMLOE                                        */
  DMA_TCD1_NBYTES_MLOFFYES_DMA_DMLOE_0 = 0,     /*!< 0 : The minor loop offset is not applied to the DADDR                     */
  DMA_TCD1_NBYTES_MLOFFYES_DMA_DMLOE_1 = 1,     /*!< 1 : The minor loop offset is applied to the DADDR                         */
} DMA_TCD1_NBYTES_MLOFFYES_DMA_DMLOE_Enum;

/* ====================================  DMA DMA_TCD1_NBYTES_MLOFFYES_DMA SMLOE [31..31]  ==================================== */
typedef enum {                                  /*!< DMA_TCD1_NBYTES_MLOFFYES_DMA_SMLOE                                        */
  DMA_TCD1_NBYTES_MLOFFYES_DMA_SMLOE_0 = 0,     /*!< 0 : The minor loop offset is not applied to the SADDR                     */
  DMA_TCD1_NBYTES_MLOFFYES_DMA_SMLOE_1 = 1,     /*!< 1 : The minor loop offset is applied to the SADDR                         */
} DMA_TCD1_NBYTES_MLOFFYES_DMA_SMLOE_Enum;

/* ====================================================  DMA_TCD1_SLAST  ===================================================== */
/* ====================================================  DMA_TCD1_DADDR  ===================================================== */
/* =====================================================  DMA_TCD1_DOFF  ===================================================== */
/* ==============================================  DMA_TCD1_CITER_ELINKNO_DMA  =============================================== */
/* =====================================  DMA DMA_TCD1_CITER_ELINKNO_DMA ELINK [15..15]  ===================================== */
typedef enum {                                  /*!< DMA_TCD1_CITER_ELINKNO_DMA_ELINK                                          */
  DMA_TCD1_CITER_ELINKNO_DMA_ELINK_0   = 0,     /*!< 0 : The channel-to-channel linking is disabled                            */
  DMA_TCD1_CITER_ELINKNO_DMA_ELINK_1   = 1,     /*!< 1 : The channel-to-channel linking is enabled                             */
} DMA_TCD1_CITER_ELINKNO_DMA_ELINK_Enum;

