nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  DMA_TCD1_CITER_ELINKYES_DMA  ============================================== */
/* ====================================  DMA DMA_TCD1_CITER_ELINKYES_DMA ELINK [15..15]  ===================================== */
typedef enum {                                  /*!< DMA_TCD1_CITER_ELINKYES_DMA_ELINK                                         */
  DMA_TCD1_CITER_ELINKYES_DMA_ELINK_0  = 0,     /*!< 0 : The channel-to-channel linking is disabled                            */
  DMA_TCD1_CITER_ELINKYES_DMA_ELINK_1  = 1,     /*!< 1 : The channel-to-channel linking is enabled                             */
} DMA_TCD1_CITER_ELINKYES_DMA_ELINK_Enum;

/* ===================================================  DMA_TCD1_DLASTSGA  =================================================== */
/* =====================================================  DMA_TCD1_CSR  ====================================================== */
/* =============================================  DMA DMA_TCD1_CSR START [0..0]  ============================================= */
typedef enum {                                  /*!< DMA_TCD1_CSR_START                                                        */
  DMA_TCD1_CSR_START_0                 = 0,     /*!< 0 : The channel is not explicitly started.                                */
  DMA_TCD1_CSR_START_1                 = 1,     /*!< 1 : The channel is explicitly started via a software initiated
                                                     service request.                                                          */
} DMA_TCD1_CSR_START_Enum;

/* ===========================================  DMA DMA_TCD1_CSR INTMAJOR [1..1]  ============================================ */
typedef enum {                                  /*!< DMA_TCD1_CSR_INTMAJOR                                                     */
  DMA_TCD1_CSR_INTMAJOR_0              = 0,     /*!< 0 : The end-of-major loop interrupt is disabled.                          */
  DMA_TCD1_CSR_INTMAJOR_1              = 1,     /*!< 1 : The end-of-major loop interrupt is enabled.                           */
} DMA_TCD1_CSR_INTMAJOR_Enum;

/* ============================================  DMA DMA_TCD1_CSR INTHALF [2..2]  ============================================ */
typedef enum {                                  /*!< DMA_TCD1_CSR_INTHALF                                                      */
  DMA_TCD1_CSR_INTHALF_0               = 0,     /*!< 0 : The half-point interrupt is disabled.                                 */
  DMA_TCD1_CSR_INTHALF_1               = 1,     /*!< 1 : The half-point interrupt is enabled.                                  */
} DMA_TCD1_CSR_INTHALF_Enum;

/* ==============================================  DMA DMA_TCD1_CSR ESG [4..4]  ============================================== */
typedef enum {                                  /*!< DMA_TCD1_CSR_ESG                                                          */
  DMA_TCD1_CSR_ESG_0                   = 0,     /*!< 0 : The current channels TCD is normal format.                            */
  DMA_TCD1_CSR_ESG_1                   = 1,     /*!< 1 : The current channels TCD specifies a scatter gather format.
                                                     The DLASTSGA field provides a memory pointer to the next
                                                     TCD to be loaded into this channel after the major loop
                                                     completes its execution.                                                  */
} DMA_TCD1_CSR_ESG_Enum;

/* ==========================================  DMA DMA_TCD1_CSR MAJORELINK [5..5]  =========================================== */
typedef enum {                                  /*!< DMA_TCD1_CSR_MAJORELINK                                                   */
  DMA_TCD1_CSR_MAJORELINK_0            = 0,     /*!< 0 : The channel-to-channel linking is disabled.                           */
  DMA_TCD1_CSR_MAJORELINK_1            = 1,     /*!< 1 : The channel-to-channel linking is enabled.                            */
} DMA_TCD1_CSR_MAJORELINK_Enum;

/* =============================================  DMA DMA_TCD1_CSR BWC [14..15]  ============================================= */
typedef enum {                                  /*!< DMA_TCD1_CSR_BWC                                                          */
  DMA_TCD1_CSR_BWC_0                   = 0,     /*!< 0 : No eDMA engine stalls.                                                */
  DMA_TCD1_CSR_BWC_10                  = 2,     /*!< 10 : eDMA engine stalls for 4 cycles after each R/W.                      */
  DMA_TCD1_CSR_BWC_11                  = 3,     /*!< 11 : eDMA engine stalls for 8 cycles after each R/W.                      */
} DMA_TCD1_CSR_BWC_Enum;

/* ==============================================  DMA_TCD1_BITER_ELINKNO_DMA  =============================================== */
/* =====================================  DMA DMA_TCD1_BITER_ELINKNO_DMA ELINK [15..15]  ===================================== */
typedef enum {                                  /*!< DMA_TCD1_BITER_ELINKNO_DMA_ELINK                                          */
  DMA_TCD1_BITER_ELINKNO_DMA_ELINK_0   = 0,     /*!< 0 : The channel-to-channel linking is disabled                            */
  DMA_TCD1_BITER_ELINKNO_DMA_ELINK_1   = 1,     /*!< 1 : The channel-to-channel linking is enabled                             */
} DMA_TCD1_BITER_ELINKNO_DMA_ELINK_Enum;

/* ==============================================  DMA_TCD1_BITER_ELINKYES_DMA  ============================================== */
/* ====================================  DMA DMA_TCD1_BITER_ELINKYES_DMA ELINK [15..15]  ===================================== */
typedef enum {                                  /*!< DMA_TCD1_BITER_ELINKYES_DMA_ELINK                                         */
  DMA_TCD1_BITER_ELINKYES_DMA_ELINK_0  = 0,     /*!< 0 : The channel-to-channel linking is disabled                            */
  DMA_TCD1_BITER_ELINKYES_DMA_ELINK_1  = 1,     /*!< 1 : The channel-to-channel linking is enabled                             */
} DMA_TCD1_BITER_ELINKYES_DMA_ELINK_Enum;

/* ====================================================  DMA_TCD2_SADDR  ===================================================== */
/* =====================================================  DMA_TCD2_SOFF  ===================================================== */
/* =====================================================  DMA_TCD2_ATTR  ===================================================== */
/* ============================================  DMA DMA_TCD2_ATTR SSIZE [8..10]  ============================================ */
typedef enum {                                  /*!< DMA_TCD2_ATTR_SSIZE                                                       */
  DMA_TCD2_ATTR_SSIZE_0                = 0,     /*!< 0 : 8-bit                                                                 */
  DMA_TCD2_ATTR_SSIZE_1                = 1,     /*!< 1 : 16-bit                                                                */
  DMA_TCD2_ATTR_SSIZE_10               = 2,     /*!< 10 : 32-bit                                                               */
} DMA_TCD2_ATTR_SSIZE_Enum;

/* ============================================  DMA DMA_TCD2_ATTR SMOD [11..15]  ============================================ */
typedef enum {                                  /*!< DMA_TCD2_ATTR_SMOD                                                        */
  DMA_TCD2_ATTR_SMOD_0                 = 0,     /*!< 0 : Source address modulo feature is disabled                             */
} DMA_TCD2_ATTR_SMOD_Enum;

