nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =======================================================  MPU_CESR  ======================================================== */
/* ================================================  MPU MPU_CESR VLD [0..0]  ================================================ */
typedef enum {                                  /*!< MPU_CESR_VLD                                                              */
  MPU_CESR_VLD_0                       = 0,     /*!< 0 : MPU is disabled. All accesses from all bus masters are allowed.       */
  MPU_CESR_VLD_1                       = 1,     /*!< 1 : MPU is enabled                                                        */
} MPU_CESR_VLD_Enum;

/* ===============================================  MPU MPU_CESR NRGD [8..11]  =============================================== */
typedef enum {                                  /*!< MPU_CESR_NRGD                                                             */
  MPU_CESR_NRGD_0000                   = 0,     /*!< 0000 : 8 region descriptors                                               */
  MPU_CESR_NRGD_0001                   = 1,     /*!< 0001 : 12 region descriptors                                              */
  MPU_CESR_NRGD_0010                   = 2,     /*!< 0010 : 16 region descriptors                                              */
} MPU_CESR_NRGD_Enum;

/* =============================================  MPU MPU_CESR SPERR1 [30..30]  ============================================== */
typedef enum {                                  /*!< MPU_CESR_SPERR1                                                           */
  MPU_CESR_SPERR1_0                    = 0,     /*!< 0 : No error has occurred for slave port 1.                               */
  MPU_CESR_SPERR1_1                    = 1,     /*!< 1 : An error has occurred for slave port 1.                               */
} MPU_CESR_SPERR1_Enum;

/* =============================================  MPU MPU_CESR SPERR0 [31..31]  ============================================== */
typedef enum {                                  /*!< MPU_CESR_SPERR0                                                           */
  MPU_CESR_SPERR0_0                    = 0,     /*!< 0 : No error has occurred for slave port 0.                               */
  MPU_CESR_SPERR0_1                    = 1,     /*!< 1 : An error has occurred for slave port 0.                               */
} MPU_CESR_SPERR0_Enum;

/* =======================================================  MPU_EAR0  ======================================================== */
/* =======================================================  MPU_EDR0  ======================================================== */
/* ================================================  MPU MPU_EDR0 ERW [0..0]  ================================================ */
typedef enum {                                  /*!< MPU_EDR0_ERW                                                              */
  MPU_EDR0_ERW_0                       = 0,     /*!< 0 : Read                                                                  */
  MPU_EDR0_ERW_1                       = 1,     /*!< 1 : Write                                                                 */
} MPU_EDR0_ERW_Enum;

/* ===============================================  MPU MPU_EDR0 EATTR [1..3]  =============================================== */
typedef enum {                                  /*!< MPU_EDR0_EATTR                                                            */
  MPU_EDR0_EATTR_000                   = 0,     /*!< 000 : User mode, instruction access                                       */
  MPU_EDR0_EATTR_001                   = 1,     /*!< 001 : User mode, data access                                              */
  MPU_EDR0_EATTR_010                   = 2,     /*!< 010 : Supervisor mode, instruction access                                 */
  MPU_EDR0_EATTR_011                   = 3,     /*!< 011 : Supervisor mode, data access                                        */
} MPU_EDR0_EATTR_Enum;

/* =======================================================  MPU_EAR1  ======================================================== */
/* =======================================================  MPU_EDR1  ======================================================== */
/* ================================================  MPU MPU_EDR1 ERW [0..0]  ================================================ */
typedef enum {                                  /*!< MPU_EDR1_ERW                                                              */
  MPU_EDR1_ERW_0                       = 0,     /*!< 0 : Read                                                                  */
  MPU_EDR1_ERW_1                       = 1,     /*!< 1 : Write                                                                 */
} MPU_EDR1_ERW_Enum;

/* ===============================================  MPU MPU_EDR1 EATTR [1..3]  =============================================== */
typedef enum {                                  /*!< MPU_EDR1_EATTR                                                            */
  MPU_EDR1_EATTR_000                   = 0,     /*!< 000 : User mode, instruction access                                       */
  MPU_EDR1_EATTR_001                   = 1,     /*!< 001 : User mode, data access                                              */
  MPU_EDR1_EATTR_010                   = 2,     /*!< 010 : Supervisor mode, instruction access                                 */
  MPU_EDR1_EATTR_011                   = 3,     /*!< 011 : Supervisor mode, data access                                        */
} MPU_EDR1_EATTR_Enum;

/* ====================================================  MPU_RGD0_WORD0  ===================================================== */
/* ====================================================  MPU_RGD0_WORD1  ===================================================== */
/* ====================================================  MPU_RGD0_WORD2  ===================================================== */
/* ============================================  MPU MPU_RGD0_WORD2 M0SM [3..4]  ============================================= */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M0SM                                                       */
  MPU_RGD0_WORD2_M0SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD0_WORD2_M0SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD0_WORD2_M0SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD0_WORD2_M0SM_11               = 3,     /*!< 11 : Same as User mode defined in M0UM                                    */
} MPU_RGD0_WORD2_M0SM_Enum;

/* ============================================  MPU MPU_RGD0_WORD2 M0PE [5..5]  ============================================= */
typedef enum {                                  /*!< MPU_RGD0_WORD2_M0PE                                                       */
  MPU_RGD0_WORD2_M0PE_0                = 0,     /*!< 0 : Do not include the process identifier in the evaluation               */
  MPU_RGD0_WORD2_M0PE_1                = 1,     /*!< 1 : Include the process identifier and mask (RGDn.RGDAAC) in
                                                     the region hit evaluation                                                 */
} MPU_RGD0_WORD2_M0PE_Enum;

