nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  MPU MPU_RGD2_WORD2 M3SM [21..22]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M3SM                                                       */
  MPU_RGD2_WORD2_M3SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD2_WORD2_M3SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD2_WORD2_M3SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD2_WORD2_M3SM_11               = 3,     /*!< 11 : Same as User mode defined in M3UM                                    */
} MPU_RGD2_WORD2_M3SM_Enum;

/* ===========================================  MPU MPU_RGD2_WORD2 M4WE [24..24]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M4WE                                                       */
  MPU_RGD2_WORD2_M4WE_0                = 0,     /*!< 0 : Bus master 4 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD2_WORD2_M4WE_1                = 1,     /*!< 1 : Bus master 4 writes allowed                                           */
} MPU_RGD2_WORD2_M4WE_Enum;

/* ===========================================  MPU MPU_RGD2_WORD2 M4RE [25..25]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M4RE                                                       */
  MPU_RGD2_WORD2_M4RE_0                = 0,     /*!< 0 : Bus master 4 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD2_WORD2_M4RE_1                = 1,     /*!< 1 : Bus master 4 reads allowed                                            */
} MPU_RGD2_WORD2_M4RE_Enum;

/* ===========================================  MPU MPU_RGD2_WORD2 M5WE [26..26]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M5WE                                                       */
  MPU_RGD2_WORD2_M5WE_0                = 0,     /*!< 0 : Bus master 5 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD2_WORD2_M5WE_1                = 1,     /*!< 1 : Bus master 5 writes allowed                                           */
} MPU_RGD2_WORD2_M5WE_Enum;

/* ===========================================  MPU MPU_RGD2_WORD2 M5RE [27..27]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M5RE                                                       */
  MPU_RGD2_WORD2_M5RE_0                = 0,     /*!< 0 : Bus master 5 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD2_WORD2_M5RE_1                = 1,     /*!< 1 : Bus master 5 reads allowed                                            */
} MPU_RGD2_WORD2_M5RE_Enum;

/* ===========================================  MPU MPU_RGD2_WORD2 M6WE [28..28]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M6WE                                                       */
  MPU_RGD2_WORD2_M6WE_0                = 0,     /*!< 0 : Bus master 6 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD2_WORD2_M6WE_1                = 1,     /*!< 1 : Bus master 6 writes allowed                                           */
} MPU_RGD2_WORD2_M6WE_Enum;

/* ===========================================  MPU MPU_RGD2_WORD2 M6RE [29..29]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M6RE                                                       */
  MPU_RGD2_WORD2_M6RE_0                = 0,     /*!< 0 : Bus master 6 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD2_WORD2_M6RE_1                = 1,     /*!< 1 : Bus master 6 reads allowed                                            */
} MPU_RGD2_WORD2_M6RE_Enum;

/* ===========================================  MPU MPU_RGD2_WORD2 M7WE [30..30]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M7WE                                                       */
  MPU_RGD2_WORD2_M7WE_0                = 0,     /*!< 0 : Bus master 7 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGD2_WORD2_M7WE_1                = 1,     /*!< 1 : Bus master 7 writes allowed                                           */
} MPU_RGD2_WORD2_M7WE_Enum;

/* ===========================================  MPU MPU_RGD2_WORD2 M7RE [31..31]  ============================================ */
typedef enum {                                  /*!< MPU_RGD2_WORD2_M7RE                                                       */
  MPU_RGD2_WORD2_M7RE_0                = 0,     /*!< 0 : Bus master 7 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGD2_WORD2_M7RE_1                = 1,     /*!< 1 : Bus master 7 reads allowed                                            */
} MPU_RGD2_WORD2_M7RE_Enum;

/* ====================================================  MPU_RGD2_WORD3  ===================================================== */
/* =============================================  MPU MPU_RGD2_WORD3 VLD [0..0]  ============================================= */
typedef enum {                                  /*!< MPU_RGD2_WORD3_VLD                                                        */
  MPU_RGD2_WORD3_VLD_0                 = 0,     /*!< 0 : Region descriptor is invalid                                          */
  MPU_RGD2_WORD3_VLD_1                 = 1,     /*!< 1 : Region descriptor is valid                                            */
} MPU_RGD2_WORD3_VLD_Enum;

/* ====================================================  MPU_RGD3_WORD0  ===================================================== */
/* ====================================================  MPU_RGD3_WORD1  ===================================================== */
/* ====================================================  MPU_RGD3_WORD2  ===================================================== */
/* ============================================  MPU MPU_RGD3_WORD2 M0SM [3..4]  ============================================= */
typedef enum {                                  /*!< MPU_RGD3_WORD2_M0SM                                                       */
  MPU_RGD3_WORD2_M0SM_00               = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGD3_WORD2_M0SM_01               = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGD3_WORD2_M0SM_10               = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGD3_WORD2_M0SM_11               = 3,     /*!< 11 : Same as User mode defined in M0UM                                    */
} MPU_RGD3_WORD2_M0SM_Enum;

