nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  MPU MPU_RGDAAC0 M4RE [25..25]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC0_M4RE                                                          */
  MPU_RGDAAC0_M4RE_0                   = 0,     /*!< 0 : Bus master 4 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC0_M4RE_1                   = 1,     /*!< 1 : Bus master 4 reads allowed                                            */
} MPU_RGDAAC0_M4RE_Enum;

/* =============================================  MPU MPU_RGDAAC0 M5WE [26..26]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC0_M5WE                                                          */
  MPU_RGDAAC0_M5WE_0                   = 0,     /*!< 0 : Bus master 5 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC0_M5WE_1                   = 1,     /*!< 1 : Bus master 5 writes allowed                                           */
} MPU_RGDAAC0_M5WE_Enum;

/* =============================================  MPU MPU_RGDAAC0 M5RE [27..27]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC0_M5RE                                                          */
  MPU_RGDAAC0_M5RE_0                   = 0,     /*!< 0 : Bus master 5 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC0_M5RE_1                   = 1,     /*!< 1 : Bus master 5 reads allowed                                            */
} MPU_RGDAAC0_M5RE_Enum;

/* =============================================  MPU MPU_RGDAAC0 M6WE [28..28]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC0_M6WE                                                          */
  MPU_RGDAAC0_M6WE_0                   = 0,     /*!< 0 : Bus master 6 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC0_M6WE_1                   = 1,     /*!< 1 : Bus master 6 writes allowed                                           */
} MPU_RGDAAC0_M6WE_Enum;

/* =============================================  MPU MPU_RGDAAC0 M6RE [29..29]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC0_M6RE                                                          */
  MPU_RGDAAC0_M6RE_0                   = 0,     /*!< 0 : Bus master 6 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC0_M6RE_1                   = 1,     /*!< 1 : Bus master 6 reads allowed                                            */
} MPU_RGDAAC0_M6RE_Enum;

/* =============================================  MPU MPU_RGDAAC0 M7WE [30..30]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC0_M7WE                                                          */
  MPU_RGDAAC0_M7WE_0                   = 0,     /*!< 0 : Bus master 7 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC0_M7WE_1                   = 1,     /*!< 1 : Bus master 7 writes allowed                                           */
} MPU_RGDAAC0_M7WE_Enum;

/* =============================================  MPU MPU_RGDAAC0 M7RE [31..31]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC0_M7RE                                                          */
  MPU_RGDAAC0_M7RE_0                   = 0,     /*!< 0 : Bus master 7 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC0_M7RE_1                   = 1,     /*!< 1 : Bus master 7 reads allowed                                            */
} MPU_RGDAAC0_M7RE_Enum;

/* ======================================================  MPU_RGDAAC1  ====================================================== */
/* ==============================================  MPU MPU_RGDAAC1 M0SM [3..4]  ============================================== */
typedef enum {                                  /*!< MPU_RGDAAC1_M0SM                                                          */
  MPU_RGDAAC1_M0SM_00                  = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGDAAC1_M0SM_01                  = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGDAAC1_M0SM_10                  = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGDAAC1_M0SM_11                  = 3,     /*!< 11 : Same as User mode defined in M0UM                                    */
} MPU_RGDAAC1_M0SM_Enum;

/* ==============================================  MPU MPU_RGDAAC1 M0PE [5..5]  ============================================== */
typedef enum {                                  /*!< MPU_RGDAAC1_M0PE                                                          */
  MPU_RGDAAC1_M0PE_0                   = 0,     /*!< 0 : Do not include the process identifier in the evaluation               */
  MPU_RGDAAC1_M0PE_1                   = 1,     /*!< 1 : Include the process identifier and mask (RGDn.RGDAAC) in
                                                     the region hit evaluation                                                 */
} MPU_RGDAAC1_M0PE_Enum;

/* =============================================  MPU MPU_RGDAAC1 M1SM [9..10]  ============================================== */
typedef enum {                                  /*!< MPU_RGDAAC1_M1SM                                                          */
  MPU_RGDAAC1_M1SM_00                  = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGDAAC1_M1SM_01                  = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGDAAC1_M1SM_10                  = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGDAAC1_M1SM_11                  = 3,     /*!< 11 : Same as User mode defined in M1UM                                    */
} MPU_RGDAAC1_M1SM_Enum;

/* =============================================  MPU MPU_RGDAAC1 M2SM [15..16]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC1_M2SM                                                          */
  MPU_RGDAAC1_M2SM_00                  = 0,     /*!< 00 : r/w/x; read, write and execute allowed                               */
  MPU_RGDAAC1_M2SM_01                  = 1,     /*!< 01 : r/x; read and execute allowed, but no write                          */
  MPU_RGDAAC1_M2SM_10                  = 2,     /*!< 10 : r/w; read and write allowed, but no execute                          */
  MPU_RGDAAC1_M2SM_11                  = 3,     /*!< 11 : Same as User mode defined in M2UM                                    */
} MPU_RGDAAC1_M2SM_Enum;

