nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  MPU MPU_RGDAAC7 M4WE [24..24]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC7_M4WE                                                          */
  MPU_RGDAAC7_M4WE_0                   = 0,     /*!< 0 : Bus master 4 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC7_M4WE_1                   = 1,     /*!< 1 : Bus master 4 writes allowed                                           */
} MPU_RGDAAC7_M4WE_Enum;

/* =============================================  MPU MPU_RGDAAC7 M4RE [25..25]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC7_M4RE                                                          */
  MPU_RGDAAC7_M4RE_0                   = 0,     /*!< 0 : Bus master 4 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC7_M4RE_1                   = 1,     /*!< 1 : Bus master 4 reads allowed                                            */
} MPU_RGDAAC7_M4RE_Enum;

/* =============================================  MPU MPU_RGDAAC7 M5WE [26..26]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC7_M5WE                                                          */
  MPU_RGDAAC7_M5WE_0                   = 0,     /*!< 0 : Bus master 5 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC7_M5WE_1                   = 1,     /*!< 1 : Bus master 5 writes allowed                                           */
} MPU_RGDAAC7_M5WE_Enum;

/* =============================================  MPU MPU_RGDAAC7 M5RE [27..27]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC7_M5RE                                                          */
  MPU_RGDAAC7_M5RE_0                   = 0,     /*!< 0 : Bus master 5 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC7_M5RE_1                   = 1,     /*!< 1 : Bus master 5 reads allowed                                            */
} MPU_RGDAAC7_M5RE_Enum;

/* =============================================  MPU MPU_RGDAAC7 M6WE [28..28]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC7_M6WE                                                          */
  MPU_RGDAAC7_M6WE_0                   = 0,     /*!< 0 : Bus master 6 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC7_M6WE_1                   = 1,     /*!< 1 : Bus master 6 writes allowed                                           */
} MPU_RGDAAC7_M6WE_Enum;

/* =============================================  MPU MPU_RGDAAC7 M6RE [29..29]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC7_M6RE                                                          */
  MPU_RGDAAC7_M6RE_0                   = 0,     /*!< 0 : Bus master 6 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC7_M6RE_1                   = 1,     /*!< 1 : Bus master 6 reads allowed                                            */
} MPU_RGDAAC7_M6RE_Enum;

/* =============================================  MPU MPU_RGDAAC7 M7WE [30..30]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC7_M7WE                                                          */
  MPU_RGDAAC7_M7WE_0                   = 0,     /*!< 0 : Bus master 7 writes terminate with an access error and the
                                                     write is not performed                                                    */
  MPU_RGDAAC7_M7WE_1                   = 1,     /*!< 1 : Bus master 7 writes allowed                                           */
} MPU_RGDAAC7_M7WE_Enum;

/* =============================================  MPU MPU_RGDAAC7 M7RE [31..31]  ============================================= */
typedef enum {                                  /*!< MPU_RGDAAC7_M7RE                                                          */
  MPU_RGDAAC7_M7RE_0                   = 0,     /*!< 0 : Bus master 7 reads terminate with an access error and the
                                                     read is not performed                                                     */
  MPU_RGDAAC7_M7RE_1                   = 1,     /*!< 1 : Bus master 7 reads allowed                                            */
} MPU_RGDAAC7_M7RE_Enum;



/* =========================================================================================================================== */
/* ================                                            ERM                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  ERM_CR0  ======================================================== */
/* ==============================================  ERM ERM_CR0 ENCIE0 [30..30]  ============================================== */
typedef enum {                                  /*!< ERM_CR0_ENCIE0                                                            */
  ERM_CR0_ENCIE0_0                     = 0,     /*!< 0 : Interrupt notification of Memory 0 non-correctable error
                                                     events is disabled.                                                       */
  ERM_CR0_ENCIE0_1                     = 1,     /*!< 1 : Interrupt notification of Memory 0 non-correctable error
                                                     events is enabled.                                                        */
} ERM_CR0_ENCIE0_Enum;

