nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  ERM ERM_CR0 ESCIE0 [31..31]  ============================================== */
typedef enum {                                  /*!< ERM_CR0_ESCIE0                                                            */
  ERM_CR0_ESCIE0_0                     = 0,     /*!< 0 : Interrupt notification of Memory 0 single-bit correction
                                                     events is disabled.                                                       */
  ERM_CR0_ESCIE0_1                     = 1,     /*!< 1 : Interrupt notification of Memory 0 single-bit correction
                                                     events is enabled.                                                        */
} ERM_CR0_ESCIE0_Enum;

/* ========================================================  ERM_SR0  ======================================================== */
/* ===============================================  ERM ERM_SR0 NCE0 [30..30]  =============================================== */
typedef enum {                                  /*!< ERM_SR0_NCE0                                                              */
  ERM_SR0_NCE0_0                       = 0,     /*!< 0 : No non-correctable error event on Memory 0 detected                   */
  ERM_SR0_NCE0_1                       = 1,     /*!< 1 : Non-correctable error event on Memory 0 detected                      */
} ERM_SR0_NCE0_Enum;

/* ===============================================  ERM ERM_SR0 SBC0 [31..31]  =============================================== */
typedef enum {                                  /*!< ERM_SR0_SBC0                                                              */
  ERM_SR0_SBC0_0                       = 0,     /*!< 0 : No single-bit correction event on Memory 0 detected                   */
  ERM_SR0_SBC0_1                       = 1,     /*!< 1 : Single-bit correction event on Memory 0 detected                      */
} ERM_SR0_SBC0_Enum;

/* =======================================================  ERM_EAR0  ======================================================== */


/* =========================================================================================================================== */
/* ================                                            EIM                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  EIM_EIMCR  ======================================================= */
/* ==============================================  EIM EIM_EIMCR GEIEN [0..0]  =============================================== */
typedef enum {                                  /*!< EIM_EIMCR_GEIEN                                                           */
  EIM_EIMCR_GEIEN_0                    = 0,     /*!< 0 : Disabled                                                              */
  EIM_EIMCR_GEIEN_1                    = 1,     /*!< 1 : Enabled                                                               */
} EIM_EIMCR_GEIEN_Enum;

/* ======================================================  EIM_EICHEN  ======================================================= */
/* ============================================  EIM EIM_EICHEN EICH0EN [31..31]  ============================================ */
typedef enum {                                  /*!< EIM_EICHEN_EICH0EN                                                        */
  EIM_EICHEN_EICH0EN_0                 = 0,     /*!< 0 : Error injection is disabled on Error Injection Channel 0              */
  EIM_EICHEN_EICH0EN_1                 = 1,     /*!< 1 : Error injection is enabled on Error Injection Channel 0               */
} EIM_EICHEN_EICH0EN_Enum;

/* ===================================================  EIM_EICHD0_WORD0  ==================================================== */
/* ===================================================  EIM_EICHD0_WORD1  ==================================================== */


/* =========================================================================================================================== */
/* ================                                           FTFC                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  FTFC_FSTAT  ======================================================= */
/* =============================================  FTFC FTFC_FSTAT FPVIOL [4..4]  ============================================= */
typedef enum {                                  /*!< FTFC_FSTAT_FPVIOL                                                         */
  FTFC_FSTAT_FPVIOL_0                  = 0,     /*!< 0 : No protection violation detected                                      */
  FTFC_FSTAT_FPVIOL_1                  = 1,     /*!< 1 : Protection violation detected                                         */
} FTFC_FSTAT_FPVIOL_Enum;

/* =============================================  FTFC FTFC_FSTAT ACCERR [5..5]  ============================================= */
typedef enum {                                  /*!< FTFC_FSTAT_ACCERR                                                         */
  FTFC_FSTAT_ACCERR_0                  = 0,     /*!< 0 : No access error detected                                              */
  FTFC_FSTAT_ACCERR_1                  = 1,     /*!< 1 : Access error detected                                                 */
} FTFC_FSTAT_ACCERR_Enum;

/* ============================================  FTFC FTFC_FSTAT RDCOLERR [6..6]  ============================================ */
typedef enum {                                  /*!< FTFC_FSTAT_RDCOLERR                                                       */
  FTFC_FSTAT_RDCOLERR_0                = 0,     /*!< 0 : No collision error detected                                           */
  FTFC_FSTAT_RDCOLERR_1                = 1,     /*!< 1 : Collision error detected                                              */
} FTFC_FSTAT_RDCOLERR_Enum;

