nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  FTFC_FCNFG  ======================================================= */
/* ============================================  FTFC FTFC_FCNFG ERSSUSP [4..4]  ============================================= */
typedef enum {                                  /*!< FTFC_FCNFG_ERSSUSP                                                        */
  FTFC_FCNFG_ERSSUSP_0                 = 0,     /*!< 0 : No suspend requested                                                  */
  FTFC_FCNFG_ERSSUSP_1                 = 1,     /*!< 1 : Suspend the current Erase Flash Sector command execution              */
} FTFC_FCNFG_ERSSUSP_Enum;

/* ============================================  FTFC FTFC_FCNFG ERSAREQ [5..5]  ============================================= */
typedef enum {                                  /*!< FTFC_FCNFG_ERSAREQ                                                        */
  FTFC_FCNFG_ERSAREQ_0                 = 0,     /*!< 0 : No request or request complete                                        */
} FTFC_FCNFG_ERSAREQ_Enum;

/* ============================================  FTFC FTFC_FCNFG RDCOLLIE [6..6]  ============================================ */
typedef enum {                                  /*!< FTFC_FCNFG_RDCOLLIE                                                       */
  FTFC_FCNFG_RDCOLLIE_0                = 0,     /*!< 0 : Read collision error interrupt disabled                               */
  FTFC_FCNFG_RDCOLLIE_1                = 1,     /*!< 1 : Read collision error interrupt enabled. An interrupt request
                                                     is generated whenever an FTFC read collision error is detected
                                                     (see the description of FSTAT[RDCOLERR]).                                 */
} FTFC_FCNFG_RDCOLLIE_Enum;

/* ==============================================  FTFC FTFC_FCNFG CCIE [7..7]  ============================================== */
typedef enum {                                  /*!< FTFC_FCNFG_CCIE                                                           */
  FTFC_FCNFG_CCIE_0                    = 0,     /*!< 0 : Command complete interrupt disabled                                   */
  FTFC_FCNFG_CCIE_1                    = 1,     /*!< 1 : Command complete interrupt enabled. An interrupt request
                                                     is generated whenever the FSTAT[CCIF] flag is set.                        */
} FTFC_FCNFG_CCIE_Enum;

/* =======================================================  FTFC_FSEC  ======================================================= */
/* ===============================================  FTFC FTFC_FSEC SEC [0..1]  =============================================== */
typedef enum {                                  /*!< FTFC_FSEC_SEC                                                             */
  FTFC_FSEC_SEC_10                     = 2,     /*!< 10 : MCU security status is unsecure (The standard shipping
                                                     condition of the FTFC is unsecure.)                                       */
} FTFC_FSEC_SEC_Enum;

/* =============================================  FTFC FTFC_FSEC FSLACC [2..3]  ============================================== */
typedef enum {                                  /*!< FTFC_FSEC_FSLACC                                                          */
  FTFC_FSEC_FSLACC_00                  = 0,     /*!< 00 : Factory access granted                                               */
  FTFC_FSEC_FSLACC_11                  = 3,     /*!< 11 : Factory access granted                                               */
} FTFC_FSEC_FSLACC_Enum;

/* ==============================================  FTFC FTFC_FSEC MEEN [4..5]  =============================================== */
typedef enum {                                  /*!< FTFC_FSEC_MEEN                                                            */
  FTFC_FSEC_MEEN_00                    = 0,     /*!< 00 : Mass erase is enabled                                                */
  FTFC_FSEC_MEEN_01                    = 1,     /*!< 01 : Mass erase is enabled                                                */
  FTFC_FSEC_MEEN_11                    = 3,     /*!< 11 : Mass erase is enabled                                                */
} FTFC_FSEC_MEEN_Enum;

/* ==============================================  FTFC FTFC_FSEC KEYEN [6..7]  ============================================== */
typedef enum {                                  /*!< FTFC_FSEC_KEYEN                                                           */
  FTFC_FSEC_KEYEN_00                   = 0,     /*!< 00 : Backdoor key access disabled                                         */
  FTFC_FSEC_KEYEN_01                   = 1,     /*!< 01 : Backdoor key access disabled (preferred KEYEN state to
                                                     disable backdoor key access)                                              */
  FTFC_FSEC_KEYEN_10                   = 2,     /*!< 10 : Backdoor key access enabled                                          */
  FTFC_FSEC_KEYEN_11                   = 3,     /*!< 11 : Backdoor key access disabled                                         */
} FTFC_FSEC_KEYEN_Enum;

/* =======================================================  FTFC_FOPT  ======================================================= */
/* ======================================================  FTFC_FCCOB3  ====================================================== */
/* ======================================================  FTFC_FCCOB2  ====================================================== */
/* ======================================================  FTFC_FCCOB1  ====================================================== */
/* ======================================================  FTFC_FCCOB0  ====================================================== */
/* ======================================================  FTFC_FCCOB7  ====================================================== */
/* ======================================================  FTFC_FCCOB6  ====================================================== */
/* ======================================================  FTFC_FCCOB5  ====================================================== */
/* ======================================================  FTFC_FCCOB4  ====================================================== */
/* ======================================================  FTFC_FCCOBB  ====================================================== */
/* ======================================================  FTFC_FCCOBA  ====================================================== */
/* ======================================================  FTFC_FCCOB9  ====================================================== */
/* ======================================================  FTFC_FCCOB8  ====================================================== */
/* ======================================================  FTFC_FPROT3  ====================================================== */
/* ======================================================  FTFC_FPROT2  ====================================================== */
/* ======================================================  FTFC_FPROT1  ====================================================== */
/* ======================================================  FTFC_FPROT0  ====================================================== */
/* ======================================================  FTFC_FEPROT  ====================================================== */
/* ======================================================  FTFC_FDPROT  ====================================================== */
/* =============================================  FTFC FTFC_FDPROT DPROT [0..7]  ============================================= */
typedef enum {                                  /*!< FTFC_FDPROT_DPROT                                                         */
  FTFC_FDPROT_DPROT_00000000           = 0,     /*!< 00000000 : Data Flash region is protected                                 */
  FTFC_FDPROT_DPROT_00000001           = 1,     /*!< 00000001 : Data Flash region is not protected                             */
} FTFC_FDPROT_DPROT_Enum;

/* =====================================================  FTFC_FCSESTAT  ===================================================== */
/* =====================================================  FTFC_FERSTAT  ====================================================== */
/* ============================================  FTFC FTFC_FERSTAT DFDIF [1..1]  ============================================= */
typedef enum {                                  /*!< FTFC_FERSTAT_DFDIF                                                        */
  FTFC_FERSTAT_DFDIF_0                 = 0,     /*!< 0 : Double bit fault not detected during a valid flash read
                                                     access from the platform flash controller                                 */
  FTFC_FERSTAT_DFDIF_1                 = 1,     /*!< 1 : Double bit fault detected (or FERCNFG[FDFD] is set) during
                                                     a valid flash read access from the platform flash controller              */
} FTFC_FERSTAT_DFDIF_Enum;

