nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =====================================================  FTFC_FERCNFG  ====================================================== */
/* ============================================  FTFC FTFC_FERCNFG DFDIE [1..1]  ============================================= */
typedef enum {                                  /*!< FTFC_FERCNFG_DFDIE                                                        */
  FTFC_FERCNFG_DFDIE_0                 = 0,     /*!< 0 : Double bit fault detect interrupt disabled                            */
  FTFC_FERCNFG_DFDIE_1                 = 1,     /*!< 1 : Double bit fault detect interrupt enabled. An interrupt
                                                     request is generated whenever the FERSTAT[DFDIF] flag is
                                                     set.                                                                      */
} FTFC_FERCNFG_DFDIE_Enum;

/* =============================================  FTFC FTFC_FERCNFG FDFD [5..5]  ============================================= */
typedef enum {                                  /*!< FTFC_FERCNFG_FDFD                                                         */
  FTFC_FERCNFG_FDFD_0                  = 0,     /*!< 0 : FERSTAT[DFDIF] sets only if a double bit fault is detected
                                                     during read access from the platform flash controller                     */
  FTFC_FERCNFG_FDFD_1                  = 1,     /*!< 1 : FERSTAT[DFDIF] sets during any valid flash read access from
                                                     the platform flash controller. An interrupt request is
                                                     generated if the DFDIE bit is set.                                        */
} FTFC_FERCNFG_FDFD_Enum;



/* =========================================================================================================================== */
/* ================                                          DMAMUX                                           ================ */
/* =========================================================================================================================== */

/* =====================================================  DMAMUX_CHCFG0  ===================================================== */
/* ===========================================  DMAMUX DMAMUX_CHCFG0 TRIG [6..6]  ============================================ */
typedef enum {                                  /*!< DMAMUX_CHCFG0_TRIG                                                        */
  DMAMUX_CHCFG0_TRIG_0                 = 0,     /*!< 0 : Triggering is disabled. If triggering is disabled and ENBL
                                                     is set, the DMA Channel will simply route the specified
                                                     source to the DMA channel. (Normal mode)                                  */
  DMAMUX_CHCFG0_TRIG_1                 = 1,     /*!< 1 : Triggering is enabled. If triggering is enabled and ENBL
                                                     is set, the DMAMUX is in Periodic Trigger mode.                           */
} DMAMUX_CHCFG0_TRIG_Enum;

/* ===========================================  DMAMUX DMAMUX_CHCFG0 ENBL [7..7]  ============================================ */
typedef enum {                                  /*!< DMAMUX_CHCFG0_ENBL                                                        */
  DMAMUX_CHCFG0_ENBL_0                 = 0,     /*!< 0 : DMA channel is disabled. This mode is primarily used during
                                                     configuration of the DMAMux. The DMA has separate channel
                                                     enables/disables, which should be used to disable or reconfigure
                                                     a DMA channel.                                                            */
  DMAMUX_CHCFG0_ENBL_1                 = 1,     /*!< 1 : DMA channel is enabled                                                */
} DMAMUX_CHCFG0_ENBL_Enum;

/* =====================================================  DMAMUX_CHCFG1  ===================================================== */
/* ===========================================  DMAMUX DMAMUX_CHCFG1 TRIG [6..6]  ============================================ */
typedef enum {                                  /*!< DMAMUX_CHCFG1_TRIG                                                        */
  DMAMUX_CHCFG1_TRIG_0                 = 0,     /*!< 0 : Triggering is disabled. If triggering is disabled and ENBL
                                                     is set, the DMA Channel will simply route the specified
                                                     source to the DMA channel. (Normal mode)                                  */
  DMAMUX_CHCFG1_TRIG_1                 = 1,     /*!< 1 : Triggering is enabled. If triggering is enabled and ENBL
                                                     is set, the DMAMUX is in Periodic Trigger mode.                           */
} DMAMUX_CHCFG1_TRIG_Enum;

/* ===========================================  DMAMUX DMAMUX_CHCFG1 ENBL [7..7]  ============================================ */
typedef enum {                                  /*!< DMAMUX_CHCFG1_ENBL                                                        */
  DMAMUX_CHCFG1_ENBL_0                 = 0,     /*!< 0 : DMA channel is disabled. This mode is primarily used during
                                                     configuration of the DMAMux. The DMA has separate channel
                                                     enables/disables, which should be used to disable or reconfigure
                                                     a DMA channel.                                                            */
  DMAMUX_CHCFG1_ENBL_1                 = 1,     /*!< 1 : DMA channel is enabled                                                */
} DMAMUX_CHCFG1_ENBL_Enum;

