nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =====================================================  DMAMUX_CHCFG2  ===================================================== */
/* ===========================================  DMAMUX DMAMUX_CHCFG2 TRIG [6..6]  ============================================ */
typedef enum {                                  /*!< DMAMUX_CHCFG2_TRIG                                                        */
  DMAMUX_CHCFG2_TRIG_0                 = 0,     /*!< 0 : Triggering is disabled. If triggering is disabled and ENBL
                                                     is set, the DMA Channel will simply route the specified
                                                     source to the DMA channel. (Normal mode)                                  */
  DMAMUX_CHCFG2_TRIG_1                 = 1,     /*!< 1 : Triggering is enabled. If triggering is enabled and ENBL
                                                     is set, the DMAMUX is in Periodic Trigger mode.                           */
} DMAMUX_CHCFG2_TRIG_Enum;

/* ===========================================  DMAMUX DMAMUX_CHCFG2 ENBL [7..7]  ============================================ */
typedef enum {                                  /*!< DMAMUX_CHCFG2_ENBL                                                        */
  DMAMUX_CHCFG2_ENBL_0                 = 0,     /*!< 0 : DMA channel is disabled. This mode is primarily used during
                                                     configuration of the DMAMux. The DMA has separate channel
                                                     enables/disables, which should be used to disable or reconfigure
                                                     a DMA channel.                                                            */
  DMAMUX_CHCFG2_ENBL_1                 = 1,     /*!< 1 : DMA channel is enabled                                                */
} DMAMUX_CHCFG2_ENBL_Enum;

/* =====================================================  DMAMUX_CHCFG3  ===================================================== */
/* ===========================================  DMAMUX DMAMUX_CHCFG3 TRIG [6..6]  ============================================ */
typedef enum {                                  /*!< DMAMUX_CHCFG3_TRIG                                                        */
  DMAMUX_CHCFG3_TRIG_0                 = 0,     /*!< 0 : Triggering is disabled. If triggering is disabled and ENBL
                                                     is set, the DMA Channel will simply route the specified
                                                     source to the DMA channel. (Normal mode)                                  */
  DMAMUX_CHCFG3_TRIG_1                 = 1,     /*!< 1 : Triggering is enabled. If triggering is enabled and ENBL
                                                     is set, the DMAMUX is in Periodic Trigger mode.                           */
} DMAMUX_CHCFG3_TRIG_Enum;

/* ===========================================  DMAMUX DMAMUX_CHCFG3 ENBL [7..7]  ============================================ */
typedef enum {                                  /*!< DMAMUX_CHCFG3_ENBL                                                        */
  DMAMUX_CHCFG3_ENBL_0                 = 0,     /*!< 0 : DMA channel is disabled. This mode is primarily used during
                                                     configuration of the DMAMux. The DMA has separate channel
                                                     enables/disables, which should be used to disable or reconfigure
                                                     a DMA channel.                                                            */
  DMAMUX_CHCFG3_ENBL_1                 = 1,     /*!< 1 : DMA channel is enabled                                                */
} DMAMUX_CHCFG3_ENBL_Enum;



/* =========================================================================================================================== */
/* ================                                           CAN0                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  CAN0_MCR  ======================================================== */
/* ===============================================  CAN0 CAN0_MCR IDAM [8..9]  =============================================== */
typedef enum {                                  /*!< CAN0_MCR_IDAM                                                             */
  CAN0_MCR_IDAM_00                     = 0,     /*!< 00 : Format A: One full ID (standard and extended) per ID Filter
                                                     Table element.                                                            */
  CAN0_MCR_IDAM_01                     = 1,     /*!< 01 : Format B: Two full standard IDs or two partial 14-bit (standard
                                                     and extended) IDs per ID Filter Table element.                            */
  CAN0_MCR_IDAM_10                     = 2,     /*!< 10 : Format C: Four partial 8-bit Standard IDs per ID Filter
                                                     Table element.                                                            */
  CAN0_MCR_IDAM_11                     = 3,     /*!< 11 : Format D: All frames rejected.                                       */
} CAN0_MCR_IDAM_Enum;

/* ==============================================  CAN0 CAN0_MCR FDEN [11..11]  ============================================== */
typedef enum {                                  /*!< CAN0_MCR_FDEN                                                             */
  CAN0_MCR_FDEN_1                      = 1,     /*!< 1 : CAN FD is enabled. FlexCAN is able to receive and transmit
                                                     messages in both CAN FD and CAN 2.0 formats.                              */
  CAN0_MCR_FDEN_0                      = 0,     /*!< 0 : CAN FD is disabled. FlexCAN is able to receive and transmit
                                                     messages in CAN 2.0 format.                                               */
} CAN0_MCR_FDEN_Enum;

/* ==============================================  CAN0 CAN0_MCR AEN [12..12]  =============================================== */
typedef enum {                                  /*!< CAN0_MCR_AEN                                                              */
  CAN0_MCR_AEN_0                       = 0,     /*!< 0 : Abort disabled.                                                       */
  CAN0_MCR_AEN_1                       = 1,     /*!< 1 : Abort enabled.                                                        */
} CAN0_MCR_AEN_Enum;

/* ============================================  CAN0 CAN0_MCR LPRIOEN [13..13]  ============================================= */
typedef enum {                                  /*!< CAN0_MCR_LPRIOEN                                                          */
  CAN0_MCR_LPRIOEN_0                   = 0,     /*!< 0 : Local Priority disabled.                                              */
  CAN0_MCR_LPRIOEN_1                   = 1,     /*!< 1 : Local Priority enabled.                                               */
} CAN0_MCR_LPRIOEN_Enum;

/* ============================================  CAN0 CAN0_MCR PNET_EN [14..14]  ============================================= */
typedef enum {                                  /*!< CAN0_MCR_PNET_EN                                                          */
  CAN0_MCR_PNET_EN_0                   = 0,     /*!< 0 : Pretended Networking mode is disabled.                                */
  CAN0_MCR_PNET_EN_1                   = 1,     /*!< 1 : Pretended Networking mode is enabled.                                 */
} CAN0_MCR_PNET_EN_Enum;

/* ==============================================  CAN0 CAN0_MCR DMA [15..15]  =============================================== */
typedef enum {                                  /*!< CAN0_MCR_DMA                                                              */
  CAN0_MCR_DMA_0                       = 0,     /*!< 0 : DMA feature for RX FIFO disabled.                                     */
  CAN0_MCR_DMA_1                       = 1,     /*!< 1 : DMA feature for RX FIFO enabled.                                      */
} CAN0_MCR_DMA_Enum;

