nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  CAN0 CAN0_CTRL1 RWRNMSK [10..10]  ============================================ */
typedef enum {                                  /*!< CAN0_CTRL1_RWRNMSK                                                        */
  CAN0_CTRL1_RWRNMSK_0                 = 0,     /*!< 0 : Rx Warning Interrupt disabled.                                        */
  CAN0_CTRL1_RWRNMSK_1                 = 1,     /*!< 1 : Rx Warning Interrupt enabled.                                         */
} CAN0_CTRL1_RWRNMSK_Enum;

/* ===========================================  CAN0 CAN0_CTRL1 TWRNMSK [11..11]  ============================================ */
typedef enum {                                  /*!< CAN0_CTRL1_TWRNMSK                                                        */
  CAN0_CTRL1_TWRNMSK_0                 = 0,     /*!< 0 : Tx Warning Interrupt disabled.                                        */
  CAN0_CTRL1_TWRNMSK_1                 = 1,     /*!< 1 : Tx Warning Interrupt enabled.                                         */
} CAN0_CTRL1_TWRNMSK_Enum;

/* =============================================  CAN0 CAN0_CTRL1 LPB [12..12]  ============================================== */
typedef enum {                                  /*!< CAN0_CTRL1_LPB                                                            */
  CAN0_CTRL1_LPB_0                     = 0,     /*!< 0 : Loop Back disabled.                                                   */
  CAN0_CTRL1_LPB_1                     = 1,     /*!< 1 : Loop Back enabled.                                                    */
} CAN0_CTRL1_LPB_Enum;

/* ============================================  CAN0 CAN0_CTRL1 CLKSRC [13..13]  ============================================ */
typedef enum {                                  /*!< CAN0_CTRL1_CLKSRC                                                         */
  CAN0_CTRL1_CLKSRC_0                  = 0,     /*!< 0 : The CAN engine clock source is the oscillator clock. Under
                                                     this condition, the oscillator clock frequency must be
                                                     lower than the bus clock.                                                 */
  CAN0_CTRL1_CLKSRC_1                  = 1,     /*!< 1 : The CAN engine clock source is the peripheral clock.                  */
} CAN0_CTRL1_CLKSRC_Enum;

/* ============================================  CAN0 CAN0_CTRL1 ERRMSK [14..14]  ============================================ */
typedef enum {                                  /*!< CAN0_CTRL1_ERRMSK                                                         */
  CAN0_CTRL1_ERRMSK_0                  = 0,     /*!< 0 : Error interrupt disabled.                                             */
  CAN0_CTRL1_ERRMSK_1                  = 1,     /*!< 1 : Error interrupt enabled.                                              */
} CAN0_CTRL1_ERRMSK_Enum;

/* ===========================================  CAN0 CAN0_CTRL1 BOFFMSK [15..15]  ============================================ */
typedef enum {                                  /*!< CAN0_CTRL1_BOFFMSK                                                        */
  CAN0_CTRL1_BOFFMSK_0                 = 0,     /*!< 0 : Bus Off interrupt disabled.                                           */
  CAN0_CTRL1_BOFFMSK_1                 = 1,     /*!< 1 : Bus Off interrupt enabled.                                            */
} CAN0_CTRL1_BOFFMSK_Enum;

/* ======================================================  CAN0_TIMER  ======================================================= */
/* =====================================================  CAN0_RXMGMASK  ===================================================== */
/* =====================================================  CAN0_RX14MASK  ===================================================== */
/* =====================================================  CAN0_RX15MASK  ===================================================== */
/* =======================================================  CAN0_ECR  ======================================================== */
/* =======================================================  CAN0_ESR1  ======================================================= */
/* =============================================  CAN0 CAN0_ESR1 ERRINT [1..1]  ============================================== */
typedef enum {                                  /*!< CAN0_ESR1_ERRINT                                                          */
  CAN0_ESR1_ERRINT_0                   = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_ERRINT_1                   = 1,     /*!< 1 : Indicates setting of any Error Bit in the Error and Status
                                                     Register.                                                                 */
} CAN0_ESR1_ERRINT_Enum;

/* =============================================  CAN0 CAN0_ESR1 BOFFINT [2..2]  ============================================= */
typedef enum {                                  /*!< CAN0_ESR1_BOFFINT                                                         */
  CAN0_ESR1_BOFFINT_0                  = 0,     /*!< 0 : No such occurrence.                                                   */
  CAN0_ESR1_BOFFINT_1                  = 1,     /*!< 1 : FlexCAN module entered Bus Off state.                                 */
} CAN0_ESR1_BOFFINT_Enum;

/* ===============================================  CAN0 CAN0_ESR1 RX [3..3]  ================================================ */
typedef enum {                                  /*!< CAN0_ESR1_RX                                                              */
  CAN0_ESR1_RX_0                       = 0,     /*!< 0 : FlexCAN is not receiving a message.                                   */
  CAN0_ESR1_RX_1                       = 1,     /*!< 1 : FlexCAN is receiving a message.                                       */
} CAN0_ESR1_RX_Enum;

/* =============================================  CAN0 CAN0_ESR1 FLTCONF [4..5]  ============================================= */
typedef enum {                                  /*!< CAN0_ESR1_FLTCONF                                                         */
  CAN0_ESR1_FLTCONF_00                 = 0,     /*!< 00 : Error Active                                                         */
  CAN0_ESR1_FLTCONF_01                 = 1,     /*!< 01 : Error Passive                                                        */
  CAN0_ESR1_FLTCONF_1x_2               = 2,     /*!< 1x_2 : Bus Off                                                            */
  CAN0_ESR1_FLTCONF_1x_3               = 3,     /*!< 1x_3 : Bus Off                                                            */
} CAN0_ESR1_FLTCONF_Enum;

