nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
  CAN0_CTRL1_PN_FCS_10                 = 2,     /*!< 10 : Message ID filtering occurring a specified number of times.          */
  CAN0_CTRL1_PN_FCS_11                 = 3,     /*!< 11 : Message ID filtering and payload filtering a specified
                                                     number of times                                                           */
} CAN0_CTRL1_PN_FCS_Enum;

/* ============================================  CAN0 CAN0_CTRL1_PN IDFS [2..3]  ============================================= */
typedef enum {                                  /*!< CAN0_CTRL1_PN_IDFS                                                        */
  CAN0_CTRL1_PN_IDFS_00                = 0,     /*!< 00 : Match upon a ID contents against an exact target value               */
  CAN0_CTRL1_PN_IDFS_01                = 1,     /*!< 01 : Match upon a ID value greater than or equal to a specified
                                                     target value                                                              */
  CAN0_CTRL1_PN_IDFS_10                = 2,     /*!< 10 : Match upon a ID value smaller than or equal to a specified
                                                     target value                                                              */
  CAN0_CTRL1_PN_IDFS_11                = 3,     /*!< 11 : Match upon a ID value inside a range, greater than or equal
                                                     to a specified lower limit and smaller than or equal a
                                                     specified upper limit                                                     */
} CAN0_CTRL1_PN_IDFS_Enum;

/* ============================================  CAN0 CAN0_CTRL1_PN PLFS [4..5]  ============================================= */
typedef enum {                                  /*!< CAN0_CTRL1_PN_PLFS                                                        */
  CAN0_CTRL1_PN_PLFS_00                = 0,     /*!< 00 : Match upon a payload contents against an exact target value          */
  CAN0_CTRL1_PN_PLFS_01                = 1,     /*!< 01 : Match upon a payload value greater than or equal to a specified
                                                     target value                                                              */
  CAN0_CTRL1_PN_PLFS_10                = 2,     /*!< 10 : Match upon a payload value smaller than or equal to a specified
                                                     target value                                                              */
  CAN0_CTRL1_PN_PLFS_11                = 3,     /*!< 11 : Match upon a payload value inside a range, greater than
                                                     or equal to a specified lower limit and smaller than or
                                                     equal a specified upper limit                                             */
} CAN0_CTRL1_PN_PLFS_Enum;

/* ===========================================  CAN0 CAN0_CTRL1_PN NMATCH [8..15]  =========================================== */
typedef enum {                                  /*!< CAN0_CTRL1_PN_NMATCH                                                      */
  CAN0_CTRL1_PN_NMATCH_00000001        = 1,     /*!< 00000001 : Received message must match the predefined filtering
                                                     criteria for ID and/or PL once before generating a wake
                                                     up event.                                                                 */
  CAN0_CTRL1_PN_NMATCH_00000010        = 2,     /*!< 00000010 : Received message must match the predefined filtering
                                                     criteria for ID and/or PL twice before generating a wake
                                                     up event.                                                                 */
  CAN0_CTRL1_PN_NMATCH_11111111        = 255,   /*!< 11111111 : Received message must match the predefined filtering
                                                     criteria for ID and/or PL 255 times before generating a
                                                     wake up event.                                                            */
} CAN0_CTRL1_PN_NMATCH_Enum;

/* =========================================  CAN0 CAN0_CTRL1_PN WUMF_MSK [16..16]  ========================================== */
typedef enum {                                  /*!< CAN0_CTRL1_PN_WUMF_MSK                                                    */
  CAN0_CTRL1_PN_WUMF_MSK_0             = 0,     /*!< 0 : Wake up match event is disabled                                       */
  CAN0_CTRL1_PN_WUMF_MSK_1             = 1,     /*!< 1 : Wake up match event is enabled                                        */
} CAN0_CTRL1_PN_WUMF_MSK_Enum;

/* =========================================  CAN0 CAN0_CTRL1_PN WTOF_MSK [17..17]  ========================================== */
typedef enum {                                  /*!< CAN0_CTRL1_PN_WTOF_MSK                                                    */
  CAN0_CTRL1_PN_WTOF_MSK_0             = 0,     /*!< 0 : Timeout wake up event is disabled                                     */
  CAN0_CTRL1_PN_WTOF_MSK_1             = 1,     /*!< 1 : Timeout wake up event is enabled                                      */
} CAN0_CTRL1_PN_WTOF_MSK_Enum;

/* =====================================================  CAN0_CTRL2_PN  ===================================================== */
/* ======================================================  CAN0_WU_MTC  ====================================================== */
/* ============================================  CAN0 CAN0_WU_MTC WUMF [16..16]  ============================================= */
typedef enum {                                  /*!< CAN0_WU_MTC_WUMF                                                          */
  CAN0_WU_MTC_WUMF_0                   = 0,     /*!< 0 : No wake up by match event detected                                    */
  CAN0_WU_MTC_WUMF_1                   = 1,     /*!< 1 : Wake up by match event detected                                       */
} CAN0_WU_MTC_WUMF_Enum;

/* ============================================  CAN0 CAN0_WU_MTC WTOF [17..17]  ============================================= */
typedef enum {                                  /*!< CAN0_WU_MTC_WTOF                                                          */
  CAN0_WU_MTC_WTOF_0                   = 0,     /*!< 0 : No wake up by timeout event detected                                  */
  CAN0_WU_MTC_WTOF_1                   = 1,     /*!< 1 : Wake up by timeout event detected                                     */
} CAN0_WU_MTC_WTOF_Enum;

/* =====================================================  CAN0_FLT_ID1  ====================================================== */
/* ==========================================  CAN0 CAN0_FLT_ID1 FLT_RTR [29..29]  =========================================== */
typedef enum {                                  /*!< CAN0_FLT_ID1_FLT_RTR                                                      */
  CAN0_FLT_ID1_FLT_RTR_0               = 0,     /*!< 0 : Reject remote frame (accept data frame)                               */
  CAN0_FLT_ID1_FLT_RTR_1               = 1,     /*!< 1 : Accept remote frame                                                   */
} CAN0_FLT_ID1_FLT_RTR_Enum;

