nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPSPI0 LPSPI0_CFGR0 CIRFIFO [8..8]  =========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR0_CIRFIFO                                                      */
  LPSPI0_CFGR0_CIRFIFO_0               = 0,     /*!< 0 : Circular FIFO is disabled.                                            */
  LPSPI0_CFGR0_CIRFIFO_1               = 1,     /*!< 1 : Circular FIFO is enabled.                                             */
} LPSPI0_CFGR0_CIRFIFO_Enum;

/* ============================================  LPSPI0 LPSPI0_CFGR0 RDMO [9..9]  ============================================ */
typedef enum {                                  /*!< LPSPI0_CFGR0_RDMO                                                         */
  LPSPI0_CFGR0_RDMO_0                  = 0,     /*!< 0 : Received data is stored in the receive FIFO as normal.                */
  LPSPI0_CFGR0_RDMO_1                  = 1,     /*!< 1 : Received data is discarded unless the DMF is set.                     */
} LPSPI0_CFGR0_RDMO_Enum;

/* =====================================================  LPSPI0_CFGR1  ====================================================== */
/* ===========================================  LPSPI0 LPSPI0_CFGR1 MASTER [0..0]  =========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_MASTER                                                       */
  LPSPI0_CFGR1_MASTER_0                = 0,     /*!< 0 : Slave mode.                                                           */
  LPSPI0_CFGR1_MASTER_1                = 1,     /*!< 1 : Master mode.                                                          */
} LPSPI0_CFGR1_MASTER_Enum;

/* ===========================================  LPSPI0 LPSPI0_CFGR1 SAMPLE [1..1]  =========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_SAMPLE                                                       */
  LPSPI0_CFGR1_SAMPLE_0                = 0,     /*!< 0 : Input data sampled on SCK edge.                                       */
  LPSPI0_CFGR1_SAMPLE_1                = 1,     /*!< 1 : Input data sampled on delayed SCK edge.                               */
} LPSPI0_CFGR1_SAMPLE_Enum;

/* ==========================================  LPSPI0 LPSPI0_CFGR1 AUTOPCS [2..2]  =========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_AUTOPCS                                                      */
  LPSPI0_CFGR1_AUTOPCS_0               = 0,     /*!< 0 : Automatic PCS generation disabled.                                    */
  LPSPI0_CFGR1_AUTOPCS_1               = 1,     /*!< 1 : Automatic PCS generation enabled.                                     */
} LPSPI0_CFGR1_AUTOPCS_Enum;

/* ==========================================  LPSPI0 LPSPI0_CFGR1 NOSTALL [3..3]  =========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_NOSTALL                                                      */
  LPSPI0_CFGR1_NOSTALL_0               = 0,     /*!< 0 : Transfers will stall when transmit FIFO is empty or receive
                                                     FIFO is full.                                                             */
  LPSPI0_CFGR1_NOSTALL_1               = 1,     /*!< 1 : Transfers will not stall, allowing transmit FIFO underrun
                                                     or receive FIFO overrun to occur.                                         */
} LPSPI0_CFGR1_NOSTALL_Enum;

/* ==========================================  LPSPI0 LPSPI0_CFGR1 PCSPOL [8..11]  =========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_PCSPOL                                                       */
  LPSPI0_CFGR1_PCSPOL_0000             = 0,     /*!< 0000 : The PCSx is active low.                                            */
  LPSPI0_CFGR1_PCSPOL_0001             = 1,     /*!< 0001 : The PCSx is active high.                                           */
} LPSPI0_CFGR1_PCSPOL_Enum;

/* ==========================================  LPSPI0 LPSPI0_CFGR1 MATCFG [16..18]  ========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_MATCFG                                                       */
  LPSPI0_CFGR1_MATCFG_000              = 0,     /*!< 000 : Match is disabled.                                                  */
  LPSPI0_CFGR1_MATCFG_010              = 2,     /*!< 010 : 010b - Match is enabled, if 1st data word equals MATCH0
                                                     OR MATCH1, i.e., (1st data word = MATCH0 + MATCH1)                        */
  LPSPI0_CFGR1_MATCFG_011              = 3,     /*!< 011 : 011b - Match is enabled, if any data word equals MATCH0
                                                     OR MATCH1, i.e., (any data word = MATCH0 + MATCH1)                        */
  LPSPI0_CFGR1_MATCFG_100              = 4,     /*!< 100 : 100b - Match is enabled, if 1st data word equals MATCH0
                                                     AND 2nd data word equals MATCH1, i.e., [(1st data word
                                                     = MATCH0) * (2nd data word = MATCH1)]                                     */
  LPSPI0_CFGR1_MATCFG_101              = 5,     /*!< 101 : 101b - Match is enabled, if any data word equals MATCH0
                                                     AND the next data word equals MATCH1, i.e., [(any data
                                                     word = MATCH0) * (next data word = MATCH1)]                               */
  LPSPI0_CFGR1_MATCFG_110              = 6,     /*!< 110 : 110b - Match is enabled, if (1st data word AND MATCH1)
                                                     equals (MATCH0 AND MATCH1), i.e., [(1st data word * MATCH1)
                                                     = (MATCH0 * MATCH1)]                                                      */
  LPSPI0_CFGR1_MATCFG_111              = 7,     /*!< 111 : 111b - Match is enabled, if (any data word AND MATCH1)
                                                     equals (MATCH0 AND MATCH1), i.e., [(any data word * MATCH1)
                                                     = (MATCH0 * MATCH1)]                                                      */
} LPSPI0_CFGR1_MATCFG_Enum;

/* ==========================================  LPSPI0 LPSPI0_CFGR1 PINCFG [24..25]  ========================================== */
typedef enum {                                  /*!< LPSPI0_CFGR1_PINCFG                                                       */
  LPSPI0_CFGR1_PINCFG_00               = 0,     /*!< 00 : SIN is used for input data and SOUT for output data.                 */
  LPSPI0_CFGR1_PINCFG_01               = 1,     /*!< 01 : SIN is used for both input and output data.                          */
  LPSPI0_CFGR1_PINCFG_10               = 2,     /*!< 10 : SOUT is used for both input and output data.                         */
  LPSPI0_CFGR1_PINCFG_11               = 3,     /*!< 11 : SOUT is used for input data and SIN for output data.                 */
} LPSPI0_CFGR1_PINCFG_Enum;

