nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===============================================  PDB0 PDB0_SC MULT [2..3]  ================================================ */
typedef enum {                                  /*!< PDB0_SC_MULT                                                              */
  PDB0_SC_MULT_00                      = 0,     /*!< 00 : Multiplication factor is 1.                                          */
  PDB0_SC_MULT_01                      = 1,     /*!< 01 : Multiplication factor is 10.                                         */
  PDB0_SC_MULT_10                      = 2,     /*!< 10 : Multiplication factor is 20.                                         */
  PDB0_SC_MULT_11                      = 3,     /*!< 11 : Multiplication factor is 40.                                         */
} PDB0_SC_MULT_Enum;

/* ===============================================  PDB0 PDB0_SC PDBIE [5..5]  =============================================== */
typedef enum {                                  /*!< PDB0_SC_PDBIE                                                             */
  PDB0_SC_PDBIE_0                      = 0,     /*!< 0 : PDB interrupt disabled.                                               */
  PDB0_SC_PDBIE_1                      = 1,     /*!< 1 : PDB interrupt enabled.                                                */
} PDB0_SC_PDBIE_Enum;

/* ===============================================  PDB0 PDB0_SC PDBEN [7..7]  =============================================== */
typedef enum {                                  /*!< PDB0_SC_PDBEN                                                             */
  PDB0_SC_PDBEN_0                      = 0,     /*!< 0 : PDB disabled. Counter is off.                                         */
  PDB0_SC_PDBEN_1                      = 1,     /*!< 1 : PDB enabled.                                                          */
} PDB0_SC_PDBEN_Enum;

/* ==============================================  PDB0 PDB0_SC TRGSEL [8..11]  ============================================== */
typedef enum {                                  /*!< PDB0_SC_TRGSEL                                                            */
  PDB0_SC_TRGSEL_0000                  = 0,     /*!< 0000 : Trigger-In 0 is selected.                                          */
  PDB0_SC_TRGSEL_0001                  = 1,     /*!< 0001 : Trigger-In 1 is selected.                                          */
  PDB0_SC_TRGSEL_0010                  = 2,     /*!< 0010 : Trigger-In 2 is selected.                                          */
  PDB0_SC_TRGSEL_0011                  = 3,     /*!< 0011 : Trigger-In 3 is selected.                                          */
  PDB0_SC_TRGSEL_0100                  = 4,     /*!< 0100 : Trigger-In 4 is selected.                                          */
  PDB0_SC_TRGSEL_0101                  = 5,     /*!< 0101 : Trigger-In 5 is selected.                                          */
  PDB0_SC_TRGSEL_0110                  = 6,     /*!< 0110 : Trigger-In 6 is selected.                                          */
  PDB0_SC_TRGSEL_0111                  = 7,     /*!< 0111 : Trigger-In 7 is selected.                                          */
  PDB0_SC_TRGSEL_1000                  = 8,     /*!< 1000 : Trigger-In 8 is selected.                                          */
  PDB0_SC_TRGSEL_1001                  = 9,     /*!< 1001 : Trigger-In 9 is selected.                                          */
  PDB0_SC_TRGSEL_1010                  = 10,    /*!< 1010 : Trigger-In 10 is selected.                                         */
  PDB0_SC_TRGSEL_1011                  = 11,    /*!< 1011 : Trigger-In 11 is selected.                                         */
  PDB0_SC_TRGSEL_1100                  = 12,    /*!< 1100 : Trigger-In 12 is selected.                                         */
  PDB0_SC_TRGSEL_1101                  = 13,    /*!< 1101 : Trigger-In 13 is selected.                                         */
  PDB0_SC_TRGSEL_1110                  = 14,    /*!< 1110 : Trigger-In 14 is selected.                                         */
  PDB0_SC_TRGSEL_1111                  = 15,    /*!< 1111 : Software trigger is selected.                                      */
} PDB0_SC_TRGSEL_Enum;

/* ============================================  PDB0 PDB0_SC PRESCALER [12..14]  ============================================ */
typedef enum {                                  /*!< PDB0_SC_PRESCALER                                                         */
  PDB0_SC_PRESCALER_000                = 0,     /*!< 000 : Counting uses the peripheral clock divided by MULT (the
                                                     multiplication factor).                                                   */
  PDB0_SC_PRESCALER_001                = 1,     /*!< 001 : Counting uses the peripheral clock divided by 2 x MULT
                                                     (the multiplication factor).                                              */
  PDB0_SC_PRESCALER_010                = 2,     /*!< 010 : Counting uses the peripheral clock divided by 4 x MULT
                                                     (the multiplication factor).                                              */
  PDB0_SC_PRESCALER_011                = 3,     /*!< 011 : Counting uses the peripheral clock divided by 8 x MULT
                                                     (the multiplication factor).                                              */
  PDB0_SC_PRESCALER_100                = 4,     /*!< 100 : Counting uses the peripheral clock divided by 16 x MULT
                                                     (the multiplication factor).                                              */
  PDB0_SC_PRESCALER_101                = 5,     /*!< 101 : Counting uses the peripheral clock divided by 32 x MULT
                                                     (the multiplication factor).                                              */
  PDB0_SC_PRESCALER_110                = 6,     /*!< 110 : Counting uses the peripheral clock divided by 64 x MULT
                                                     (the multiplication factor).                                              */
  PDB0_SC_PRESCALER_111                = 7,     /*!< 111 : Counting uses the peripheral clock divided by 128 x MULT
                                                     (the multiplication factor).                                              */
} PDB0_SC_PRESCALER_Enum;

/* ==============================================  PDB0 PDB0_SC DMAEN [15..15]  ============================================== */
typedef enum {                                  /*!< PDB0_SC_DMAEN                                                             */
  PDB0_SC_DMAEN_0                      = 0,     /*!< 0 : DMA disabled.                                                         */
  PDB0_SC_DMAEN_1                      = 1,     /*!< 1 : DMA enabled.                                                          */
} PDB0_SC_DMAEN_Enum;

/* =============================================  PDB0 PDB0_SC PDBEIE [17..17]  ============================================== */
typedef enum {                                  /*!< PDB0_SC_PDBEIE                                                            */
  PDB0_SC_PDBEIE_0                     = 0,     /*!< 0 : PDB sequence error interrupt disabled.                                */
  PDB0_SC_PDBEIE_1                     = 1,     /*!< 1 : PDB sequence error interrupt enabled.                                 */
} PDB0_SC_PDBEIE_Enum;

/* ==============================================  PDB0 PDB0_SC LDMOD [18..19]  ============================================== */
typedef enum {                                  /*!< PDB0_SC_LDMOD                                                             */
  PDB0_SC_LDMOD_00                     = 0,     /*!< 00 : The internal registers are loaded with the values from
                                                     their buffers, immediately after 1 is written to LDOK.                    */
  PDB0_SC_LDMOD_01                     = 1,     /*!< 01 : The internal registers are loaded with the values from
                                                     their buffers when the PDB counter (CNT) = MOD + 1 CNT
                                                     delay elapsed, after 1 is written to LDOK.                                */
  PDB0_SC_LDMOD_10                     = 2,     /*!< 10 : The internal registers are loaded with the values from
                                                     their buffers when a trigger input event is detected, after
                                                     1 is written to LDOK.                                                     */
  PDB0_SC_LDMOD_11                     = 3,     /*!< 11 : The internal registers are loaded with the values from
                                                     their buffers when either the PDB counter (CNT) = MOD +
                                                     1 CNT delay elapsed, or a trigger input event is detected,
                                                     after 1 is written to LDOK.                                               */
} PDB0_SC_LDMOD_Enum;

/* =======================================================  PDB0_MOD  ======================================================== */
/* =======================================================  PDB0_CNT  ======================================================== */
/* =======================================================  PDB0_IDLY  ======================================================= */
/* ======================================================  PDB0_CH0C1  ======================================================= */
/* ===============================================  PDB0 PDB0_CH0C1 EN [0..7]  =============================================== */
typedef enum {                                  /*!< PDB0_CHC1_CHC1_CH0C1_EN                                                   */
  PDB0_CHC1_CHC1_CH0C1_EN_0            = 0,     /*!< 0 : PDB channels corresponding pre-trigger disabled.                      */
  PDB0_CHC1_CHC1_CH0C1_EN_1            = 1,     /*!< 1 : PDB channels corresponding pre-trigger enabled.                       */
} PDB0_CHC1_CHC1_CH0C1_EN_Enum;

