nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  PDB0 PDB0_CH0C1 TOS [8..15]  ============================================== */
typedef enum {                                  /*!< PDB0_CHC1_CHC1_CH0C1_TOS                                                  */
  PDB0_CHC1_CHC1_CH0C1_TOS_0           = 0,     /*!< 0 : PDB channels corresponding pre-trigger is in bypassed mode.
                                                     The pre-trigger asserts one peripheral clock cycle after
                                                     a rising edge is detected on selected trigger input source
                                                     or software trigger is selected and SWTRIG is written with
                                                     1.                                                                        */
  PDB0_CHC1_CHC1_CH0C1_TOS_1           = 1,     /*!< 1 : PDB channels corresponding pre-trigger asserts when the
                                                     counter reaches the channel delay register and one peripheral
                                                     clock cycle after a rising edge is detected on selected
                                                     trigger input source or software trigger is selected and
                                                     SWTRIG is written with 1.                                                 */
} PDB0_CHC1_CHC1_CH0C1_TOS_Enum;

/* ==============================================  PDB0 PDB0_CH0C1 BB [16..23]  ============================================== */
typedef enum {                                  /*!< PDB0_CHC1_CHC1_CH0C1_BB                                                   */
  PDB0_CHC1_CHC1_CH0C1_BB_0            = 0,     /*!< 0 : PDB channels corresponding pre-trigger back-to-back operation
                                                     disabled.                                                                 */
  PDB0_CHC1_CHC1_CH0C1_BB_1            = 1,     /*!< 1 : PDB channels corresponding pre-trigger back-to-back operation
                                                     enabled.                                                                  */
} PDB0_CHC1_CHC1_CH0C1_BB_Enum;

/* ======================================================  PDB0_CH1C1  ======================================================= */
/* ===============================================  PDB0 PDB0_CH1C1 EN [0..7]  =============================================== */
typedef enum {                                  /*!< PDB0_CHC1_CHC1_CH1C1_EN                                                   */
  PDB0_CHC1_CHC1_CH1C1_EN_0            = 0,     /*!< 0 : PDB channels corresponding pre-trigger disabled.                      */
  PDB0_CHC1_CHC1_CH1C1_EN_1            = 1,     /*!< 1 : PDB channels corresponding pre-trigger enabled.                       */
} PDB0_CHC1_CHC1_CH1C1_EN_Enum;

/* ==============================================  PDB0 PDB0_CH1C1 TOS [8..15]  ============================================== */
typedef enum {                                  /*!< PDB0_CHC1_CHC1_CH1C1_TOS                                                  */
  PDB0_CHC1_CHC1_CH1C1_TOS_0           = 0,     /*!< 0 : PDB channels corresponding pre-trigger is in bypassed mode.
                                                     The pre-trigger asserts one peripheral clock cycle after
                                                     a rising edge is detected on selected trigger input source
                                                     or software trigger is selected and SWTRIG is written with
                                                     1.                                                                        */
  PDB0_CHC1_CHC1_CH1C1_TOS_1           = 1,     /*!< 1 : PDB channels corresponding pre-trigger asserts when the
                                                     counter reaches the channel delay register and one peripheral
                                                     clock cycle after a rising edge is detected on selected
                                                     trigger input source or software trigger is selected and
                                                     SWTRIG is written with 1.                                                 */
} PDB0_CHC1_CHC1_CH1C1_TOS_Enum;

/* ==============================================  PDB0 PDB0_CH1C1 BB [16..23]  ============================================== */
typedef enum {                                  /*!< PDB0_CHC1_CHC1_CH1C1_BB                                                   */
  PDB0_CHC1_CHC1_CH1C1_BB_0            = 0,     /*!< 0 : PDB channels corresponding pre-trigger back-to-back operation
                                                     disabled.                                                                 */
  PDB0_CHC1_CHC1_CH1C1_BB_1            = 1,     /*!< 1 : PDB channels corresponding pre-trigger back-to-back operation
                                                     enabled.                                                                  */
} PDB0_CHC1_CHC1_CH1C1_BB_Enum;

/* =======================================================  PDB0_CH0S  ======================================================= */
/* ===============================================  PDB0 PDB0_CH0S ERR [0..7]  =============================================== */
typedef enum {                                  /*!< PDB0_CHS_CHS_CH0S_ERR                                                     */
  PDB0_CHS_CHS_CH0S_ERR_0              = 0,     /*!< 0 : Sequence error not detected on PDB channels corresponding
                                                     pre-trigger.                                                              */
  PDB0_CHS_CHS_CH0S_ERR_1              = 1,     /*!< 1 : Sequence error detected on PDB channels corresponding pre-trigger.
                                                     ADCn block can be triggered for a conversion by one pre-trigger
                                                     from PDB channel n. When one conversion, which is triggered
                                                     by one of the pre-triggers from PDB channel n, is in progress,
                                                     new trigger from PDB channels corresponding pre-trigger
                                                     m cannot be accepted by ADCn, and ERR[m] is set. Writing
                                                     0s to clear the sequence error flags.                                     */
} PDB0_CHS_CHS_CH0S_ERR_Enum;

/* =======================================================  PDB0_CH1S  ======================================================= */
/* ===============================================  PDB0 PDB0_CH1S ERR [0..7]  =============================================== */
typedef enum {                                  /*!< PDB0_CHS_CHS_CH1S_ERR                                                     */
  PDB0_CHS_CHS_CH1S_ERR_0              = 0,     /*!< 0 : Sequence error not detected on PDB channels corresponding
                                                     pre-trigger.                                                              */
  PDB0_CHS_CHS_CH1S_ERR_1              = 1,     /*!< 1 : Sequence error detected on PDB channels corresponding pre-trigger.
                                                     ADCn block can be triggered for a conversion by one pre-trigger
                                                     from PDB channel n. When one conversion, which is triggered
                                                     by one of the pre-triggers from PDB channel n, is in progress,
                                                     new trigger from PDB channels corresponding pre-trigger
                                                     m cannot be accepted by ADCn, and ERR[m] is set. Writing
                                                     0s to clear the sequence error flags.                                     */
} PDB0_CHS_CHS_CH1S_ERR_Enum;

/* =====================================================  PDB0_CH0DLY0  ====================================================== */
/* =====================================================  PDB0_CH1DLY0  ====================================================== */
/* =====================================================  PDB0_CH0DLY1  ====================================================== */
/* =====================================================  PDB0_CH1DLY1  ====================================================== */
/* =====================================================  PDB0_CH0DLY2  ====================================================== */
/* =====================================================  PDB0_CH1DLY2  ====================================================== */
/* =====================================================  PDB0_CH0DLY3  ====================================================== */
/* =====================================================  PDB0_CH1DLY3  ====================================================== */
/* =====================================================  PDB0_CH0DLY4  ====================================================== */
/* =====================================================  PDB0_CH1DLY4  ====================================================== */
/* =====================================================  PDB0_CH0DLY5  ====================================================== */
/* =====================================================  PDB0_CH1DLY5  ====================================================== */
/* =====================================================  PDB0_CH0DLY6  ====================================================== */
/* =====================================================  PDB0_CH1DLY6  ====================================================== */
/* =====================================================  PDB0_CH0DLY7  ====================================================== */
/* =====================================================  PDB0_CH1DLY7  ====================================================== */
/* =======================================================  PDB0_POEN  ======================================================= */
/* ==============================================  PDB0 PDB0_POEN POEN [0..7]  =============================================== */
typedef enum {                                  /*!< PDB0_POEN_POEN                                                            */
  PDB0_POEN_POEN_0                     = 0,     /*!< 0 : PDB Pulse-Out disabled                                                */
  PDB0_POEN_POEN_1                     = 1,     /*!< 1 : PDB Pulse-Out enabled                                                 */
} PDB0_POEN_POEN_Enum;

/* ====================================================  PDB0_PODLY_PDB0  ==================================================== */
/* ====================================================  PDB0_DLY2_PDB0  ===================================================== */
/* =======================================================  PDB0_DLY1  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           LPIT0                                           ================ */
/* =========================================================================================================================== */

