nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =====================================================  LPIT0_SETTEN  ====================================================== */
/* =========================================  LPIT0 LPIT0_SETTEN SET_T_EN_0 [0..0]  ========================================== */
typedef enum {                                  /*!< LPIT0_SETTEN_SET_T_EN_0                                                   */
  LPIT0_SETTEN_SET_T_EN_0_0            = 0,     /*!< 0 : No effect                                                             */
  LPIT0_SETTEN_SET_T_EN_0_1            = 1,     /*!< 1 : Enables the Timer Channel 0                                           */
} LPIT0_SETTEN_SET_T_EN_0_Enum;

/* =========================================  LPIT0 LPIT0_SETTEN SET_T_EN_1 [1..1]  ========================================== */
typedef enum {                                  /*!< LPIT0_SETTEN_SET_T_EN_1                                                   */
  LPIT0_SETTEN_SET_T_EN_1_0            = 0,     /*!< 0 : No Effect                                                             */
  LPIT0_SETTEN_SET_T_EN_1_1            = 1,     /*!< 1 : Enables the Timer Channel 1                                           */
} LPIT0_SETTEN_SET_T_EN_1_Enum;

/* =========================================  LPIT0 LPIT0_SETTEN SET_T_EN_2 [2..2]  ========================================== */
typedef enum {                                  /*!< LPIT0_SETTEN_SET_T_EN_2                                                   */
  LPIT0_SETTEN_SET_T_EN_2_0            = 0,     /*!< 0 : No Effect                                                             */
  LPIT0_SETTEN_SET_T_EN_2_1            = 1,     /*!< 1 : Enables the Timer Channel 2                                           */
} LPIT0_SETTEN_SET_T_EN_2_Enum;

/* =========================================  LPIT0 LPIT0_SETTEN SET_T_EN_3 [3..3]  ========================================== */
typedef enum {                                  /*!< LPIT0_SETTEN_SET_T_EN_3                                                   */
  LPIT0_SETTEN_SET_T_EN_3_0            = 0,     /*!< 0 : No effect                                                             */
  LPIT0_SETTEN_SET_T_EN_3_1            = 1,     /*!< 1 : Enables the Timer Channel 3                                           */
} LPIT0_SETTEN_SET_T_EN_3_Enum;

/* =====================================================  LPIT0_CLRTEN  ====================================================== */
/* =========================================  LPIT0 LPIT0_CLRTEN CLR_T_EN_0 [0..0]  ========================================== */
typedef enum {                                  /*!< LPIT0_CLRTEN_CLR_T_EN_0                                                   */
  LPIT0_CLRTEN_CLR_T_EN_0_0            = 0,     /*!< 0 : No action                                                             */
  LPIT0_CLRTEN_CLR_T_EN_0_1            = 1,     /*!< 1 : Clear T_EN bit for Timer Channel 0                                    */
} LPIT0_CLRTEN_CLR_T_EN_0_Enum;

/* =========================================  LPIT0 LPIT0_CLRTEN CLR_T_EN_1 [1..1]  ========================================== */
typedef enum {                                  /*!< LPIT0_CLRTEN_CLR_T_EN_1                                                   */
  LPIT0_CLRTEN_CLR_T_EN_1_0            = 0,     /*!< 0 : No Action                                                             */
  LPIT0_CLRTEN_CLR_T_EN_1_1            = 1,     /*!< 1 : Clear T_EN bit for Timer Channel 1                                    */
} LPIT0_CLRTEN_CLR_T_EN_1_Enum;

/* =========================================  LPIT0 LPIT0_CLRTEN CLR_T_EN_2 [2..2]  ========================================== */
typedef enum {                                  /*!< LPIT0_CLRTEN_CLR_T_EN_2                                                   */
  LPIT0_CLRTEN_CLR_T_EN_2_0            = 0,     /*!< 0 : No Action                                                             */
  LPIT0_CLRTEN_CLR_T_EN_2_1            = 1,     /*!< 1 : Clear T_EN bit for Timer Channel 2                                    */
} LPIT0_CLRTEN_CLR_T_EN_2_Enum;

/* =========================================  LPIT0 LPIT0_CLRTEN CLR_T_EN_3 [3..3]  ========================================== */
typedef enum {                                  /*!< LPIT0_CLRTEN_CLR_T_EN_3                                                   */
  LPIT0_CLRTEN_CLR_T_EN_3_0            = 0,     /*!< 0 : No Action                                                             */
  LPIT0_CLRTEN_CLR_T_EN_3_1            = 1,     /*!< 1 : Clear T_EN bit for Timer Channel 3                                    */
} LPIT0_CLRTEN_CLR_T_EN_3_Enum;

/* ======================================================  LPIT0_TVAL0  ====================================================== */
/* ===========================================  LPIT0 LPIT0_TVAL0 TMR_VAL [0..31]  =========================================== */
typedef enum {                                  /*!< LPIT0_TVAL0_TMR_VAL                                                       */
  LPIT0_TVAL0_TMR_VAL_0                = 0,     /*!< 0 : Invalid load value in compare modes.                                  */
  LPIT0_TVAL0_TMR_VAL_1                = 1,     /*!< 1 : Invalid load value in compare modes.                                  */
} LPIT0_TVAL0_TMR_VAL_Enum;

/* ======================================================  LPIT0_CVAL0  ====================================================== */
/* =====================================================  LPIT0_TCTRL0  ====================================================== */
/* ============================================  LPIT0 LPIT0_TCTRL0 T_EN [0..0]  ============================================= */
typedef enum {                                  /*!< LPIT0_TCTRL0_T_EN                                                         */
  LPIT0_TCTRL0_T_EN_0                  = 0,     /*!< 0 : Timer Channel is disabled                                             */
  LPIT0_TCTRL0_T_EN_1                  = 1,     /*!< 1 : Timer Channel is enabled                                              */
} LPIT0_TCTRL0_T_EN_Enum;

/* ============================================  LPIT0 LPIT0_TCTRL0 CHAIN [1..1]  ============================================ */
typedef enum {                                  /*!< LPIT0_TCTRL0_CHAIN                                                        */
  LPIT0_TCTRL0_CHAIN_0                 = 0,     /*!< 0 : Channel Chaining is disabled. Channel Timer runs independently.       */
  LPIT0_TCTRL0_CHAIN_1                 = 1,     /*!< 1 : Channel Chaining is enabled. Timer decrements on previous
                                                     channels timeout                                                          */
} LPIT0_TCTRL0_CHAIN_Enum;

