nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  LPIT0 LPIT0_TCTRL0 MODE [2..3]  ============================================= */
typedef enum {                                  /*!< LPIT0_TCTRL0_MODE                                                         */
  LPIT0_TCTRL0_MODE_0                  = 0,     /*!< 0 : 32-bit Periodic Counter                                               */
  LPIT0_TCTRL0_MODE_1                  = 1,     /*!< 1 : Dual 16-bit Periodic Counter                                          */
  LPIT0_TCTRL0_MODE_10                 = 2,     /*!< 10 : 32-bit Trigger Accumulator                                           */
  LPIT0_TCTRL0_MODE_11                 = 3,     /*!< 11 : 32-bit Trigger Input Capture                                         */
} LPIT0_TCTRL0_MODE_Enum;

/* ===========================================  LPIT0 LPIT0_TCTRL0 TSOT [16..16]  ============================================ */
typedef enum {                                  /*!< LPIT0_TCTRL0_TSOT                                                         */
  LPIT0_TCTRL0_TSOT_0                  = 0,     /*!< 0 : Timer starts to decrement immediately based on restart condition
                                                     (controlled by TSOI bit)                                                  */
  LPIT0_TCTRL0_TSOT_1                  = 1,     /*!< 1 : Timer starts to decrement when rising edge on selected trigger
                                                     is detected                                                               */
} LPIT0_TCTRL0_TSOT_Enum;

/* ===========================================  LPIT0 LPIT0_TCTRL0 TSOI [17..17]  ============================================ */
typedef enum {                                  /*!< LPIT0_TCTRL0_TSOI                                                         */
  LPIT0_TCTRL0_TSOI_0                  = 0,     /*!< 0 : The channel timer does not stop after timeout.                        */
  LPIT0_TCTRL0_TSOI_1                  = 1,     /*!< 1 : The channel timer will stop after a timeout, and the channel
                                                     timer will restart based on TSOT. When TSOT = 0, the channel
                                                     timer will restart after a rising edge on the T_EN bit
                                                     is detected (which means that the timer channel is disabled
                                                     and then enabled); when TSOT = 1, the channel timer will
                                                     restart after a rising edge on the selected trigger is
                                                     detected.                                                                 */
} LPIT0_TCTRL0_TSOI_Enum;

/* ===========================================  LPIT0 LPIT0_TCTRL0 TROT [18..18]  ============================================ */
typedef enum {                                  /*!< LPIT0_TCTRL0_TROT                                                         */
  LPIT0_TCTRL0_TROT_0                  = 0,     /*!< 0 : Timer will not reload on selected trigger                             */
  LPIT0_TCTRL0_TROT_1                  = 1,     /*!< 1 : Timer will reload on selected trigger                                 */
} LPIT0_TCTRL0_TROT_Enum;

/* ==========================================  LPIT0 LPIT0_TCTRL0 TRG_SRC [23..23]  ========================================== */
typedef enum {                                  /*!< LPIT0_TCTRL0_TRG_SRC                                                      */
  LPIT0_TCTRL0_TRG_SRC_0               = 0,     /*!< 0 : Trigger source selected in external                                   */
  LPIT0_TCTRL0_TRG_SRC_1               = 1,     /*!< 1 : Trigger source selected is the internal trigger                       */
} LPIT0_TCTRL0_TRG_SRC_Enum;

/* ======================================================  LPIT0_TVAL1  ====================================================== */
/* ===========================================  LPIT0 LPIT0_TVAL1 TMR_VAL [0..31]  =========================================== */
typedef enum {                                  /*!< LPIT0_TVAL1_TMR_VAL                                                       */
  LPIT0_TVAL1_TMR_VAL_0                = 0,     /*!< 0 : Invalid load value in compare modes.                                  */
  LPIT0_TVAL1_TMR_VAL_1                = 1,     /*!< 1 : Invalid load value in compare modes.                                  */
} LPIT0_TVAL1_TMR_VAL_Enum;

/* ======================================================  LPIT0_CVAL1  ====================================================== */
/* =====================================================  LPIT0_TCTRL1  ====================================================== */
/* ============================================  LPIT0 LPIT0_TCTRL1 T_EN [0..0]  ============================================= */
typedef enum {                                  /*!< LPIT0_TCTRL1_T_EN                                                         */
  LPIT0_TCTRL1_T_EN_0                  = 0,     /*!< 0 : Timer Channel is disabled                                             */
  LPIT0_TCTRL1_T_EN_1                  = 1,     /*!< 1 : Timer Channel is enabled                                              */
} LPIT0_TCTRL1_T_EN_Enum;

/* ============================================  LPIT0 LPIT0_TCTRL1 CHAIN [1..1]  ============================================ */
typedef enum {                                  /*!< LPIT0_TCTRL1_CHAIN                                                        */
  LPIT0_TCTRL1_CHAIN_0                 = 0,     /*!< 0 : Channel Chaining is disabled. Channel Timer runs independently.       */
  LPIT0_TCTRL1_CHAIN_1                 = 1,     /*!< 1 : Channel Chaining is enabled. Timer decrements on previous
                                                     channels timeout                                                          */
} LPIT0_TCTRL1_CHAIN_Enum;

