nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  LPIT0 LPIT0_TCTRL3 MODE [2..3]  ============================================= */
typedef enum {                                  /*!< LPIT0_TCTRL3_MODE                                                         */
  LPIT0_TCTRL3_MODE_0                  = 0,     /*!< 0 : 32-bit Periodic Counter                                               */
  LPIT0_TCTRL3_MODE_1                  = 1,     /*!< 1 : Dual 16-bit Periodic Counter                                          */
  LPIT0_TCTRL3_MODE_10                 = 2,     /*!< 10 : 32-bit Trigger Accumulator                                           */
  LPIT0_TCTRL3_MODE_11                 = 3,     /*!< 11 : 32-bit Trigger Input Capture                                         */
} LPIT0_TCTRL3_MODE_Enum;

/* ===========================================  LPIT0 LPIT0_TCTRL3 TSOT [16..16]  ============================================ */
typedef enum {                                  /*!< LPIT0_TCTRL3_TSOT                                                         */
  LPIT0_TCTRL3_TSOT_0                  = 0,     /*!< 0 : Timer starts to decrement immediately based on restart condition
                                                     (controlled by TSOI bit)                                                  */
  LPIT0_TCTRL3_TSOT_1                  = 1,     /*!< 1 : Timer starts to decrement when rising edge on selected trigger
                                                     is detected                                                               */
} LPIT0_TCTRL3_TSOT_Enum;

/* ===========================================  LPIT0 LPIT0_TCTRL3 TSOI [17..17]  ============================================ */
typedef enum {                                  /*!< LPIT0_TCTRL3_TSOI                                                         */
  LPIT0_TCTRL3_TSOI_0                  = 0,     /*!< 0 : The channel timer does not stop after timeout.                        */
  LPIT0_TCTRL3_TSOI_1                  = 1,     /*!< 1 : The channel timer will stop after a timeout, and the channel
                                                     timer will restart based on TSOT. When TSOT = 0, the channel
                                                     timer will restart after a rising edge on the T_EN bit
                                                     is detected (which means that the timer channel is disabled
                                                     and then enabled); when TSOT = 1, the channel timer will
                                                     restart after a rising edge on the selected trigger is
                                                     detected.                                                                 */
} LPIT0_TCTRL3_TSOI_Enum;

/* ===========================================  LPIT0 LPIT0_TCTRL3 TROT [18..18]  ============================================ */
typedef enum {                                  /*!< LPIT0_TCTRL3_TROT                                                         */
  LPIT0_TCTRL3_TROT_0                  = 0,     /*!< 0 : Timer will not reload on selected trigger                             */
  LPIT0_TCTRL3_TROT_1                  = 1,     /*!< 1 : Timer will reload on selected trigger                                 */
} LPIT0_TCTRL3_TROT_Enum;

/* ==========================================  LPIT0 LPIT0_TCTRL3 TRG_SRC [23..23]  ========================================== */
typedef enum {                                  /*!< LPIT0_TCTRL3_TRG_SRC                                                      */
  LPIT0_TCTRL3_TRG_SRC_0               = 0,     /*!< 0 : Trigger source selected in external                                   */
  LPIT0_TCTRL3_TRG_SRC_1               = 1,     /*!< 1 : Trigger source selected is the internal trigger                       */
} LPIT0_TCTRL3_TRG_SRC_Enum;



/* =========================================================================================================================== */
/* ================                                           FTM0                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  FTM0_SC  ======================================================== */
/* ================================================  FTM0 FTM0_SC PS [0..2]  ================================================= */
typedef enum {                                  /*!< FTM0_SC_PS                                                                */
  FTM0_SC_PS_000                       = 0,     /*!< 000 : Divide by 1                                                         */
  FTM0_SC_PS_001                       = 1,     /*!< 001 : Divide by 2                                                         */
  FTM0_SC_PS_010                       = 2,     /*!< 010 : Divide by 4                                                         */
  FTM0_SC_PS_011                       = 3,     /*!< 011 : Divide by 8                                                         */
  FTM0_SC_PS_100                       = 4,     /*!< 100 : Divide by 16                                                        */
  FTM0_SC_PS_101                       = 5,     /*!< 101 : Divide by 32                                                        */
  FTM0_SC_PS_110                       = 6,     /*!< 110 : Divide by 64                                                        */
  FTM0_SC_PS_111                       = 7,     /*!< 111 : Divide by 128                                                       */
} FTM0_SC_PS_Enum;

/* ===============================================  FTM0 FTM0_SC CLKS [3..4]  ================================================ */
typedef enum {                                  /*!< FTM0_SC_CLKS                                                              */
  FTM0_SC_CLKS_00                      = 0,     /*!< 00 : No clock selected. This in effect disables the FTM counter.          */
  FTM0_SC_CLKS_01                      = 1,     /*!< 01 : FTM input clock                                                      */
  FTM0_SC_CLKS_10                      = 2,     /*!< 10 : Fixed frequency clock                                                */
  FTM0_SC_CLKS_11                      = 3,     /*!< 11 : External clock                                                       */
} FTM0_SC_CLKS_Enum;

/* ===============================================  FTM0 FTM0_SC CPWMS [5..5]  =============================================== */
typedef enum {                                  /*!< FTM0_SC_CPWMS                                                             */
  FTM0_SC_CPWMS_0                      = 0,     /*!< 0 : FTM counter operates in Up Counting mode.                             */
  FTM0_SC_CPWMS_1                      = 1,     /*!< 1 : FTM counter operates in Up-Down Counting mode.                        */
} FTM0_SC_CPWMS_Enum;

/* ================================================  FTM0 FTM0_SC RIE [6..6]  ================================================ */
typedef enum {                                  /*!< FTM0_SC_RIE                                                               */
  FTM0_SC_RIE_0                        = 0,     /*!< 0 : Reload point interrupt is disabled.                                   */
  FTM0_SC_RIE_1                        = 1,     /*!< 1 : Reload point interrupt is enabled.                                    */
} FTM0_SC_RIE_Enum;

/* ================================================  FTM0 FTM0_SC RF [7..7]  ================================================= */
typedef enum {                                  /*!< FTM0_SC_RF                                                                */
  FTM0_SC_RF_0                         = 0,     /*!< 0 : A selected reload point did not happen.                               */
  FTM0_SC_RF_1                         = 1,     /*!< 1 : A selected reload point happened.                                     */
} FTM0_SC_RF_Enum;

/* ===============================================  FTM0 FTM0_SC TOIE [8..8]  ================================================ */
typedef enum {                                  /*!< FTM0_SC_TOIE                                                              */
  FTM0_SC_TOIE_0                       = 0,     /*!< 0 : Disable TOF interrupts. Use software polling.                         */
  FTM0_SC_TOIE_1                       = 1,     /*!< 1 : Enable TOF interrupts. An interrupt is generated when TOF
                                                     equals one.                                                               */
} FTM0_SC_TOIE_Enum;

/* ================================================  FTM0 FTM0_SC TOF [9..9]  ================================================ */
typedef enum {                                  /*!< FTM0_SC_TOF                                                               */
  FTM0_SC_TOF_0                        = 0,     /*!< 0 : FTM counter has not overflowed.                                       */
  FTM0_SC_TOF_1                        = 1,     /*!< 1 : FTM counter has overflowed.                                           */
} FTM0_SC_TOF_Enum;

/* =============================================  FTM0 FTM0_SC PWMEN0 [16..16]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_PWMEN0                                                            */
  FTM0_SC_PWMEN0_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM0_SC_PWMEN0_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM0_SC_PWMEN0_Enum;

