nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  FTM0 FTM0_SC PWMEN1 [17..17]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_PWMEN1                                                            */
  FTM0_SC_PWMEN1_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM0_SC_PWMEN1_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM0_SC_PWMEN1_Enum;

/* =============================================  FTM0 FTM0_SC PWMEN2 [18..18]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_PWMEN2                                                            */
  FTM0_SC_PWMEN2_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM0_SC_PWMEN2_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM0_SC_PWMEN2_Enum;

/* =============================================  FTM0 FTM0_SC PWMEN3 [19..19]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_PWMEN3                                                            */
  FTM0_SC_PWMEN3_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM0_SC_PWMEN3_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM0_SC_PWMEN3_Enum;

/* =============================================  FTM0 FTM0_SC PWMEN4 [20..20]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_PWMEN4                                                            */
  FTM0_SC_PWMEN4_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM0_SC_PWMEN4_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM0_SC_PWMEN4_Enum;

/* =============================================  FTM0 FTM0_SC PWMEN5 [21..21]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_PWMEN5                                                            */
  FTM0_SC_PWMEN5_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM0_SC_PWMEN5_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM0_SC_PWMEN5_Enum;

/* =============================================  FTM0 FTM0_SC PWMEN6 [22..22]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_PWMEN6                                                            */
  FTM0_SC_PWMEN6_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM0_SC_PWMEN6_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM0_SC_PWMEN6_Enum;

/* =============================================  FTM0 FTM0_SC PWMEN7 [23..23]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_PWMEN7                                                            */
  FTM0_SC_PWMEN7_0                     = 0,     /*!< 0 : Channel output port is disabled                                       */
  FTM0_SC_PWMEN7_1                     = 1,     /*!< 1 : Channel output port is enabled                                        */
} FTM0_SC_PWMEN7_Enum;

/* ==============================================  FTM0 FTM0_SC FLTPS [24..27]  ============================================== */
typedef enum {                                  /*!< FTM0_SC_FLTPS                                                             */
  FTM0_SC_FLTPS_0000                   = 0,     /*!< 0000 : Divide by 1                                                        */
  FTM0_SC_FLTPS_0001                   = 1,     /*!< 0001 : Divide by 2                                                        */
  FTM0_SC_FLTPS_0010                   = 2,     /*!< 0010 : Divide by 3                                                        */
  FTM0_SC_FLTPS_0011                   = 3,     /*!< 0011 : Divide by 4                                                        */
  FTM0_SC_FLTPS_0100                   = 4,     /*!< 0100 : Divide by 5                                                        */
  FTM0_SC_FLTPS_0101                   = 5,     /*!< 0101 : Divide by 6                                                        */
  FTM0_SC_FLTPS_0110                   = 6,     /*!< 0110 : Divide by 7                                                        */
  FTM0_SC_FLTPS_0111                   = 7,     /*!< 0111 : Divide by 8                                                        */
  FTM0_SC_FLTPS_1000                   = 8,     /*!< 1000 : Divide by 9                                                        */
  FTM0_SC_FLTPS_1001                   = 9,     /*!< 1001 : Divide by 10                                                       */
  FTM0_SC_FLTPS_1010                   = 10,    /*!< 1010 : Divide by 11                                                       */
  FTM0_SC_FLTPS_1011                   = 11,    /*!< 1011 : Divide by 12                                                       */
  FTM0_SC_FLTPS_1100                   = 12,    /*!< 1100 : Divide by 13                                                       */
  FTM0_SC_FLTPS_1101                   = 13,    /*!< 1101 : Divide by 14                                                       */
  FTM0_SC_FLTPS_1110                   = 14,    /*!< 1110 : Divide by 15                                                       */
  FTM0_SC_FLTPS_1111                   = 15,    /*!< 1111 : Divide by 16                                                       */
} FTM0_SC_FLTPS_Enum;

/* =======================================================  FTM0_CNT  ======================================================== */
/* =======================================================  FTM0_MOD  ======================================================== */
/* =======================================================  FTM0_C0SC  ======================================================= */
/* ===============================================  FTM0 FTM0_C0SC DMA [0..0]  =============================================== */
typedef enum {                                  /*!< FTM0_C0SC_DMA                                                             */
  FTM0_C0SC_DMA_0                      = 0,     /*!< 0 : Disable DMA transfers.                                                */
  FTM0_C0SC_DMA_1                      = 1,     /*!< 1 : Enable DMA transfers.                                                 */
} FTM0_C0SC_DMA_Enum;

/* ==============================================  FTM0 FTM0_C0SC ICRST [1..1]  ============================================== */
typedef enum {                                  /*!< FTM0_C0SC_ICRST                                                           */
  FTM0_C0SC_ICRST_0                    = 0,     /*!< 0 : FTM counter is not reset when the selected channel (n) input
                                                     event is detected.                                                        */
  FTM0_C0SC_ICRST_1                    = 1,     /*!< 1 : FTM counter is reset when the selected channel (n) input
                                                     event is detected.                                                        */
} FTM0_C0SC_ICRST_Enum;

/* ==============================================  FTM0 FTM0_C0SC CHIE [6..6]  =============================================== */
typedef enum {                                  /*!< FTM0_C0SC_CHIE                                                            */
  FTM0_C0SC_CHIE_0                     = 0,     /*!< 0 : Disable channel (n) interrupt. Use software polling.                  */
  FTM0_C0SC_CHIE_1                     = 1,     /*!< 1 : Enable channel (n) interrupt.                                         */
} FTM0_C0SC_CHIE_Enum;

/* ===============================================  FTM0 FTM0_C0SC CHF [7..7]  =============================================== */
typedef enum {                                  /*!< FTM0_C0SC_CHF                                                             */
  FTM0_C0SC_CHF_0                      = 0,     /*!< 0 : No channel (n) event has occurred.                                    */
  FTM0_C0SC_CHF_1                      = 1,     /*!< 1 : A channel (n) event has occurred.                                     */
} FTM0_C0SC_CHF_Enum;

/* ============================================  FTM0 FTM0_C0SC TRIGMODE [8..8]  ============================================= */
typedef enum {                                  /*!< FTM0_C0SC_TRIGMODE                                                        */
  FTM0_C0SC_TRIGMODE_0                 = 0,     /*!< 0 : Channel outputs will generate the normal PWM outputs without
                                                     generating a pulse.                                                       */
  FTM0_C0SC_TRIGMODE_1                 = 1,     /*!< 1 : If a match in the channel occurs, a trigger generation on
                                                     channel output will happen. The trigger pulse width has
                                                     one FTM clock cycle.                                                      */
} FTM0_C0SC_TRIGMODE_Enum;

/* ==============================================  FTM0 FTM0_C0SC CHIS [9..9]  =============================================== */
typedef enum {                                  /*!< FTM0_C0SC_CHIS                                                            */
  FTM0_C0SC_CHIS_0                     = 0,     /*!< 0 : The channel (n) input is zero.                                        */
  FTM0_C0SC_CHIS_1                     = 1,     /*!< 1 : The channel (n) input is one.                                         */
} FTM0_C0SC_CHIS_Enum;

/* =============================================  FTM0 FTM0_C0SC CHOV [10..10]  ============================================== */
typedef enum {                                  /*!< FTM0_C0SC_CHOV                                                            */
  FTM0_C0SC_CHOV_0                     = 0,     /*!< 0 : The channel (n) output is zero.                                       */
  FTM0_C0SC_CHOV_1                     = 1,     /*!< 1 : The channel (n) output is one.                                        */
} FTM0_C0SC_CHOV_Enum;

/* =======================================================  FTM0_C0V  ======================================================== */
/* =======================================================  FTM0_C1SC  ======================================================= */
/* ===============================================  FTM0 FTM0_C1SC DMA [0..0]  =============================================== */
typedef enum {                                  /*!< FTM0_C1SC_DMA                                                             */
  FTM0_C1SC_DMA_0                      = 0,     /*!< 0 : Disable DMA transfers.                                                */
  FTM0_C1SC_DMA_1                      = 1,     /*!< 1 : Enable DMA transfers.                                                 */
} FTM0_C1SC_DMA_Enum;

/* ==============================================  FTM0 FTM0_C1SC ICRST [1..1]  ============================================== */
typedef enum {                                  /*!< FTM0_C1SC_ICRST                                                           */
  FTM0_C1SC_ICRST_0                    = 0,     /*!< 0 : FTM counter is not reset when the selected channel (n) input
                                                     event is detected.                                                        */
  FTM0_C1SC_ICRST_1                    = 1,     /*!< 1 : FTM counter is reset when the selected channel (n) input
                                                     event is detected.                                                        */
} FTM0_C1SC_ICRST_Enum;

/* ==============================================  FTM0 FTM0_C1SC CHIE [6..6]  =============================================== */
typedef enum {                                  /*!< FTM0_C1SC_CHIE                                                            */
  FTM0_C1SC_CHIE_0                     = 0,     /*!< 0 : Disable channel (n) interrupt. Use software polling.                  */
  FTM0_C1SC_CHIE_1                     = 1,     /*!< 1 : Enable channel (n) interrupt.                                         */
} FTM0_C1SC_CHIE_Enum;

/* ===============================================  FTM0 FTM0_C1SC CHF [7..7]  =============================================== */
typedef enum {                                  /*!< FTM0_C1SC_CHF                                                             */
  FTM0_C1SC_CHF_0                      = 0,     /*!< 0 : No channel (n) event has occurred.                                    */
  FTM0_C1SC_CHF_1                      = 1,     /*!< 1 : A channel (n) event has occurred.                                     */
} FTM0_C1SC_CHF_Enum;

/* ============================================  FTM0 FTM0_C1SC TRIGMODE [8..8]  ============================================= */
typedef enum {                                  /*!< FTM0_C1SC_TRIGMODE                                                        */
  FTM0_C1SC_TRIGMODE_0                 = 0,     /*!< 0 : Channel outputs will generate the normal PWM outputs without
                                                     generating a pulse.                                                       */
  FTM0_C1SC_TRIGMODE_1                 = 1,     /*!< 1 : If a match in the channel occurs, a trigger generation on
                                                     channel output will happen. The trigger pulse width has
                                                     one FTM clock cycle.                                                      */
} FTM0_C1SC_TRIGMODE_Enum;

/* ==============================================  FTM0 FTM0_C1SC CHIS [9..9]  =============================================== */
typedef enum {                                  /*!< FTM0_C1SC_CHIS                                                            */
  FTM0_C1SC_CHIS_0                     = 0,     /*!< 0 : The channel (n) input is zero.                                        */
  FTM0_C1SC_CHIS_1                     = 1,     /*!< 1 : The channel (n) input is one.                                         */
} FTM0_C1SC_CHIS_Enum;

/* =============================================  FTM0 FTM0_C1SC CHOV [10..10]  ============================================== */
typedef enum {                                  /*!< FTM0_C1SC_CHOV                                                            */
  FTM0_C1SC_CHOV_0                     = 0,     /*!< 0 : The channel (n) output is zero.                                       */
  FTM0_C1SC_CHOV_1                     = 1,     /*!< 1 : The channel (n) output is one.                                        */
} FTM0_C1SC_CHOV_Enum;

/* =======================================================  FTM0_C1V  ======================================================== */
/* =======================================================  FTM0_C2SC  ======================================================= */
/* ===============================================  FTM0 FTM0_C2SC DMA [0..0]  =============================================== */
typedef enum {                                  /*!< FTM0_C2SC_DMA                                                             */
  FTM0_C2SC_DMA_0                      = 0,     /*!< 0 : Disable DMA transfers.                                                */
  FTM0_C2SC_DMA_1                      = 1,     /*!< 1 : Enable DMA transfers.                                                 */
} FTM0_C2SC_DMA_Enum;

/* ==============================================  FTM0 FTM0_C2SC ICRST [1..1]  ============================================== */
typedef enum {                                  /*!< FTM0_C2SC_ICRST                                                           */
  FTM0_C2SC_ICRST_0                    = 0,     /*!< 0 : FTM counter is not reset when the selected channel (n) input
                                                     event is detected.                                                        */
  FTM0_C2SC_ICRST_1                    = 1,     /*!< 1 : FTM counter is reset when the selected channel (n) input
                                                     event is detected.                                                        */
} FTM0_C2SC_ICRST_Enum;

/* ==============================================  FTM0 FTM0_C2SC CHIE [6..6]  =============================================== */
typedef enum {                                  /*!< FTM0_C2SC_CHIE                                                            */
  FTM0_C2SC_CHIE_0                     = 0,     /*!< 0 : Disable channel (n) interrupt. Use software polling.                  */
  FTM0_C2SC_CHIE_1                     = 1,     /*!< 1 : Enable channel (n) interrupt.                                         */
} FTM0_C2SC_CHIE_Enum;

