nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =======================================================  FTM0_C5V  ======================================================== */
/* =======================================================  FTM0_C6SC  ======================================================= */
/* ===============================================  FTM0 FTM0_C6SC DMA [0..0]  =============================================== */
typedef enum {                                  /*!< FTM0_C6SC_DMA                                                             */
  FTM0_C6SC_DMA_0                      = 0,     /*!< 0 : Disable DMA transfers.                                                */
  FTM0_C6SC_DMA_1                      = 1,     /*!< 1 : Enable DMA transfers.                                                 */
} FTM0_C6SC_DMA_Enum;

/* ==============================================  FTM0 FTM0_C6SC ICRST [1..1]  ============================================== */
typedef enum {                                  /*!< FTM0_C6SC_ICRST                                                           */
  FTM0_C6SC_ICRST_0                    = 0,     /*!< 0 : FTM counter is not reset when the selected channel (n) input
                                                     event is detected.                                                        */
  FTM0_C6SC_ICRST_1                    = 1,     /*!< 1 : FTM counter is reset when the selected channel (n) input
                                                     event is detected.                                                        */
} FTM0_C6SC_ICRST_Enum;

/* ==============================================  FTM0 FTM0_C6SC CHIE [6..6]  =============================================== */
typedef enum {                                  /*!< FTM0_C6SC_CHIE                                                            */
  FTM0_C6SC_CHIE_0                     = 0,     /*!< 0 : Disable channel (n) interrupt. Use software polling.                  */
  FTM0_C6SC_CHIE_1                     = 1,     /*!< 1 : Enable channel (n) interrupt.                                         */
} FTM0_C6SC_CHIE_Enum;

/* ===============================================  FTM0 FTM0_C6SC CHF [7..7]  =============================================== */
typedef enum {                                  /*!< FTM0_C6SC_CHF                                                             */
  FTM0_C6SC_CHF_0                      = 0,     /*!< 0 : No channel (n) event has occurred.                                    */
  FTM0_C6SC_CHF_1                      = 1,     /*!< 1 : A channel (n) event has occurred.                                     */
} FTM0_C6SC_CHF_Enum;

/* ============================================  FTM0 FTM0_C6SC TRIGMODE [8..8]  ============================================= */
typedef enum {                                  /*!< FTM0_C6SC_TRIGMODE                                                        */
  FTM0_C6SC_TRIGMODE_0                 = 0,     /*!< 0 : Channel outputs will generate the normal PWM outputs without
                                                     generating a pulse.                                                       */
  FTM0_C6SC_TRIGMODE_1                 = 1,     /*!< 1 : If a match in the channel occurs, a trigger generation on
                                                     channel output will happen. The trigger pulse width has
                                                     one FTM clock cycle.                                                      */
} FTM0_C6SC_TRIGMODE_Enum;

/* ==============================================  FTM0 FTM0_C6SC CHIS [9..9]  =============================================== */
typedef enum {                                  /*!< FTM0_C6SC_CHIS                                                            */
  FTM0_C6SC_CHIS_0                     = 0,     /*!< 0 : The channel (n) input is zero.                                        */
  FTM0_C6SC_CHIS_1                     = 1,     /*!< 1 : The channel (n) input is one.                                         */
} FTM0_C6SC_CHIS_Enum;

/* =============================================  FTM0 FTM0_C6SC CHOV [10..10]  ============================================== */
typedef enum {                                  /*!< FTM0_C6SC_CHOV                                                            */
  FTM0_C6SC_CHOV_0                     = 0,     /*!< 0 : The channel (n) output is zero.                                       */
  FTM0_C6SC_CHOV_1                     = 1,     /*!< 1 : The channel (n) output is one.                                        */
} FTM0_C6SC_CHOV_Enum;

/* =======================================================  FTM0_C6V  ======================================================== */
/* =======================================================  FTM0_C7SC  ======================================================= */
/* ===============================================  FTM0 FTM0_C7SC DMA [0..0]  =============================================== */
typedef enum {                                  /*!< FTM0_C7SC_DMA                                                             */
  FTM0_C7SC_DMA_0                      = 0,     /*!< 0 : Disable DMA transfers.                                                */
  FTM0_C7SC_DMA_1                      = 1,     /*!< 1 : Enable DMA transfers.                                                 */
} FTM0_C7SC_DMA_Enum;

/* ==============================================  FTM0 FTM0_C7SC ICRST [1..1]  ============================================== */
typedef enum {                                  /*!< FTM0_C7SC_ICRST                                                           */
  FTM0_C7SC_ICRST_0                    = 0,     /*!< 0 : FTM counter is not reset when the selected channel (n) input
                                                     event is detected.                                                        */
  FTM0_C7SC_ICRST_1                    = 1,     /*!< 1 : FTM counter is reset when the selected channel (n) input
                                                     event is detected.                                                        */
} FTM0_C7SC_ICRST_Enum;

