nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  FTM0 FTM0_C7SC CHIE [6..6]  =============================================== */
typedef enum {                                  /*!< FTM0_C7SC_CHIE                                                            */
  FTM0_C7SC_CHIE_0                     = 0,     /*!< 0 : Disable channel (n) interrupt. Use software polling.                  */
  FTM0_C7SC_CHIE_1                     = 1,     /*!< 1 : Enable channel (n) interrupt.                                         */
} FTM0_C7SC_CHIE_Enum;

/* ===============================================  FTM0 FTM0_C7SC CHF [7..7]  =============================================== */
typedef enum {                                  /*!< FTM0_C7SC_CHF                                                             */
  FTM0_C7SC_CHF_0                      = 0,     /*!< 0 : No channel (n) event has occurred.                                    */
  FTM0_C7SC_CHF_1                      = 1,     /*!< 1 : A channel (n) event has occurred.                                     */
} FTM0_C7SC_CHF_Enum;

/* ============================================  FTM0 FTM0_C7SC TRIGMODE [8..8]  ============================================= */
typedef enum {                                  /*!< FTM0_C7SC_TRIGMODE                                                        */
  FTM0_C7SC_TRIGMODE_0                 = 0,     /*!< 0 : Channel outputs will generate the normal PWM outputs without
                                                     generating a pulse.                                                       */
  FTM0_C7SC_TRIGMODE_1                 = 1,     /*!< 1 : If a match in the channel occurs, a trigger generation on
                                                     channel output will happen. The trigger pulse width has
                                                     one FTM clock cycle.                                                      */
} FTM0_C7SC_TRIGMODE_Enum;

/* ==============================================  FTM0 FTM0_C7SC CHIS [9..9]  =============================================== */
typedef enum {                                  /*!< FTM0_C7SC_CHIS                                                            */
  FTM0_C7SC_CHIS_0                     = 0,     /*!< 0 : The channel (n) input is zero.                                        */
  FTM0_C7SC_CHIS_1                     = 1,     /*!< 1 : The channel (n) input is one.                                         */
} FTM0_C7SC_CHIS_Enum;

/* =============================================  FTM0 FTM0_C7SC CHOV [10..10]  ============================================== */
typedef enum {                                  /*!< FTM0_C7SC_CHOV                                                            */
  FTM0_C7SC_CHOV_0                     = 0,     /*!< 0 : The channel (n) output is zero.                                       */
  FTM0_C7SC_CHOV_1                     = 1,     /*!< 1 : The channel (n) output is one.                                        */
} FTM0_C7SC_CHOV_Enum;

/* =======================================================  FTM0_C7V  ======================================================== */
/* ======================================================  FTM0_CNTIN  ======================================================= */
/* ======================================================  FTM0_STATUS  ====================================================== */
/* =============================================  FTM0 FTM0_STATUS CH0F [0..0]  ============================================== */
typedef enum {                                  /*!< FTM0_STATUS_CH0F                                                          */
  FTM0_STATUS_CH0F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM0_STATUS_CH0F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM0_STATUS_CH0F_Enum;

/* =============================================  FTM0 FTM0_STATUS CH1F [1..1]  ============================================== */
typedef enum {                                  /*!< FTM0_STATUS_CH1F                                                          */
  FTM0_STATUS_CH1F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM0_STATUS_CH1F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM0_STATUS_CH1F_Enum;

/* =============================================  FTM0 FTM0_STATUS CH2F [2..2]  ============================================== */
typedef enum {                                  /*!< FTM0_STATUS_CH2F                                                          */
  FTM0_STATUS_CH2F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM0_STATUS_CH2F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM0_STATUS_CH2F_Enum;

/* =============================================  FTM0 FTM0_STATUS CH3F [3..3]  ============================================== */
typedef enum {                                  /*!< FTM0_STATUS_CH3F                                                          */
  FTM0_STATUS_CH3F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM0_STATUS_CH3F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM0_STATUS_CH3F_Enum;

/* =============================================  FTM0 FTM0_STATUS CH4F [4..4]  ============================================== */
typedef enum {                                  /*!< FTM0_STATUS_CH4F                                                          */
  FTM0_STATUS_CH4F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM0_STATUS_CH4F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM0_STATUS_CH4F_Enum;

/* =============================================  FTM0 FTM0_STATUS CH5F [5..5]  ============================================== */
typedef enum {                                  /*!< FTM0_STATUS_CH5F                                                          */
  FTM0_STATUS_CH5F_0                   = 0,     /*!< 0 : No channel event has occurred.                                        */
  FTM0_STATUS_CH5F_1                   = 1,     /*!< 1 : A channel event has occurred.                                         */
} FTM0_STATUS_CH5F_Enum;

