nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  FTM0 FTM0_SYNC TRIG1 [5..5]  ============================================== */
typedef enum {                                  /*!< FTM0_SYNC_TRIG1                                                           */
  FTM0_SYNC_TRIG1_0                    = 0,     /*!< 0 : Trigger is disabled.                                                  */
  FTM0_SYNC_TRIG1_1                    = 1,     /*!< 1 : Trigger is enabled.                                                   */
} FTM0_SYNC_TRIG1_Enum;

/* ==============================================  FTM0 FTM0_SYNC TRIG2 [6..6]  ============================================== */
typedef enum {                                  /*!< FTM0_SYNC_TRIG2                                                           */
  FTM0_SYNC_TRIG2_0                    = 0,     /*!< 0 : Trigger is disabled.                                                  */
  FTM0_SYNC_TRIG2_1                    = 1,     /*!< 1 : Trigger is enabled.                                                   */
} FTM0_SYNC_TRIG2_Enum;

/* =============================================  FTM0 FTM0_SYNC SWSYNC [7..7]  ============================================== */
typedef enum {                                  /*!< FTM0_SYNC_SWSYNC                                                          */
  FTM0_SYNC_SWSYNC_0                   = 0,     /*!< 0 : Software trigger is not selected.                                     */
  FTM0_SYNC_SWSYNC_1                   = 1,     /*!< 1 : Software trigger is selected.                                         */
} FTM0_SYNC_SWSYNC_Enum;

/* =====================================================  FTM0_OUTINIT  ====================================================== */
/* ============================================  FTM0 FTM0_OUTINIT CH0OI [0..0]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTINIT_CH0OI                                                        */
  FTM0_OUTINIT_CH0OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM0_OUTINIT_CH0OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM0_OUTINIT_CH0OI_Enum;

/* ============================================  FTM0 FTM0_OUTINIT CH1OI [1..1]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTINIT_CH1OI                                                        */
  FTM0_OUTINIT_CH1OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM0_OUTINIT_CH1OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM0_OUTINIT_CH1OI_Enum;

/* ============================================  FTM0 FTM0_OUTINIT CH2OI [2..2]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTINIT_CH2OI                                                        */
  FTM0_OUTINIT_CH2OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM0_OUTINIT_CH2OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM0_OUTINIT_CH2OI_Enum;

/* ============================================  FTM0 FTM0_OUTINIT CH3OI [3..3]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTINIT_CH3OI                                                        */
  FTM0_OUTINIT_CH3OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM0_OUTINIT_CH3OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM0_OUTINIT_CH3OI_Enum;

/* ============================================  FTM0 FTM0_OUTINIT CH4OI [4..4]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTINIT_CH4OI                                                        */
  FTM0_OUTINIT_CH4OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM0_OUTINIT_CH4OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM0_OUTINIT_CH4OI_Enum;

/* ============================================  FTM0 FTM0_OUTINIT CH5OI [5..5]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTINIT_CH5OI                                                        */
  FTM0_OUTINIT_CH5OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM0_OUTINIT_CH5OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM0_OUTINIT_CH5OI_Enum;

/* ============================================  FTM0 FTM0_OUTINIT CH6OI [6..6]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTINIT_CH6OI                                                        */
  FTM0_OUTINIT_CH6OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM0_OUTINIT_CH6OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM0_OUTINIT_CH6OI_Enum;

/* ============================================  FTM0 FTM0_OUTINIT CH7OI [7..7]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTINIT_CH7OI                                                        */
  FTM0_OUTINIT_CH7OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM0_OUTINIT_CH7OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM0_OUTINIT_CH7OI_Enum;

/* =====================================================  FTM0_OUTMASK  ====================================================== */
/* ============================================  FTM0 FTM0_OUTMASK CH0OM [0..0]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTMASK_CH0OM                                                        */
  FTM0_OUTMASK_CH0OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM0_OUTMASK_CH0OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM0_OUTMASK_CH0OM_Enum;

/* ============================================  FTM0 FTM0_OUTMASK CH1OM [1..1]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTMASK_CH1OM                                                        */
  FTM0_OUTMASK_CH1OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM0_OUTMASK_CH1OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM0_OUTMASK_CH1OM_Enum;

