nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  FTM0 FTM0_OUTMASK CH2OM [2..2]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTMASK_CH2OM                                                        */
  FTM0_OUTMASK_CH2OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM0_OUTMASK_CH2OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM0_OUTMASK_CH2OM_Enum;

/* ============================================  FTM0 FTM0_OUTMASK CH3OM [3..3]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTMASK_CH3OM                                                        */
  FTM0_OUTMASK_CH3OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM0_OUTMASK_CH3OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM0_OUTMASK_CH3OM_Enum;

/* ============================================  FTM0 FTM0_OUTMASK CH4OM [4..4]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTMASK_CH4OM                                                        */
  FTM0_OUTMASK_CH4OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM0_OUTMASK_CH4OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM0_OUTMASK_CH4OM_Enum;

/* ============================================  FTM0 FTM0_OUTMASK CH5OM [5..5]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTMASK_CH5OM                                                        */
  FTM0_OUTMASK_CH5OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM0_OUTMASK_CH5OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM0_OUTMASK_CH5OM_Enum;

/* ============================================  FTM0 FTM0_OUTMASK CH6OM [6..6]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTMASK_CH6OM                                                        */
  FTM0_OUTMASK_CH6OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM0_OUTMASK_CH6OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM0_OUTMASK_CH6OM_Enum;

/* ============================================  FTM0 FTM0_OUTMASK CH7OM [7..7]  ============================================= */
typedef enum {                                  /*!< FTM0_OUTMASK_CH7OM                                                        */
  FTM0_OUTMASK_CH7OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM0_OUTMASK_CH7OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM0_OUTMASK_CH7OM_Enum;

/* =====================================================  FTM0_COMBINE  ====================================================== */
/* ============================================  FTM0 FTM0_COMBINE COMP0 [1..1]  ============================================= */
typedef enum {                                  /*!< FTM0_COMBINE_COMP0                                                        */
  FTM0_COMBINE_COMP0_0                 = 0,     /*!< 0 : The channel (n+1) output is the same as the channel (n)
                                                     output.                                                                   */
  FTM0_COMBINE_COMP0_1                 = 1,     /*!< 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */
} FTM0_COMBINE_COMP0_Enum;

/* ============================================  FTM0 FTM0_COMBINE DECAP0 [3..3]  ============================================ */
typedef enum {                                  /*!< FTM0_COMBINE_DECAP0                                                       */
  FTM0_COMBINE_DECAP0_0                = 0,     /*!< 0 : The dual edge captures are inactive.                                  */
  FTM0_COMBINE_DECAP0_1                = 1,     /*!< 1 : The dual edge captures are active.                                    */
} FTM0_COMBINE_DECAP0_Enum;

/* ============================================  FTM0 FTM0_COMBINE DTEN0 [4..4]  ============================================= */
typedef enum {                                  /*!< FTM0_COMBINE_DTEN0                                                        */
  FTM0_COMBINE_DTEN0_0                 = 0,     /*!< 0 : The deadtime insertion in this pair of channels is disabled.          */
  FTM0_COMBINE_DTEN0_1                 = 1,     /*!< 1 : The deadtime insertion in this pair of channels is enabled.           */
} FTM0_COMBINE_DTEN0_Enum;

/* ===========================================  FTM0 FTM0_COMBINE SYNCEN0 [5..5]  ============================================ */
typedef enum {                                  /*!< FTM0_COMBINE_SYNCEN0                                                      */
  FTM0_COMBINE_SYNCEN0_0               = 0,     /*!< 0 : The PWM synchronization in this pair of channels is disabled.         */
  FTM0_COMBINE_SYNCEN0_1               = 1,     /*!< 1 : The PWM synchronization in this pair of channels is enabled.          */
} FTM0_COMBINE_SYNCEN0_Enum;

/* ===========================================  FTM0 FTM0_COMBINE FAULTEN0 [6..6]  =========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_FAULTEN0                                                     */
  FTM0_COMBINE_FAULTEN0_0              = 0,     /*!< 0 : The fault control in this pair of channels is disabled.               */
  FTM0_COMBINE_FAULTEN0_1              = 1,     /*!< 1 : The fault control in this pair of channels is enabled.                */
} FTM0_COMBINE_FAULTEN0_Enum;

