nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  FTM0 FTM0_COMBINE DECAP3 [27..27]  =========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_DECAP3                                                       */
  FTM0_COMBINE_DECAP3_0                = 0,     /*!< 0 : The dual edge captures are inactive.                                  */
  FTM0_COMBINE_DECAP3_1                = 1,     /*!< 1 : The dual edge captures are active.                                    */
} FTM0_COMBINE_DECAP3_Enum;

/* ===========================================  FTM0 FTM0_COMBINE DTEN3 [28..28]  ============================================ */
typedef enum {                                  /*!< FTM0_COMBINE_DTEN3                                                        */
  FTM0_COMBINE_DTEN3_0                 = 0,     /*!< 0 : The deadtime insertion in this pair of channels is disabled.          */
  FTM0_COMBINE_DTEN3_1                 = 1,     /*!< 1 : The deadtime insertion in this pair of channels is enabled.           */
} FTM0_COMBINE_DTEN3_Enum;

/* ==========================================  FTM0 FTM0_COMBINE SYNCEN3 [29..29]  =========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_SYNCEN3                                                      */
  FTM0_COMBINE_SYNCEN3_0               = 0,     /*!< 0 : The PWM synchronization in this pair of channels is disabled.         */
  FTM0_COMBINE_SYNCEN3_1               = 1,     /*!< 1 : The PWM synchronization in this pair of channels is enabled.          */
} FTM0_COMBINE_SYNCEN3_Enum;

/* ==========================================  FTM0 FTM0_COMBINE FAULTEN3 [30..30]  ========================================== */
typedef enum {                                  /*!< FTM0_COMBINE_FAULTEN3                                                     */
  FTM0_COMBINE_FAULTEN3_0              = 0,     /*!< 0 : The fault control in this pair of channels is disabled.               */
  FTM0_COMBINE_FAULTEN3_1              = 1,     /*!< 1 : The fault control in this pair of channels is enabled.                */
} FTM0_COMBINE_FAULTEN3_Enum;

/* =====================================================  FTM0_DEADTIME  ===================================================== */
/* ============================================  FTM0 FTM0_DEADTIME DTPS [6..7]  ============================================= */
typedef enum {                                  /*!< FTM0_DEADTIME_DTPS                                                        */
  FTM0_DEADTIME_DTPS_0x_0              = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM0_DEADTIME_DTPS_0x_1              = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM0_DEADTIME_DTPS_10                = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM0_DEADTIME_DTPS_11                = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM0_DEADTIME_DTPS_Enum;

/* =====================================================  FTM0_EXTTRIG  ====================================================== */
/* ===========================================  FTM0 FTM0_EXTTRIG CH2TRIG [0..0]  ============================================ */
typedef enum {                                  /*!< FTM0_EXTTRIG_CH2TRIG                                                      */
  FTM0_EXTTRIG_CH2TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM0_EXTTRIG_CH2TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM0_EXTTRIG_CH2TRIG_Enum;

/* ===========================================  FTM0 FTM0_EXTTRIG CH3TRIG [1..1]  ============================================ */
typedef enum {                                  /*!< FTM0_EXTTRIG_CH3TRIG                                                      */
  FTM0_EXTTRIG_CH3TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM0_EXTTRIG_CH3TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM0_EXTTRIG_CH3TRIG_Enum;

/* ===========================================  FTM0 FTM0_EXTTRIG CH4TRIG [2..2]  ============================================ */
typedef enum {                                  /*!< FTM0_EXTTRIG_CH4TRIG                                                      */
  FTM0_EXTTRIG_CH4TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM0_EXTTRIG_CH4TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM0_EXTTRIG_CH4TRIG_Enum;

/* ===========================================  FTM0 FTM0_EXTTRIG CH5TRIG [3..3]  ============================================ */
typedef enum {                                  /*!< FTM0_EXTTRIG_CH5TRIG                                                      */
  FTM0_EXTTRIG_CH5TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM0_EXTTRIG_CH5TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM0_EXTTRIG_CH5TRIG_Enum;

/* ===========================================  FTM0 FTM0_EXTTRIG CH0TRIG [4..4]  ============================================ */
typedef enum {                                  /*!< FTM0_EXTTRIG_CH0TRIG                                                      */
  FTM0_EXTTRIG_CH0TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM0_EXTTRIG_CH0TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM0_EXTTRIG_CH0TRIG_Enum;

/* ===========================================  FTM0 FTM0_EXTTRIG CH1TRIG [5..5]  ============================================ */
typedef enum {                                  /*!< FTM0_EXTTRIG_CH1TRIG                                                      */
  FTM0_EXTTRIG_CH1TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM0_EXTTRIG_CH1TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM0_EXTTRIG_CH1TRIG_Enum;

