nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  FTM0 FTM0_EXTTRIG INITTRIGEN [6..6]  ========================================== */
typedef enum {                                  /*!< FTM0_EXTTRIG_INITTRIGEN                                                   */
  FTM0_EXTTRIG_INITTRIGEN_0            = 0,     /*!< 0 : The generation of initialization trigger is disabled.                 */
  FTM0_EXTTRIG_INITTRIGEN_1            = 1,     /*!< 1 : The generation of initialization trigger is enabled.                  */
} FTM0_EXTTRIG_INITTRIGEN_Enum;

/* ============================================  FTM0 FTM0_EXTTRIG TRIGF [7..7]  ============================================= */
typedef enum {                                  /*!< FTM0_EXTTRIG_TRIGF                                                        */
  FTM0_EXTTRIG_TRIGF_0                 = 0,     /*!< 0 : No channel trigger was generated.                                     */
  FTM0_EXTTRIG_TRIGF_1                 = 1,     /*!< 1 : A channel trigger was generated.                                      */
} FTM0_EXTTRIG_TRIGF_Enum;

/* ===========================================  FTM0 FTM0_EXTTRIG CH6TRIG [8..8]  ============================================ */
typedef enum {                                  /*!< FTM0_EXTTRIG_CH6TRIG                                                      */
  FTM0_EXTTRIG_CH6TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM0_EXTTRIG_CH6TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM0_EXTTRIG_CH6TRIG_Enum;

/* ===========================================  FTM0 FTM0_EXTTRIG CH7TRIG [9..9]  ============================================ */
typedef enum {                                  /*!< FTM0_EXTTRIG_CH7TRIG                                                      */
  FTM0_EXTTRIG_CH7TRIG_0               = 0,     /*!< 0 : The generation of this external trigger is disabled.                  */
  FTM0_EXTTRIG_CH7TRIG_1               = 1,     /*!< 1 : The generation of this external trigger is enabled.                   */
} FTM0_EXTTRIG_CH7TRIG_Enum;

/* =======================================================  FTM0_POL  ======================================================== */
/* ===============================================  FTM0 FTM0_POL POL0 [0..0]  =============================================== */
typedef enum {                                  /*!< FTM0_POL_POL0                                                             */
  FTM0_POL_POL0_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM0_POL_POL0_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM0_POL_POL0_Enum;

/* ===============================================  FTM0 FTM0_POL POL1 [1..1]  =============================================== */
typedef enum {                                  /*!< FTM0_POL_POL1                                                             */
  FTM0_POL_POL1_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM0_POL_POL1_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM0_POL_POL1_Enum;

/* ===============================================  FTM0 FTM0_POL POL2 [2..2]  =============================================== */
typedef enum {                                  /*!< FTM0_POL_POL2                                                             */
  FTM0_POL_POL2_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM0_POL_POL2_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM0_POL_POL2_Enum;

/* ===============================================  FTM0 FTM0_POL POL3 [3..3]  =============================================== */
typedef enum {                                  /*!< FTM0_POL_POL3                                                             */
  FTM0_POL_POL3_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM0_POL_POL3_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM0_POL_POL3_Enum;

/* ===============================================  FTM0 FTM0_POL POL4 [4..4]  =============================================== */
typedef enum {                                  /*!< FTM0_POL_POL4                                                             */
  FTM0_POL_POL4_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM0_POL_POL4_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM0_POL_POL4_Enum;

/* ===============================================  FTM0 FTM0_POL POL5 [5..5]  =============================================== */
typedef enum {                                  /*!< FTM0_POL_POL5                                                             */
  FTM0_POL_POL5_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM0_POL_POL5_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM0_POL_POL5_Enum;

/* ===============================================  FTM0 FTM0_POL POL6 [6..6]  =============================================== */
typedef enum {                                  /*!< FTM0_POL_POL6                                                             */
  FTM0_POL_POL6_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM0_POL_POL6_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM0_POL_POL6_Enum;

/* ===============================================  FTM0 FTM0_POL POL7 [7..7]  =============================================== */
typedef enum {                                  /*!< FTM0_POL_POL7                                                             */
  FTM0_POL_POL7_0                      = 0,     /*!< 0 : The channel polarity is active high.                                  */
  FTM0_POL_POL7_1                      = 1,     /*!< 1 : The channel polarity is active low.                                   */
} FTM0_POL_POL7_Enum;

/* =======================================================  FTM0_FMS  ======================================================== */
/* =============================================  FTM0 FTM0_FMS FAULTF0 [0..0]  ============================================== */
typedef enum {                                  /*!< FTM0_FMS_FAULTF0                                                          */
  FTM0_FMS_FAULTF0_0                   = 0,     /*!< 0 : No fault condition was detected at the fault input.                   */
  FTM0_FMS_FAULTF0_1                   = 1,     /*!< 1 : A fault condition was detected at the fault input.                    */
} FTM0_FMS_FAULTF0_Enum;

/* =============================================  FTM0 FTM0_FMS FAULTF1 [1..1]  ============================================== */
typedef enum {                                  /*!< FTM0_FMS_FAULTF1                                                          */
  FTM0_FMS_FAULTF1_0                   = 0,     /*!< 0 : No fault condition was detected at the fault input.                   */
  FTM0_FMS_FAULTF1_1                   = 1,     /*!< 1 : A fault condition was detected at the fault input.                    */
} FTM0_FMS_FAULTF1_Enum;

/* =============================================  FTM0 FTM0_FMS FAULTF2 [2..2]  ============================================== */
typedef enum {                                  /*!< FTM0_FMS_FAULTF2                                                          */
  FTM0_FMS_FAULTF2_0                   = 0,     /*!< 0 : No fault condition was detected at the fault input.                   */
  FTM0_FMS_FAULTF2_1                   = 1,     /*!< 1 : A fault condition was detected at the fault input.                    */
} FTM0_FMS_FAULTF2_Enum;

