nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  FTM0 FTM0_PWMLOAD CH5SEL [5..5]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_CH5SEL                                                       */
  FTM0_PWMLOAD_CH5SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM0_PWMLOAD_CH5SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM0_PWMLOAD_CH5SEL_Enum;

/* ============================================  FTM0 FTM0_PWMLOAD CH6SEL [6..6]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_CH6SEL                                                       */
  FTM0_PWMLOAD_CH6SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM0_PWMLOAD_CH6SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM0_PWMLOAD_CH6SEL_Enum;

/* ============================================  FTM0 FTM0_PWMLOAD CH7SEL [7..7]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_CH7SEL                                                       */
  FTM0_PWMLOAD_CH7SEL_0                = 0,     /*!< 0 : Channel match is not included as a reload opportunity.                */
  FTM0_PWMLOAD_CH7SEL_1                = 1,     /*!< 1 : Channel match is included as a reload opportunity.                    */
} FTM0_PWMLOAD_CH7SEL_Enum;

/* ============================================  FTM0 FTM0_PWMLOAD HCSEL [8..8]  ============================================= */
typedef enum {                                  /*!< FTM0_PWMLOAD_HCSEL                                                        */
  FTM0_PWMLOAD_HCSEL_0                 = 0,     /*!< 0 : Half cycle reload is disabled and it is not considered as
                                                     a reload opportunity.                                                     */
  FTM0_PWMLOAD_HCSEL_1                 = 1,     /*!< 1 : Half cycle reload is enabled and it is considered as a reload
                                                     opportunity.                                                              */
} FTM0_PWMLOAD_HCSEL_Enum;

/* =============================================  FTM0 FTM0_PWMLOAD LDOK [9..9]  ============================================= */
typedef enum {                                  /*!< FTM0_PWMLOAD_LDOK                                                         */
  FTM0_PWMLOAD_LDOK_0                  = 0,     /*!< 0 : Loading updated values is disabled.                                   */
  FTM0_PWMLOAD_LDOK_1                  = 1,     /*!< 1 : Loading updated values is enabled.                                    */
} FTM0_PWMLOAD_LDOK_Enum;

/* ============================================  FTM0 FTM0_PWMLOAD GLEN [10..10]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_GLEN                                                         */
  FTM0_PWMLOAD_GLEN_0                  = 0,     /*!< 0 : Global Load Ok disabled.                                              */
  FTM0_PWMLOAD_GLEN_1                  = 1,     /*!< 1 : Global Load OK enabled. A pulse event on the module global
                                                     load input sets the LDOK bit.                                             */
} FTM0_PWMLOAD_GLEN_Enum;

/* ===========================================  FTM0 FTM0_PWMLOAD GLDOK [11..11]  ============================================ */
typedef enum {                                  /*!< FTM0_PWMLOAD_GLDOK                                                        */
  FTM0_PWMLOAD_GLDOK_0                 = 0,     /*!< 0 : No action.                                                            */
  FTM0_PWMLOAD_GLDOK_1                 = 1,     /*!< 1 : LDOK bit is set.                                                      */
} FTM0_PWMLOAD_GLDOK_Enum;

/* =======================================================  FTM0_HCR  ======================================================== */
/* ==================================================  FTM0_PAIR0DEADTIME  =================================================== */
/* ==========================================  FTM0 FTM0_PAIR0DEADTIME DTPS [6..7]  ========================================== */
typedef enum {                                  /*!< FTM0_PAIR0DEADTIME_DTPS                                                   */
  FTM0_PAIR0DEADTIME_DTPS_0x_0         = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM0_PAIR0DEADTIME_DTPS_0x_1         = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM0_PAIR0DEADTIME_DTPS_10           = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM0_PAIR0DEADTIME_DTPS_11           = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM0_PAIR0DEADTIME_DTPS_Enum;

/* ==================================================  FTM0_PAIR1DEADTIME  =================================================== */
/* ==========================================  FTM0 FTM0_PAIR1DEADTIME DTPS [6..7]  ========================================== */
typedef enum {                                  /*!< FTM0_PAIR1DEADTIME_DTPS                                                   */
  FTM0_PAIR1DEADTIME_DTPS_0x_0         = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM0_PAIR1DEADTIME_DTPS_0x_1         = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM0_PAIR1DEADTIME_DTPS_10           = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM0_PAIR1DEADTIME_DTPS_11           = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM0_PAIR1DEADTIME_DTPS_Enum;

/* ==================================================  FTM0_PAIR2DEADTIME  =================================================== */
/* ==========================================  FTM0 FTM0_PAIR2DEADTIME DTPS [6..7]  ========================================== */
typedef enum {                                  /*!< FTM0_PAIR2DEADTIME_DTPS                                                   */
  FTM0_PAIR2DEADTIME_DTPS_0x_0         = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM0_PAIR2DEADTIME_DTPS_0x_1         = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM0_PAIR2DEADTIME_DTPS_10           = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM0_PAIR2DEADTIME_DTPS_11           = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM0_PAIR2DEADTIME_DTPS_Enum;

/* ==================================================  FTM0_PAIR3DEADTIME  =================================================== */
/* ==========================================  FTM0 FTM0_PAIR3DEADTIME DTPS [6..7]  ========================================== */
typedef enum {                                  /*!< FTM0_PAIR3DEADTIME_DTPS                                                   */
  FTM0_PAIR3DEADTIME_DTPS_0x_0         = 0,     /*!< 0x_0 : Divide the FTM input clock by 1.                                   */
  FTM0_PAIR3DEADTIME_DTPS_0x_1         = 1,     /*!< 0x_1 : Divide the FTM input clock by 1.                                   */
  FTM0_PAIR3DEADTIME_DTPS_10           = 2,     /*!< 10 : Divide the FTM input clock by 4.                                     */
  FTM0_PAIR3DEADTIME_DTPS_11           = 3,     /*!< 11 : Divide the FTM input clock by 16.                                    */
} FTM0_PAIR3DEADTIME_DTPS_Enum;

/* ====================================================  FTM0_MOD_MIRROR  ==================================================== */
/* ====================================================  FTM0_C0V_MIRROR  ==================================================== */
/* ====================================================  FTM0_C1V_MIRROR  ==================================================== */
/* ====================================================  FTM0_C2V_MIRROR  ==================================================== */
/* ====================================================  FTM0_C3V_MIRROR  ==================================================== */
/* ====================================================  FTM0_C4V_MIRROR  ==================================================== */
/* ====================================================  FTM0_C5V_MIRROR  ==================================================== */
/* ====================================================  FTM0_C6V_MIRROR  ==================================================== */
/* ====================================================  FTM0_C7V_MIRROR  ==================================================== */


/* =========================================================================================================================== */
/* ================                                           FTM1                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  FTM1_SC  ======================================================== */
/* ================================================  FTM1 FTM1_SC PS [0..2]  ================================================= */
typedef enum {                                  /*!< FTM1_SC_PS                                                                */
  FTM1_SC_PS_000                       = 0,     /*!< 000 : Divide by 1                                                         */
  FTM1_SC_PS_001                       = 1,     /*!< 001 : Divide by 2                                                         */
  FTM1_SC_PS_010                       = 2,     /*!< 010 : Divide by 4                                                         */
  FTM1_SC_PS_011                       = 3,     /*!< 011 : Divide by 8                                                         */
  FTM1_SC_PS_100                       = 4,     /*!< 100 : Divide by 16                                                        */
  FTM1_SC_PS_101                       = 5,     /*!< 101 : Divide by 32                                                        */
  FTM1_SC_PS_110                       = 6,     /*!< 110 : Divide by 64                                                        */
  FTM1_SC_PS_111                       = 7,     /*!< 111 : Divide by 128                                                       */
} FTM1_SC_PS_Enum;

