nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  FTM1 FTM1_OUTINIT CH6OI [6..6]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTINIT_CH6OI                                                        */
  FTM1_OUTINIT_CH6OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM1_OUTINIT_CH6OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM1_OUTINIT_CH6OI_Enum;

/* ============================================  FTM1 FTM1_OUTINIT CH7OI [7..7]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTINIT_CH7OI                                                        */
  FTM1_OUTINIT_CH7OI_0                 = 0,     /*!< 0 : The initialization value is 0.                                        */
  FTM1_OUTINIT_CH7OI_1                 = 1,     /*!< 1 : The initialization value is 1.                                        */
} FTM1_OUTINIT_CH7OI_Enum;

/* =====================================================  FTM1_OUTMASK  ====================================================== */
/* ============================================  FTM1 FTM1_OUTMASK CH0OM [0..0]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTMASK_CH0OM                                                        */
  FTM1_OUTMASK_CH0OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM1_OUTMASK_CH0OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM1_OUTMASK_CH0OM_Enum;

/* ============================================  FTM1 FTM1_OUTMASK CH1OM [1..1]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTMASK_CH1OM                                                        */
  FTM1_OUTMASK_CH1OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM1_OUTMASK_CH1OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM1_OUTMASK_CH1OM_Enum;

/* ============================================  FTM1 FTM1_OUTMASK CH2OM [2..2]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTMASK_CH2OM                                                        */
  FTM1_OUTMASK_CH2OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM1_OUTMASK_CH2OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM1_OUTMASK_CH2OM_Enum;

/* ============================================  FTM1 FTM1_OUTMASK CH3OM [3..3]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTMASK_CH3OM                                                        */
  FTM1_OUTMASK_CH3OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM1_OUTMASK_CH3OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM1_OUTMASK_CH3OM_Enum;

/* ============================================  FTM1 FTM1_OUTMASK CH4OM [4..4]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTMASK_CH4OM                                                        */
  FTM1_OUTMASK_CH4OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM1_OUTMASK_CH4OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM1_OUTMASK_CH4OM_Enum;

/* ============================================  FTM1 FTM1_OUTMASK CH5OM [5..5]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTMASK_CH5OM                                                        */
  FTM1_OUTMASK_CH5OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM1_OUTMASK_CH5OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM1_OUTMASK_CH5OM_Enum;

/* ============================================  FTM1 FTM1_OUTMASK CH6OM [6..6]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTMASK_CH6OM                                                        */
  FTM1_OUTMASK_CH6OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM1_OUTMASK_CH6OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM1_OUTMASK_CH6OM_Enum;

/* ============================================  FTM1 FTM1_OUTMASK CH7OM [7..7]  ============================================= */
typedef enum {                                  /*!< FTM1_OUTMASK_CH7OM                                                        */
  FTM1_OUTMASK_CH7OM_0                 = 0,     /*!< 0 : Channel output is not masked. It continues to operate normally.       */
  FTM1_OUTMASK_CH7OM_1                 = 1,     /*!< 1 : Channel output is masked. It is forced to its inactive state.         */
} FTM1_OUTMASK_CH7OM_Enum;

/* =====================================================  FTM1_COMBINE  ====================================================== */
/* ============================================  FTM1 FTM1_COMBINE COMP0 [1..1]  ============================================= */
typedef enum {                                  /*!< FTM1_COMBINE_COMP0                                                        */
  FTM1_COMBINE_COMP0_0                 = 0,     /*!< 0 : The channel (n+1) output is the same as the channel (n)
                                                     output.                                                                   */
  FTM1_COMBINE_COMP0_1                 = 1,     /*!< 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */
} FTM1_COMBINE_COMP0_Enum;

/* ============================================  FTM1 FTM1_COMBINE DECAP0 [3..3]  ============================================ */
typedef enum {                                  /*!< FTM1_COMBINE_DECAP0                                                       */
  FTM1_COMBINE_DECAP0_0                = 0,     /*!< 0 : The dual edge captures are inactive.                                  */
  FTM1_COMBINE_DECAP0_1                = 1,     /*!< 1 : The dual edge captures are active.                                    */
} FTM1_COMBINE_DECAP0_Enum;

/* ============================================  FTM1 FTM1_COMBINE DTEN0 [4..4]  ============================================= */
typedef enum {                                  /*!< FTM1_COMBINE_DTEN0                                                        */
  FTM1_COMBINE_DTEN0_0                 = 0,     /*!< 0 : The deadtime insertion in this pair of channels is disabled.          */
  FTM1_COMBINE_DTEN0_1                 = 1,     /*!< 1 : The deadtime insertion in this pair of channels is enabled.           */
} FTM1_COMBINE_DTEN0_Enum;

/* ===========================================  FTM1 FTM1_COMBINE SYNCEN0 [5..5]  ============================================ */
typedef enum {                                  /*!< FTM1_COMBINE_SYNCEN0                                                      */
  FTM1_COMBINE_SYNCEN0_0               = 0,     /*!< 0 : The PWM synchronization in this pair of channels is disabled.         */
  FTM1_COMBINE_SYNCEN0_1               = 1,     /*!< 1 : The PWM synchronization in this pair of channels is enabled.          */
} FTM1_COMBINE_SYNCEN0_Enum;

/* ===========================================  FTM1 FTM1_COMBINE FAULTEN0 [6..6]  =========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_FAULTEN0                                                     */
  FTM1_COMBINE_FAULTEN0_0              = 0,     /*!< 0 : The fault control in this pair of channels is disabled.               */
  FTM1_COMBINE_FAULTEN0_1              = 1,     /*!< 1 : The fault control in this pair of channels is enabled.                */
} FTM1_COMBINE_FAULTEN0_Enum;

/* ============================================  FTM1 FTM1_COMBINE COMP1 [9..9]  ============================================= */
typedef enum {                                  /*!< FTM1_COMBINE_COMP1                                                        */
  FTM1_COMBINE_COMP1_0                 = 0,     /*!< 0 : The channel (n+1) output is the same as the channel (n)
                                                     output.                                                                   */
  FTM1_COMBINE_COMP1_1                 = 1,     /*!< 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */
} FTM1_COMBINE_COMP1_Enum;

/* ===========================================  FTM1 FTM1_COMBINE DECAP1 [11..11]  =========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_DECAP1                                                       */
  FTM1_COMBINE_DECAP1_0                = 0,     /*!< 0 : The dual edge captures are inactive.                                  */
  FTM1_COMBINE_DECAP1_1                = 1,     /*!< 1 : The dual edge captures are active.                                    */
} FTM1_COMBINE_DECAP1_Enum;

/* ===========================================  FTM1 FTM1_COMBINE DTEN1 [12..12]  ============================================ */
typedef enum {                                  /*!< FTM1_COMBINE_DTEN1                                                        */
  FTM1_COMBINE_DTEN1_0                 = 0,     /*!< 0 : The deadtime insertion in this pair of channels is disabled.          */
  FTM1_COMBINE_DTEN1_1                 = 1,     /*!< 1 : The deadtime insertion in this pair of channels is enabled.           */
} FTM1_COMBINE_DTEN1_Enum;

/* ==========================================  FTM1 FTM1_COMBINE SYNCEN1 [13..13]  =========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_SYNCEN1                                                      */
  FTM1_COMBINE_SYNCEN1_0               = 0,     /*!< 0 : The PWM synchronization in this pair of channels is disabled.         */
  FTM1_COMBINE_SYNCEN1_1               = 1,     /*!< 1 : The PWM synchronization in this pair of channels is enabled.          */
} FTM1_COMBINE_SYNCEN1_Enum;

/* ==========================================  FTM1 FTM1_COMBINE FAULTEN1 [14..14]  ========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_FAULTEN1                                                     */
  FTM1_COMBINE_FAULTEN1_0              = 0,     /*!< 0 : The fault control in this pair of channels is disabled.               */
  FTM1_COMBINE_FAULTEN1_1              = 1,     /*!< 1 : The fault control in this pair of channels is enabled.                */
} FTM1_COMBINE_FAULTEN1_Enum;

/* ===========================================  FTM1 FTM1_COMBINE COMP2 [17..17]  ============================================ */
typedef enum {                                  /*!< FTM1_COMBINE_COMP2                                                        */
  FTM1_COMBINE_COMP2_0                 = 0,     /*!< 0 : The channel (n+1) output is the same as the channel (n)
                                                     output.                                                                   */
  FTM1_COMBINE_COMP2_1                 = 1,     /*!< 1 : The channel (n+1) output is the complement of the channel
                                                     (n) output.                                                               */
} FTM1_COMBINE_COMP2_Enum;

/* ===========================================  FTM1 FTM1_COMBINE DECAP2 [19..19]  =========================================== */
typedef enum {                                  /*!< FTM1_COMBINE_DECAP2                                                       */
  FTM1_COMBINE_DECAP2_0                = 0,     /*!< 0 : The dual edge captures are inactive.                                  */
  FTM1_COMBINE_DECAP2_1                = 1,     /*!< 1 : The dual edge captures are active.                                    */
} FTM1_COMBINE_DECAP2_Enum;

