nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  FTM1_FILTER  ====================================================== */
/* =====================================================  FTM1_FLTCTRL  ====================================================== */
/* ===========================================  FTM1 FTM1_FLTCTRL FAULT0EN [0..0]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FAULT0EN                                                     */
  FTM1_FLTCTRL_FAULT0EN_0              = 0,     /*!< 0 : Fault input is disabled.                                              */
  FTM1_FLTCTRL_FAULT0EN_1              = 1,     /*!< 1 : Fault input is enabled.                                               */
} FTM1_FLTCTRL_FAULT0EN_Enum;

/* ===========================================  FTM1 FTM1_FLTCTRL FAULT1EN [1..1]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FAULT1EN                                                     */
  FTM1_FLTCTRL_FAULT1EN_0              = 0,     /*!< 0 : Fault input is disabled.                                              */
  FTM1_FLTCTRL_FAULT1EN_1              = 1,     /*!< 1 : Fault input is enabled.                                               */
} FTM1_FLTCTRL_FAULT1EN_Enum;

/* ===========================================  FTM1 FTM1_FLTCTRL FAULT2EN [2..2]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FAULT2EN                                                     */
  FTM1_FLTCTRL_FAULT2EN_0              = 0,     /*!< 0 : Fault input is disabled.                                              */
  FTM1_FLTCTRL_FAULT2EN_1              = 1,     /*!< 1 : Fault input is enabled.                                               */
} FTM1_FLTCTRL_FAULT2EN_Enum;

/* ===========================================  FTM1 FTM1_FLTCTRL FAULT3EN [3..3]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FAULT3EN                                                     */
  FTM1_FLTCTRL_FAULT3EN_0              = 0,     /*!< 0 : Fault input is disabled.                                              */
  FTM1_FLTCTRL_FAULT3EN_1              = 1,     /*!< 1 : Fault input is enabled.                                               */
} FTM1_FLTCTRL_FAULT3EN_Enum;

/* ===========================================  FTM1 FTM1_FLTCTRL FFLTR0EN [4..4]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FFLTR0EN                                                     */
  FTM1_FLTCTRL_FFLTR0EN_0              = 0,     /*!< 0 : Fault input filter is disabled.                                       */
  FTM1_FLTCTRL_FFLTR0EN_1              = 1,     /*!< 1 : Fault input filter is enabled.                                        */
} FTM1_FLTCTRL_FFLTR0EN_Enum;

/* ===========================================  FTM1 FTM1_FLTCTRL FFLTR1EN [5..5]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FFLTR1EN                                                     */
  FTM1_FLTCTRL_FFLTR1EN_0              = 0,     /*!< 0 : Fault input filter is disabled.                                       */
  FTM1_FLTCTRL_FFLTR1EN_1              = 1,     /*!< 1 : Fault input filter is enabled.                                        */
} FTM1_FLTCTRL_FFLTR1EN_Enum;

/* ===========================================  FTM1 FTM1_FLTCTRL FFLTR2EN [6..6]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FFLTR2EN                                                     */
  FTM1_FLTCTRL_FFLTR2EN_0              = 0,     /*!< 0 : Fault input filter is disabled.                                       */
  FTM1_FLTCTRL_FFLTR2EN_1              = 1,     /*!< 1 : Fault input filter is enabled.                                        */
} FTM1_FLTCTRL_FFLTR2EN_Enum;

/* ===========================================  FTM1 FTM1_FLTCTRL FFLTR3EN [7..7]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FFLTR3EN                                                     */
  FTM1_FLTCTRL_FFLTR3EN_0              = 0,     /*!< 0 : Fault input filter is disabled.                                       */
  FTM1_FLTCTRL_FFLTR3EN_1              = 1,     /*!< 1 : Fault input filter is enabled.                                        */
} FTM1_FLTCTRL_FFLTR3EN_Enum;

/* ===========================================  FTM1 FTM1_FLTCTRL FSTATE [15..15]  =========================================== */
typedef enum {                                  /*!< FTM1_FLTCTRL_FSTATE                                                       */
  FTM1_FLTCTRL_FSTATE_0                = 0,     /*!< 0 : FTM outputs will be placed into safe values when fault events
                                                     in ongoing (defined by POL bits).                                         */
  FTM1_FLTCTRL_FSTATE_1                = 1,     /*!< 1 : FTM outputs will be tri-stated when fault event is ongoing            */
} FTM1_FLTCTRL_FSTATE_Enum;

/* ======================================================  FTM1_QDCTRL  ====================================================== */
/* ============================================  FTM1 FTM1_QDCTRL QUADEN [0..0]  ============================================= */
typedef enum {                                  /*!< FTM1_QDCTRL_QUADEN                                                        */
  FTM1_QDCTRL_QUADEN_0                 = 0,     /*!< 0 : Quadrature Decoder mode is disabled.                                  */
  FTM1_QDCTRL_QUADEN_1                 = 1,     /*!< 1 : Quadrature Decoder mode is enabled.                                   */
} FTM1_QDCTRL_QUADEN_Enum;

/* ============================================  FTM1 FTM1_QDCTRL TOFDIR [1..1]  ============================================= */
typedef enum {                                  /*!< FTM1_QDCTRL_TOFDIR                                                        */
  FTM1_QDCTRL_TOFDIR_0                 = 0,     /*!< 0 : TOF bit was set on the bottom of counting. There was an
                                                     FTM counter decrement and FTM counter changes from its
                                                     minimum value (CNTIN register) to its maximum value (MOD
                                                     register).                                                                */
  FTM1_QDCTRL_TOFDIR_1                 = 1,     /*!< 1 : TOF bit was set on the top of counting. There was an FTM
                                                     counter increment and FTM counter changes from its maximum
                                                     value (MOD register) to its minimum value (CNTIN register).               */
} FTM1_QDCTRL_TOFDIR_Enum;

/* ============================================  FTM1 FTM1_QDCTRL QUADIR [2..2]  ============================================= */
typedef enum {                                  /*!< FTM1_QDCTRL_QUADIR                                                        */
  FTM1_QDCTRL_QUADIR_0                 = 0,     /*!< 0 : Counting direction is decreasing (FTM counter decrement).             */
  FTM1_QDCTRL_QUADIR_1                 = 1,     /*!< 1 : Counting direction is increasing (FTM counter increment).             */
} FTM1_QDCTRL_QUADIR_Enum;

