nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  FTM1 FTM1_QDCTRL QUADMODE [3..3]  ============================================ */
typedef enum {                                  /*!< FTM1_QDCTRL_QUADMODE                                                      */
  FTM1_QDCTRL_QUADMODE_0               = 0,     /*!< 0 : Phase A and phase B encoding mode.                                    */
  FTM1_QDCTRL_QUADMODE_1               = 1,     /*!< 1 : Count and direction encoding mode.                                    */
} FTM1_QDCTRL_QUADMODE_Enum;

/* ============================================  FTM1 FTM1_QDCTRL PHBPOL [4..4]  ============================================= */
typedef enum {                                  /*!< FTM1_QDCTRL_PHBPOL                                                        */
  FTM1_QDCTRL_PHBPOL_0                 = 0,     /*!< 0 : Normal polarity. Phase B input signal is not inverted before
                                                     identifying the rising and falling edges of this signal.                  */
  FTM1_QDCTRL_PHBPOL_1                 = 1,     /*!< 1 : Inverted polarity. Phase B input signal is inverted before
                                                     identifying the rising and falling edges of this signal.                  */
} FTM1_QDCTRL_PHBPOL_Enum;

/* ============================================  FTM1 FTM1_QDCTRL PHAPOL [5..5]  ============================================= */
typedef enum {                                  /*!< FTM1_QDCTRL_PHAPOL                                                        */
  FTM1_QDCTRL_PHAPOL_0                 = 0,     /*!< 0 : Normal polarity. Phase A input signal is not inverted before
                                                     identifying the rising and falling edges of this signal.                  */
  FTM1_QDCTRL_PHAPOL_1                 = 1,     /*!< 1 : Inverted polarity. Phase A input signal is inverted before
                                                     identifying the rising and falling edges of this signal.                  */
} FTM1_QDCTRL_PHAPOL_Enum;

/* ===========================================  FTM1 FTM1_QDCTRL PHBFLTREN [6..6]  =========================================== */
typedef enum {                                  /*!< FTM1_QDCTRL_PHBFLTREN                                                     */
  FTM1_QDCTRL_PHBFLTREN_0              = 0,     /*!< 0 : Phase B input filter is disabled.                                     */
  FTM1_QDCTRL_PHBFLTREN_1              = 1,     /*!< 1 : Phase B input filter is enabled.                                      */
} FTM1_QDCTRL_PHBFLTREN_Enum;

/* ===========================================  FTM1 FTM1_QDCTRL PHAFLTREN [7..7]  =========================================== */
typedef enum {                                  /*!< FTM1_QDCTRL_PHAFLTREN                                                     */
  FTM1_QDCTRL_PHAFLTREN_0              = 0,     /*!< 0 : Phase A input filter is disabled.                                     */
  FTM1_QDCTRL_PHAFLTREN_1              = 1,     /*!< 1 : Phase A input filter is enabled.                                      */
} FTM1_QDCTRL_PHAFLTREN_Enum;

/* =======================================================  FTM1_CONF  ======================================================= */
/* ============================================  FTM1 FTM1_CONF ITRIGR [11..11]  ============================================= */
typedef enum {                                  /*!< FTM1_CONF_ITRIGR                                                          */
  FTM1_CONF_ITRIGR_0                   = 0,     /*!< 0 : Initialization trigger is generated on counter wrap events.           */
  FTM1_CONF_ITRIGR_1                   = 1,     /*!< 1 : Initialization trigger is generated when a reload point
                                                     is reached.                                                               */
} FTM1_CONF_ITRIGR_Enum;

/* ======================================================  FTM1_FLTPOL  ====================================================== */
/* ============================================  FTM1 FTM1_FLTPOL FLT0POL [0..0]  ============================================ */
typedef enum {                                  /*!< FTM1_FLTPOL_FLT0POL                                                       */
  FTM1_FLTPOL_FLT0POL_0                = 0,     /*!< 0 : The fault input polarity is active high. A 1 at the fault
                                                     input indicates a fault.                                                  */
  FTM1_FLTPOL_FLT0POL_1                = 1,     /*!< 1 : The fault input polarity is active low. A 0 at the fault
                                                     input indicates a fault.                                                  */
} FTM1_FLTPOL_FLT0POL_Enum;

/* ============================================  FTM1 FTM1_FLTPOL FLT1POL [1..1]  ============================================ */
typedef enum {                                  /*!< FTM1_FLTPOL_FLT1POL                                                       */
  FTM1_FLTPOL_FLT1POL_0                = 0,     /*!< 0 : The fault input polarity is active high. A 1 at the fault
                                                     input indicates a fault.                                                  */
  FTM1_FLTPOL_FLT1POL_1                = 1,     /*!< 1 : The fault input polarity is active low. A 0 at the fault
                                                     input indicates a fault.                                                  */
} FTM1_FLTPOL_FLT1POL_Enum;

/* ============================================  FTM1 FTM1_FLTPOL FLT2POL [2..2]  ============================================ */
typedef enum {                                  /*!< FTM1_FLTPOL_FLT2POL                                                       */
  FTM1_FLTPOL_FLT2POL_0                = 0,     /*!< 0 : The fault input polarity is active high. A 1 at the fault
                                                     input indicates a fault.                                                  */
  FTM1_FLTPOL_FLT2POL_1                = 1,     /*!< 1 : The fault input polarity is active low. A 0 at the fault
                                                     input indicates a fault.                                                  */
} FTM1_FLTPOL_FLT2POL_Enum;

/* ============================================  FTM1 FTM1_FLTPOL FLT3POL [3..3]  ============================================ */
typedef enum {                                  /*!< FTM1_FLTPOL_FLT3POL                                                       */
  FTM1_FLTPOL_FLT3POL_0                = 0,     /*!< 0 : The fault input polarity is active high. A 1 at the fault
                                                     input indicates a fault.                                                  */
  FTM1_FLTPOL_FLT3POL_1                = 1,     /*!< 1 : The fault input polarity is active low. A 0 at the fault
                                                     input indicates a fault.                                                  */
} FTM1_FLTPOL_FLT3POL_Enum;

/* =====================================================  FTM1_SYNCONF  ====================================================== */
/* ==========================================  FTM1 FTM1_SYNCONF HWTRIGMODE [0..0]  ========================================== */
typedef enum {                                  /*!< FTM1_SYNCONF_HWTRIGMODE                                                   */
  FTM1_SYNCONF_HWTRIGMODE_0            = 0,     /*!< 0 : FTM clears the TRIGj bit when the hardware trigger j is
                                                     detected, where j = 0, 1,2.                                               */
  FTM1_SYNCONF_HWTRIGMODE_1            = 1,     /*!< 1 : FTM does not clear the TRIGj bit when the hardware trigger
                                                     j is detected, where j = 0, 1,2.                                          */
} FTM1_SYNCONF_HWTRIGMODE_Enum;

/* ============================================  FTM1 FTM1_SYNCONF CNTINC [2..2]  ============================================ */
typedef enum {                                  /*!< FTM1_SYNCONF_CNTINC                                                       */
  FTM1_SYNCONF_CNTINC_0                = 0,     /*!< 0 : CNTIN register is updated with its buffer value at all rising
                                                     edges of FTM input clock.                                                 */
  FTM1_SYNCONF_CNTINC_1                = 1,     /*!< 1 : CNTIN register is updated with its buffer value by the PWM
                                                     synchronization.                                                          */
} FTM1_SYNCONF_CNTINC_Enum;

/* =============================================  FTM1 FTM1_SYNCONF INVC [4..4]  ============================================= */
typedef enum {                                  /*!< FTM1_SYNCONF_INVC                                                         */
  FTM1_SYNCONF_INVC_0                  = 0,     /*!< 0 : INVCTRL register is updated with its buffer value at all
                                                     rising edges of FTM input clock.                                          */
  FTM1_SYNCONF_INVC_1                  = 1,     /*!< 1 : INVCTRL register is updated with its buffer value by the
                                                     PWM synchronization.                                                      */
} FTM1_SYNCONF_INVC_Enum;

