nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =====================================================  FTM1_INVCTRL  ====================================================== */
/* ============================================  FTM1 FTM1_INVCTRL INV0EN [0..0]  ============================================ */
typedef enum {                                  /*!< FTM1_INVCTRL_INV0EN                                                       */
  FTM1_INVCTRL_INV0EN_0                = 0,     /*!< 0 : Inverting is disabled.                                                */
  FTM1_INVCTRL_INV0EN_1                = 1,     /*!< 1 : Inverting is enabled.                                                 */
} FTM1_INVCTRL_INV0EN_Enum;

/* ============================================  FTM1 FTM1_INVCTRL INV1EN [1..1]  ============================================ */
typedef enum {                                  /*!< FTM1_INVCTRL_INV1EN                                                       */
  FTM1_INVCTRL_INV1EN_0                = 0,     /*!< 0 : Inverting is disabled.                                                */
  FTM1_INVCTRL_INV1EN_1                = 1,     /*!< 1 : Inverting is enabled.                                                 */
} FTM1_INVCTRL_INV1EN_Enum;

/* ============================================  FTM1 FTM1_INVCTRL INV2EN [2..2]  ============================================ */
typedef enum {                                  /*!< FTM1_INVCTRL_INV2EN                                                       */
  FTM1_INVCTRL_INV2EN_0                = 0,     /*!< 0 : Inverting is disabled.                                                */
  FTM1_INVCTRL_INV2EN_1                = 1,     /*!< 1 : Inverting is enabled.                                                 */
} FTM1_INVCTRL_INV2EN_Enum;

/* ============================================  FTM1 FTM1_INVCTRL INV3EN [3..3]  ============================================ */
typedef enum {                                  /*!< FTM1_INVCTRL_INV3EN                                                       */
  FTM1_INVCTRL_INV3EN_0                = 0,     /*!< 0 : Inverting is disabled.                                                */
  FTM1_INVCTRL_INV3EN_1                = 1,     /*!< 1 : Inverting is enabled.                                                 */
} FTM1_INVCTRL_INV3EN_Enum;

/* =====================================================  FTM1_SWOCTRL  ====================================================== */
/* ============================================  FTM1 FTM1_SWOCTRL CH0OC [0..0]  ============================================= */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH0OC                                                        */
  FTM1_SWOCTRL_CH0OC_0                 = 0,     /*!< 0 : The channel output is not affected by software output control.        */
  FTM1_SWOCTRL_CH0OC_1                 = 1,     /*!< 1 : The channel output is affected by software output control.            */
} FTM1_SWOCTRL_CH0OC_Enum;

/* ============================================  FTM1 FTM1_SWOCTRL CH1OC [1..1]  ============================================= */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH1OC                                                        */
  FTM1_SWOCTRL_CH1OC_0                 = 0,     /*!< 0 : The channel output is not affected by software output control.        */
  FTM1_SWOCTRL_CH1OC_1                 = 1,     /*!< 1 : The channel output is affected by software output control.            */
} FTM1_SWOCTRL_CH1OC_Enum;

/* ============================================  FTM1 FTM1_SWOCTRL CH2OC [2..2]  ============================================= */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH2OC                                                        */
  FTM1_SWOCTRL_CH2OC_0                 = 0,     /*!< 0 : The channel output is not affected by software output control.        */
  FTM1_SWOCTRL_CH2OC_1                 = 1,     /*!< 1 : The channel output is affected by software output control.            */
} FTM1_SWOCTRL_CH2OC_Enum;

/* ============================================  FTM1 FTM1_SWOCTRL CH3OC [3..3]  ============================================= */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH3OC                                                        */
  FTM1_SWOCTRL_CH3OC_0                 = 0,     /*!< 0 : The channel output is not affected by software output control.        */
  FTM1_SWOCTRL_CH3OC_1                 = 1,     /*!< 1 : The channel output is affected by software output control.            */
} FTM1_SWOCTRL_CH3OC_Enum;

/* ============================================  FTM1 FTM1_SWOCTRL CH4OC [4..4]  ============================================= */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH4OC                                                        */
  FTM1_SWOCTRL_CH4OC_0                 = 0,     /*!< 0 : The channel output is not affected by software output control.        */
  FTM1_SWOCTRL_CH4OC_1                 = 1,     /*!< 1 : The channel output is affected by software output control.            */
} FTM1_SWOCTRL_CH4OC_Enum;

/* ============================================  FTM1 FTM1_SWOCTRL CH5OC [5..5]  ============================================= */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH5OC                                                        */
  FTM1_SWOCTRL_CH5OC_0                 = 0,     /*!< 0 : The channel output is not affected by software output control.        */
  FTM1_SWOCTRL_CH5OC_1                 = 1,     /*!< 1 : The channel output is affected by software output control.            */
} FTM1_SWOCTRL_CH5OC_Enum;

/* ============================================  FTM1 FTM1_SWOCTRL CH6OC [6..6]  ============================================= */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH6OC                                                        */
  FTM1_SWOCTRL_CH6OC_0                 = 0,     /*!< 0 : The channel output is not affected by software output control.        */
  FTM1_SWOCTRL_CH6OC_1                 = 1,     /*!< 1 : The channel output is affected by software output control.            */
} FTM1_SWOCTRL_CH6OC_Enum;

/* ============================================  FTM1 FTM1_SWOCTRL CH7OC [7..7]  ============================================= */
typedef enum {                                  /*!< FTM1_SWOCTRL_CH7OC                                                        */
  FTM1_SWOCTRL_CH7OC_0                 = 0,     /*!< 0 : The channel output is not affected by software output control.        */
  FTM1_SWOCTRL_CH7OC_1                 = 1,     /*!< 1 : The channel output is affected by software output control.            */
} FTM1_SWOCTRL_CH7OC_Enum;

