nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =======================================================  ADC0_SC1J  ======================================================= */
/* ==============================================  ADC0 ADC0_SC1J ADCH [0..4]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1J_ADCH                                                    */
  ADC0_SC1_SC1_SC1J_ADCH_00000         = 0,     /*!< 00000 : Exernal channel 0 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_00001         = 1,     /*!< 00001 : Exernal channel 1 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_00010         = 2,     /*!< 00010 : Exernal channel 2 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_00011         = 3,     /*!< 00011 : Exernal channel 3 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_00100         = 4,     /*!< 00100 : Exernal channel 4 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_00101         = 5,     /*!< 00101 : Exernal channel 5 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_00110         = 6,     /*!< 00110 : Exernal channel 6 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_00111         = 7,     /*!< 00111 : Exernal channel 7 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_01000         = 8,     /*!< 01000 : Exernal channel 8 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_01001         = 9,     /*!< 01001 : Exernal channel 9 is selected as input.                           */
  ADC0_SC1_SC1_SC1J_ADCH_01010         = 10,    /*!< 01010 : Exernal channel 10 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_01011         = 11,    /*!< 01011 : Exernal channel 11 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_01100         = 12,    /*!< 01100 : Exernal channel 12 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_01101         = 13,    /*!< 01101 : Exernal channel 13 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_01110         = 14,    /*!< 01110 : Exernal channel 14 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_01111         = 15,    /*!< 01111 : Exernal channel 15 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_10010         = 18,    /*!< 10010 : Exernal channel 18 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_10011         = 19,    /*!< 10011 : Exernal channel 19 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_10101         = 21,    /*!< 10101 : Internal channel 0 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_10110         = 22,    /*!< 10110 : Internal channel 1 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_10111         = 23,    /*!< 10111 : Internal channel 2 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_11010         = 26,    /*!< 11010 : Temp Sensor                                                       */
  ADC0_SC1_SC1_SC1J_ADCH_11011         = 27,    /*!< 11011 : Band Gap                                                          */
  ADC0_SC1_SC1_SC1J_ADCH_11100         = 28,    /*!< 11100 : Internal channel 3 is selected as input.                          */
  ADC0_SC1_SC1_SC1J_ADCH_11101         = 29,    /*!< 11101 : VREFSH is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1J_ADCH_11110         = 30,    /*!< 11110 : VREFSL is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1J_ADCH_11111         = 31,    /*!< 11111 : Module is disabled                                                */
} ADC0_SC1_SC1_SC1J_ADCH_Enum;

/* ==============================================  ADC0 ADC0_SC1J AIEN [6..6]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1J_AIEN                                                    */
  ADC0_SC1_SC1_SC1J_AIEN_0             = 0,     /*!< 0 : Conversion complete interrupt is disabled.                            */
  ADC0_SC1_SC1_SC1J_AIEN_1             = 1,     /*!< 1 : Conversion complete interrupt is enabled.                             */
} ADC0_SC1_SC1_SC1J_AIEN_Enum;

/* ==============================================  ADC0 ADC0_SC1J COCO [7..7]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1J_COCO                                                    */
  ADC0_SC1_SC1_SC1J_COCO_0             = 0,     /*!< 0 : Conversion is not completed.                                          */
  ADC0_SC1_SC1_SC1J_COCO_1             = 1,     /*!< 1 : Conversion is completed.                                              */
} ADC0_SC1_SC1_SC1J_COCO_Enum;

/* =======================================================  ADC0_SC1K  ======================================================= */
/* ==============================================  ADC0 ADC0_SC1K ADCH [0..4]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1K_ADCH                                                    */
  ADC0_SC1_SC1_SC1K_ADCH_00000         = 0,     /*!< 00000 : Exernal channel 0 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_00001         = 1,     /*!< 00001 : Exernal channel 1 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_00010         = 2,     /*!< 00010 : Exernal channel 2 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_00011         = 3,     /*!< 00011 : Exernal channel 3 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_00100         = 4,     /*!< 00100 : Exernal channel 4 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_00101         = 5,     /*!< 00101 : Exernal channel 5 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_00110         = 6,     /*!< 00110 : Exernal channel 6 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_00111         = 7,     /*!< 00111 : Exernal channel 7 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_01000         = 8,     /*!< 01000 : Exernal channel 8 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_01001         = 9,     /*!< 01001 : Exernal channel 9 is selected as input.                           */
  ADC0_SC1_SC1_SC1K_ADCH_01010         = 10,    /*!< 01010 : Exernal channel 10 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_01011         = 11,    /*!< 01011 : Exernal channel 11 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_01100         = 12,    /*!< 01100 : Exernal channel 12 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_01101         = 13,    /*!< 01101 : Exernal channel 13 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_01110         = 14,    /*!< 01110 : Exernal channel 14 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_01111         = 15,    /*!< 01111 : Exernal channel 15 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_10010         = 18,    /*!< 10010 : Exernal channel 18 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_10011         = 19,    /*!< 10011 : Exernal channel 19 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_10101         = 21,    /*!< 10101 : Internal channel 0 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_10110         = 22,    /*!< 10110 : Internal channel 1 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_10111         = 23,    /*!< 10111 : Internal channel 2 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_11010         = 26,    /*!< 11010 : Temp Sensor                                                       */
  ADC0_SC1_SC1_SC1K_ADCH_11011         = 27,    /*!< 11011 : Band Gap                                                          */
  ADC0_SC1_SC1_SC1K_ADCH_11100         = 28,    /*!< 11100 : Internal channel 3 is selected as input.                          */
  ADC0_SC1_SC1_SC1K_ADCH_11101         = 29,    /*!< 11101 : VREFSH is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1K_ADCH_11110         = 30,    /*!< 11110 : VREFSL is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1K_ADCH_11111         = 31,    /*!< 11111 : Module is disabled                                                */
} ADC0_SC1_SC1_SC1K_ADCH_Enum;

/* ==============================================  ADC0 ADC0_SC1K AIEN [6..6]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1K_AIEN                                                    */
  ADC0_SC1_SC1_SC1K_AIEN_0             = 0,     /*!< 0 : Conversion complete interrupt is disabled.                            */
  ADC0_SC1_SC1_SC1K_AIEN_1             = 1,     /*!< 1 : Conversion complete interrupt is enabled.                             */
} ADC0_SC1_SC1_SC1K_AIEN_Enum;

/* ==============================================  ADC0 ADC0_SC1K COCO [7..7]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1K_COCO                                                    */
  ADC0_SC1_SC1_SC1K_COCO_0             = 0,     /*!< 0 : Conversion is not completed.                                          */
  ADC0_SC1_SC1_SC1K_COCO_1             = 1,     /*!< 1 : Conversion is completed.                                              */
} ADC0_SC1_SC1_SC1K_COCO_Enum;

/* =======================================================  ADC0_SC1L  ======================================================= */
/* ==============================================  ADC0 ADC0_SC1L ADCH [0..4]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1L_ADCH                                                    */
  ADC0_SC1_SC1_SC1L_ADCH_00000         = 0,     /*!< 00000 : Exernal channel 0 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_00001         = 1,     /*!< 00001 : Exernal channel 1 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_00010         = 2,     /*!< 00010 : Exernal channel 2 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_00011         = 3,     /*!< 00011 : Exernal channel 3 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_00100         = 4,     /*!< 00100 : Exernal channel 4 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_00101         = 5,     /*!< 00101 : Exernal channel 5 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_00110         = 6,     /*!< 00110 : Exernal channel 6 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_00111         = 7,     /*!< 00111 : Exernal channel 7 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_01000         = 8,     /*!< 01000 : Exernal channel 8 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_01001         = 9,     /*!< 01001 : Exernal channel 9 is selected as input.                           */
  ADC0_SC1_SC1_SC1L_ADCH_01010         = 10,    /*!< 01010 : Exernal channel 10 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_01011         = 11,    /*!< 01011 : Exernal channel 11 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_01100         = 12,    /*!< 01100 : Exernal channel 12 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_01101         = 13,    /*!< 01101 : Exernal channel 13 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_01110         = 14,    /*!< 01110 : Exernal channel 14 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_01111         = 15,    /*!< 01111 : Exernal channel 15 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_10010         = 18,    /*!< 10010 : Exernal channel 18 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_10011         = 19,    /*!< 10011 : Exernal channel 19 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_10101         = 21,    /*!< 10101 : Internal channel 0 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_10110         = 22,    /*!< 10110 : Internal channel 1 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_10111         = 23,    /*!< 10111 : Internal channel 2 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_11010         = 26,    /*!< 11010 : Temp Sensor                                                       */
  ADC0_SC1_SC1_SC1L_ADCH_11011         = 27,    /*!< 11011 : Band Gap                                                          */
  ADC0_SC1_SC1_SC1L_ADCH_11100         = 28,    /*!< 11100 : Internal channel 3 is selected as input.                          */
  ADC0_SC1_SC1_SC1L_ADCH_11101         = 29,    /*!< 11101 : VREFSH is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1L_ADCH_11110         = 30,    /*!< 11110 : VREFSL is selected as input. Voltage reference selected
                                                     is determined by SC2[REFSEL].                                             */
  ADC0_SC1_SC1_SC1L_ADCH_11111         = 31,    /*!< 11111 : Module is disabled                                                */
} ADC0_SC1_SC1_SC1L_ADCH_Enum;

/* ==============================================  ADC0 ADC0_SC1L AIEN [6..6]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1L_AIEN                                                    */
  ADC0_SC1_SC1_SC1L_AIEN_0             = 0,     /*!< 0 : Conversion complete interrupt is disabled.                            */
  ADC0_SC1_SC1_SC1L_AIEN_1             = 1,     /*!< 1 : Conversion complete interrupt is enabled.                             */
} ADC0_SC1_SC1_SC1L_AIEN_Enum;

/* ==============================================  ADC0 ADC0_SC1L COCO [7..7]  =============================================== */
typedef enum {                                  /*!< ADC0_SC1_SC1_SC1L_COCO                                                    */
  ADC0_SC1_SC1_SC1L_COCO_0             = 0,     /*!< 0 : Conversion is not completed.                                          */
  ADC0_SC1_SC1_SC1L_COCO_1             = 1,     /*!< 1 : Conversion is completed.                                              */
} ADC0_SC1_SC1_SC1L_COCO_Enum;

