nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  ADC0 ADC0_CFG1 ADIV [5..6]  =============================================== */
typedef enum {                                  /*!< ADC0_CFG1_ADIV                                                            */
  ADC0_CFG1_ADIV_00                    = 0,     /*!< 00 : The divide ratio is 1 and the clock rate is input clock.             */
  ADC0_CFG1_ADIV_01                    = 1,     /*!< 01 : The divide ratio is 2 and the clock rate is (input clock)/2.         */
  ADC0_CFG1_ADIV_10                    = 2,     /*!< 10 : The divide ratio is 4 and the clock rate is (input clock)/4.         */
  ADC0_CFG1_ADIV_11                    = 3,     /*!< 11 : The divide ratio is 8 and the clock rate is (input clock)/8.         */
} ADC0_CFG1_ADIV_Enum;

/* =======================================================  ADC0_CFG2  ======================================================= */
/* ========================================================  ADC0_RA  ======================================================== */
/* ========================================================  ADC0_RB  ======================================================== */
/* ========================================================  ADC0_RC  ======================================================== */
/* ========================================================  ADC0_RD  ======================================================== */
/* ========================================================  ADC0_RE  ======================================================== */
/* ========================================================  ADC0_RF  ======================================================== */
/* ========================================================  ADC0_RG  ======================================================== */
/* ========================================================  ADC0_RH  ======================================================== */
/* ========================================================  ADC0_RI  ======================================================== */
/* ========================================================  ADC0_RJ  ======================================================== */
/* ========================================================  ADC0_RK  ======================================================== */
/* ========================================================  ADC0_RL  ======================================================== */
/* ========================================================  ADC0_RM  ======================================================== */
/* ========================================================  ADC0_RN  ======================================================== */
/* ========================================================  ADC0_RO  ======================================================== */
/* ========================================================  ADC0_RP  ======================================================== */
/* =======================================================  ADC0_CV1  ======================================================== */
/* =======================================================  ADC0_CV2  ======================================================== */
/* =======================================================  ADC0_SC2  ======================================================== */
/* ==============================================  ADC0 ADC0_SC2 REFSEL [0..1]  ============================================== */
typedef enum {                                  /*!< ADC0_SC2_REFSEL                                                           */
  ADC0_SC2_REFSEL_00                   = 0,     /*!< 00 : Default voltage reference pin pair, that is, external pins
                                                     VREFH and VREFL                                                           */
  ADC0_SC2_REFSEL_01                   = 1,     /*!< 01 : Alternate reference voltage, that is, VALTH. This voltage
                                                     may be additional external pin or internal source depending
                                                     on the MCU configuration. See the chip configuration information
                                                     for details specific to this MCU.                                         */
} ADC0_SC2_REFSEL_Enum;

/* ==============================================  ADC0 ADC0_SC2 DMAEN [2..2]  =============================================== */
typedef enum {                                  /*!< ADC0_SC2_DMAEN                                                            */
  ADC0_SC2_DMAEN_0                     = 0,     /*!< 0 : DMA is disabled.                                                      */
  ADC0_SC2_DMAEN_1                     = 1,     /*!< 1 : DMA is enabled and will assert the ADC DMA request during
                                                     an ADC conversion complete event , which is indicated when
                                                     any SC1n[COCO] flag is asserted.                                          */
} ADC0_SC2_DMAEN_Enum;

/* ===============================================  ADC0 ADC0_SC2 ACFE [5..5]  =============================================== */
typedef enum {                                  /*!< ADC0_SC2_ACFE                                                             */
  ADC0_SC2_ACFE_0                      = 0,     /*!< 0 : Compare function disabled.                                            */
  ADC0_SC2_ACFE_1                      = 1,     /*!< 1 : Compare function enabled.                                             */
} ADC0_SC2_ACFE_Enum;

/* ==============================================  ADC0 ADC0_SC2 ADTRG [6..6]  =============================================== */
typedef enum {                                  /*!< ADC0_SC2_ADTRG                                                            */
  ADC0_SC2_ADTRG_0                     = 0,     /*!< 0 : Software trigger selected.                                            */
  ADC0_SC2_ADTRG_1                     = 1,     /*!< 1 : Hardware trigger selected.                                            */
} ADC0_SC2_ADTRG_Enum;

/* ==============================================  ADC0 ADC0_SC2 ADACT [7..7]  =============================================== */
typedef enum {                                  /*!< ADC0_SC2_ADACT                                                            */
  ADC0_SC2_ADACT_0                     = 0,     /*!< 0 : Conversion not in progress.                                           */
  ADC0_SC2_ADACT_1                     = 1,     /*!< 1 : Conversion in progress.                                               */
} ADC0_SC2_ADACT_Enum;

