nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  CMU_FC_1 CMU_FC_1_SR STATE [2..3]  =========================================== */
typedef enum {                                  /*!< CMU_FC_1_SR_STATE                                                         */
  CMU_FC_1_SR_STATE_00                 = 0,     /*!< 00 : Configure State- Configuration registers and CMU_FC_IER
                                                     programming is getting done                                               */
  CMU_FC_1_SR_STATE_01                 = 1,     /*!< 01 : Initialization State- Register configurations are getting
                                                     loaded internally.                                                        */
  CMU_FC_1_SR_STATE_10                 = 2,     /*!< 10 : Initialization Wait State- The module stays in this state
                                                     for 1 bus clock cycle.                                                    */
  CMU_FC_1_SR_STATE_11                 = 3,     /*!< 11 : Frequency Check State- The module is ready to start frequency
                                                     check operation in this state.                                            */
} CMU_FC_1_SR_STATE_Enum;

/* ============================================  CMU_FC_1 CMU_FC_1_SR RS [4..4]  ============================================= */
typedef enum {                                  /*!< CMU_FC_1_SR_RS                                                            */
  CMU_FC_1_SR_RS_0                     = 0,     /*!< 0 : Frequency Check Stopped                                               */
  CMU_FC_1_SR_RS_1                     = 1,     /*!< 1 : Frequency Check Running                                               */
} CMU_FC_1_SR_RS_Enum;

/* =====================================================  CMU_FC_1_IER  ====================================================== */
/* ==========================================  CMU_FC_1 CMU_FC_1_IER FLLIE [0..0]  =========================================== */
typedef enum {                                  /*!< CMU_FC_1_IER_FLLIE                                                        */
  CMU_FC_1_IER_FLLIE_0                 = 0,     /*!< 0 : FLL Interrupt is Disabled                                             */
  CMU_FC_1_IER_FLLIE_1                 = 1,     /*!< 1 : FLL Interrupt is Enabled                                              */
} CMU_FC_1_IER_FLLIE_Enum;

/* ==========================================  CMU_FC_1 CMU_FC_1_IER FHHIE [1..1]  =========================================== */
typedef enum {                                  /*!< CMU_FC_1_IER_FHHIE                                                        */
  CMU_FC_1_IER_FHHIE_0                 = 0,     /*!< 0 : FHH Interrupt is Disabled                                             */
  CMU_FC_1_IER_FHHIE_1                 = 1,     /*!< 1 : FHH Interrupt is Enabled                                              */
} CMU_FC_1_IER_FHHIE_Enum;

/* ==========================================  CMU_FC_1 CMU_FC_1_IER FLLAEE [2..2]  ========================================== */
typedef enum {                                  /*!< CMU_FC_1_IER_FLLAEE                                                       */
  CMU_FC_1_IER_FLLAEE_0                = 0,     /*!< 0 : Asynchronous FLL Event is Disabled                                    */
  CMU_FC_1_IER_FLLAEE_1                = 1,     /*!< 1 : Asynchronous FLL Event is Enabled                                     */
} CMU_FC_1_IER_FLLAEE_Enum;

/* ==========================================  CMU_FC_1 CMU_FC_1_IER FHHAEE [3..3]  ========================================== */
typedef enum {                                  /*!< CMU_FC_1_IER_FHHAEE                                                       */
  CMU_FC_1_IER_FHHAEE_0                = 0,     /*!< 0 : Asynchronous FHH Event is Disabled                                    */
  CMU_FC_1_IER_FHHAEE_1                = 1,     /*!< 1 : Asynchronous FHH Event is Enabled                                     */
} CMU_FC_1_IER_FHHAEE_Enum;



/* =========================================================================================================================== */
/* ================                                          LPTMR0                                           ================ */
/* =========================================================================================================================== */

/* ======================================================  LPTMR0_CSR  ======================================================= */
/* =============================================  LPTMR0 LPTMR0_CSR TEN [0..0]  ============================================== */
typedef enum {                                  /*!< LPTMR0_CSR_TEN                                                            */
  LPTMR0_CSR_TEN_0                     = 0,     /*!< 0 : LPTMR is disabled and internal logic is reset.                        */
  LPTMR0_CSR_TEN_1                     = 1,     /*!< 1 : LPTMR is enabled.                                                     */
} LPTMR0_CSR_TEN_Enum;

/* =============================================  LPTMR0 LPTMR0_CSR TMS [1..1]  ============================================== */
typedef enum {                                  /*!< LPTMR0_CSR_TMS                                                            */
  LPTMR0_CSR_TMS_0                     = 0,     /*!< 0 : Time Counter mode.                                                    */
  LPTMR0_CSR_TMS_1                     = 1,     /*!< 1 : Pulse Counter mode.                                                   */
} LPTMR0_CSR_TMS_Enum;

/* =============================================  LPTMR0 LPTMR0_CSR TFC [2..2]  ============================================== */
typedef enum {                                  /*!< LPTMR0_CSR_TFC                                                            */
  LPTMR0_CSR_TFC_0                     = 0,     /*!< 0 : CNR is reset whenever TCF is set.                                     */
  LPTMR0_CSR_TFC_1                     = 1,     /*!< 1 : CNR is reset on overflow.                                             */
} LPTMR0_CSR_TFC_Enum;

