nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  LPTMR0 LPTMR0_CSR TPP [3..3]  ============================================== */
typedef enum {                                  /*!< LPTMR0_CSR_TPP                                                            */
  LPTMR0_CSR_TPP_0                     = 0,     /*!< 0 : Pulse Counter input source is active-high, and the CNR will
                                                     increment on the rising-edge.                                             */
  LPTMR0_CSR_TPP_1                     = 1,     /*!< 1 : Pulse Counter input source is active-low, and the CNR will
                                                     increment on the falling-edge.                                            */
} LPTMR0_CSR_TPP_Enum;

/* =============================================  LPTMR0 LPTMR0_CSR TPS [4..5]  ============================================== */
typedef enum {                                  /*!< LPTMR0_CSR_TPS                                                            */
  LPTMR0_CSR_TPS_00                    = 0,     /*!< 00 : Pulse counter input 0 is selected.                                   */
  LPTMR0_CSR_TPS_01                    = 1,     /*!< 01 : Pulse counter input 1 is selected.                                   */
  LPTMR0_CSR_TPS_10                    = 2,     /*!< 10 : Pulse counter input 2 is selected.                                   */
  LPTMR0_CSR_TPS_11                    = 3,     /*!< 11 : Pulse counter input 3 is selected.                                   */
} LPTMR0_CSR_TPS_Enum;

/* =============================================  LPTMR0 LPTMR0_CSR TIE [6..6]  ============================================== */
typedef enum {                                  /*!< LPTMR0_CSR_TIE                                                            */
  LPTMR0_CSR_TIE_0                     = 0,     /*!< 0 : Timer interrupt disabled.                                             */
  LPTMR0_CSR_TIE_1                     = 1,     /*!< 1 : Timer interrupt enabled.                                              */
} LPTMR0_CSR_TIE_Enum;

/* =============================================  LPTMR0 LPTMR0_CSR TCF [7..7]  ============================================== */
typedef enum {                                  /*!< LPTMR0_CSR_TCF                                                            */
  LPTMR0_CSR_TCF_0                     = 0,     /*!< 0 : The value of CNR is not equal to CMR and increments.                  */
  LPTMR0_CSR_TCF_1                     = 1,     /*!< 1 : The value of CNR is equal to CMR and increments.                      */
} LPTMR0_CSR_TCF_Enum;

/* =============================================  LPTMR0 LPTMR0_CSR TDRE [8..8]  ============================================= */
typedef enum {                                  /*!< LPTMR0_CSR_TDRE                                                           */
  LPTMR0_CSR_TDRE_0                    = 0,     /*!< 0 : Timer DMA Request disabled.                                           */
  LPTMR0_CSR_TDRE_1                    = 1,     /*!< 1 : Timer DMA Request enabled.                                            */
} LPTMR0_CSR_TDRE_Enum;

/* ======================================================  LPTMR0_PSR  ======================================================= */
/* =============================================  LPTMR0 LPTMR0_PSR PCS [0..1]  ============================================== */
typedef enum {                                  /*!< LPTMR0_PSR_PCS                                                            */
  LPTMR0_PSR_PCS_00                    = 0,     /*!< 00 : Prescaler/glitch filter clock 0 selected.                            */
  LPTMR0_PSR_PCS_01                    = 1,     /*!< 01 : Prescaler/glitch filter clock 1 selected.                            */
  LPTMR0_PSR_PCS_10                    = 2,     /*!< 10 : Prescaler/glitch filter clock 2 selected.                            */
  LPTMR0_PSR_PCS_11                    = 3,     /*!< 11 : Prescaler/glitch filter clock 3 selected.                            */
} LPTMR0_PSR_PCS_Enum;

/* =============================================  LPTMR0 LPTMR0_PSR PBYP [2..2]  ============================================= */
typedef enum {                                  /*!< LPTMR0_PSR_PBYP                                                           */
  LPTMR0_PSR_PBYP_0                    = 0,     /*!< 0 : Prescaler/glitch filter is enabled.                                   */
  LPTMR0_PSR_PBYP_1                    = 1,     /*!< 1 : Prescaler/glitch filter is bypassed.                                  */
} LPTMR0_PSR_PBYP_Enum;

/* ===========================================  LPTMR0 LPTMR0_PSR PRESCALE [3..6]  =========================================== */
typedef enum {                                  /*!< LPTMR0_PSR_PRESCALE                                                       */
  LPTMR0_PSR_PRESCALE_0000             = 0,     /*!< 0000 : Prescaler divides the prescaler clock by 2; glitch filter
                                                     does not support this configuration.                                      */
  LPTMR0_PSR_PRESCALE_0001             = 1,     /*!< 0001 : Prescaler divides the prescaler clock by 4; glitch filter
                                                     recognizes change on input pin after 2 rising clock edges.                */
  LPTMR0_PSR_PRESCALE_0010             = 2,     /*!< 0010 : Prescaler divides the prescaler clock by 8; glitch filter
                                                     recognizes change on input pin after 4 rising clock edges.                */
  LPTMR0_PSR_PRESCALE_0011             = 3,     /*!< 0011 : Prescaler divides the prescaler clock by 16; glitch filter
                                                     recognizes change on input pin after 8 rising clock edges.                */
  LPTMR0_PSR_PRESCALE_0100             = 4,     /*!< 0100 : Prescaler divides the prescaler clock by 32; glitch filter
                                                     recognizes change on input pin after 16 rising clock edges.               */
  LPTMR0_PSR_PRESCALE_0101             = 5,     /*!< 0101 : Prescaler divides the prescaler clock by 64; glitch filter
                                                     recognizes change on input pin after 32 rising clock edges.               */
  LPTMR0_PSR_PRESCALE_0110             = 6,     /*!< 0110 : Prescaler divides the prescaler clock by 128; glitch
                                                     filter recognizes change on input pin after 64 rising clock
                                                     edges.                                                                    */
  LPTMR0_PSR_PRESCALE_0111             = 7,     /*!< 0111 : Prescaler divides the prescaler clock by 256; glitch
                                                     filter recognizes change on input pin after 128 rising
                                                     clock edges.                                                              */
  LPTMR0_PSR_PRESCALE_1000             = 8,     /*!< 1000 : Prescaler divides the prescaler clock by 512; glitch
                                                     filter recognizes change on input pin after 256 rising
                                                     clock edges.                                                              */
  LPTMR0_PSR_PRESCALE_1001             = 9,     /*!< 1001 : Prescaler divides the prescaler clock by 1024; glitch
                                                     filter recognizes change on input pin after 512 rising
                                                     clock edges.                                                              */
  LPTMR0_PSR_PRESCALE_1010             = 10,    /*!< 1010 : Prescaler divides the prescaler clock by 2048; glitch
                                                     filter recognizes change on input pin after 1024 rising
                                                     clock edges.                                                              */
  LPTMR0_PSR_PRESCALE_1011             = 11,    /*!< 1011 : Prescaler divides the prescaler clock by 4096; glitch
                                                     filter recognizes change on input pin after 2048 rising
                                                     clock edges.                                                              */
  LPTMR0_PSR_PRESCALE_1100             = 12,    /*!< 1100 : Prescaler divides the prescaler clock by 8192; glitch
                                                     filter recognizes change on input pin after 4096 rising
                                                     clock edges.                                                              */
  LPTMR0_PSR_PRESCALE_1101             = 13,    /*!< 1101 : Prescaler divides the prescaler clock by 16,384; glitch
                                                     filter recognizes change on input pin after 8192 rising
                                                     clock edges.                                                              */
  LPTMR0_PSR_PRESCALE_1110             = 14,    /*!< 1110 : Prescaler divides the prescaler clock by 32,768; glitch
                                                     filter recognizes change on input pin after 16,384 rising
                                                     clock edges.                                                              */
  LPTMR0_PSR_PRESCALE_1111             = 15,    /*!< 1111 : Prescaler divides the prescaler clock by 65,536; glitch
                                                     filter recognizes change on input pin after 32,768 rising
                                                     clock edges.                                                              */
} LPTMR0_PSR_PRESCALE_Enum;

/* ======================================================  LPTMR0_CMR  ======================================================= */
/* ======================================================  LPTMR0_CNR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            SIM                                            ================ */
/* =========================================================================================================================== */

