nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  SIM_FTMOPT0  ====================================================== */
/* ==========================================  SIM SIM_FTMOPT0 FTM0FLTxSEL [0..2]  =========================================== */
typedef enum {                                  /*!< SIM_FTMOPT0_FTM0FLTxSEL                                                   */
  SIM_FTMOPT0_FTM0FLTxSEL_000          = 0,     /*!< 000 : FTM0_FLTx pin                                                       */
  SIM_FTMOPT0_FTM0FLTxSEL_001          = 1,     /*!< 001 : TRGMUX_FTM0 out                                                     */
} SIM_FTMOPT0_FTM0FLTxSEL_Enum;

/* ==========================================  SIM SIM_FTMOPT0 FTM1FLTxSEL [4..6]  =========================================== */
typedef enum {                                  /*!< SIM_FTMOPT0_FTM1FLTxSEL                                                   */
  SIM_FTMOPT0_FTM1FLTxSEL_000          = 0,     /*!< 000 : FTM1_FLTx pin                                                       */
  SIM_FTMOPT0_FTM1FLTxSEL_001          = 1,     /*!< 001 : TRGMUX_FTM1 out                                                     */
} SIM_FTMOPT0_FTM1FLTxSEL_Enum;

/* ==========================================  SIM SIM_FTMOPT0 FTM2FLTxSEL [8..10]  ========================================== */
typedef enum {                                  /*!< SIM_FTMOPT0_FTM2FLTxSEL                                                   */
  SIM_FTMOPT0_FTM2FLTxSEL_000          = 0,     /*!< 000 : FTM2_FLTx pin                                                       */
  SIM_FTMOPT0_FTM2FLTxSEL_001          = 1,     /*!< 001 : TRGMUX_FTM2 out                                                     */
} SIM_FTMOPT0_FTM2FLTxSEL_Enum;

/* =========================================  SIM SIM_FTMOPT0 FTM3FLTxSEL [12..14]  ========================================== */
typedef enum {                                  /*!< SIM_FTMOPT0_FTM3FLTxSEL                                                   */
  SIM_FTMOPT0_FTM3FLTxSEL_000          = 0,     /*!< 000 : FTM3_FLTx pin                                                       */
  SIM_FTMOPT0_FTM3FLTxSEL_001          = 1,     /*!< 001 : TRGMUX_FTM3 out                                                     */
} SIM_FTMOPT0_FTM3FLTxSEL_Enum;

/* ==========================================  SIM SIM_FTMOPT0 FTM0CLKSEL [24..25]  ========================================== */
typedef enum {                                  /*!< SIM_FTMOPT0_FTM0CLKSEL                                                    */
  SIM_FTMOPT0_FTM0CLKSEL_00            = 0,     /*!< 00 : FTM0 external clock driven by TCLK0 pin.                             */
  SIM_FTMOPT0_FTM0CLKSEL_01            = 1,     /*!< 01 : FTM0 external clock driven by TCLK1 pin.                             */
  SIM_FTMOPT0_FTM0CLKSEL_10            = 2,     /*!< 10 : FTM0 external clock driven by TCLK2 pin.                             */
  SIM_FTMOPT0_FTM0CLKSEL_11            = 3,     /*!< 11 : No clock input                                                       */
} SIM_FTMOPT0_FTM0CLKSEL_Enum;

/* ==========================================  SIM SIM_FTMOPT0 FTM1CLKSEL [26..27]  ========================================== */
typedef enum {                                  /*!< SIM_FTMOPT0_FTM1CLKSEL                                                    */
  SIM_FTMOPT0_FTM1CLKSEL_00            = 0,     /*!< 00 : FTM1 external clock driven by TCLK0 pin.                             */
  SIM_FTMOPT0_FTM1CLKSEL_01            = 1,     /*!< 01 : FTM1 external clock driven by TCLK1 pin.                             */
  SIM_FTMOPT0_FTM1CLKSEL_10            = 2,     /*!< 10 : FTM1 external clock driven by TCLK2 pin.                             */
  SIM_FTMOPT0_FTM1CLKSEL_11            = 3,     /*!< 11 : No clock input                                                       */
} SIM_FTMOPT0_FTM1CLKSEL_Enum;

/* ==========================================  SIM SIM_FTMOPT0 FTM2CLKSEL [28..29]  ========================================== */
typedef enum {                                  /*!< SIM_FTMOPT0_FTM2CLKSEL                                                    */
  SIM_FTMOPT0_FTM2CLKSEL_00            = 0,     /*!< 00 : FTM2 external clock driven by TCLK0 pin.                             */
  SIM_FTMOPT0_FTM2CLKSEL_01            = 1,     /*!< 01 : FTM2 external clock driven by TCLK1 pin.                             */
  SIM_FTMOPT0_FTM2CLKSEL_10            = 2,     /*!< 10 : FTM2 external clock driven by TCLK2 pin.                             */
  SIM_FTMOPT0_FTM2CLKSEL_11            = 3,     /*!< 11 : No clock input                                                       */
} SIM_FTMOPT0_FTM2CLKSEL_Enum;

/* ==========================================  SIM SIM_FTMOPT0 FTM3CLKSEL [30..31]  ========================================== */
typedef enum {                                  /*!< SIM_FTMOPT0_FTM3CLKSEL                                                    */
  SIM_FTMOPT0_FTM3CLKSEL_00            = 0,     /*!< 00 : FTM3 external clock driven by TCLK0 pin.                             */
  SIM_FTMOPT0_FTM3CLKSEL_01            = 1,     /*!< 01 : FTM3 external clock driven by TCLK1 pin.                             */
  SIM_FTMOPT0_FTM3CLKSEL_10            = 2,     /*!< 10 : FTM3 external clock driven by TCLK2 pin.                             */
  SIM_FTMOPT0_FTM3CLKSEL_11            = 3,     /*!< 11 : No clock input                                                       */
} SIM_FTMOPT0_FTM3CLKSEL_Enum;

/* ======================================================  SIM_LPOCLKS  ====================================================== */
/* ===========================================  SIM SIM_LPOCLKS LPO1KCLKEN [0..0]  =========================================== */
typedef enum {                                  /*!< SIM_LPOCLKS_LPO1KCLKEN                                                    */
  SIM_LPOCLKS_LPO1KCLKEN_0             = 0,     /*!< 0 : Disable 1 kHz LPO_CLK output                                          */
  SIM_LPOCLKS_LPO1KCLKEN_1             = 1,     /*!< 1 : Enable 1 kHz LPO_CLK output                                           */
} SIM_LPOCLKS_LPO1KCLKEN_Enum;

/* ==========================================  SIM SIM_LPOCLKS LPO32KCLKEN [1..1]  =========================================== */
typedef enum {                                  /*!< SIM_LPOCLKS_LPO32KCLKEN                                                   */
  SIM_LPOCLKS_LPO32KCLKEN_0            = 0,     /*!< 0 : Disable 32 kHz LPO_CLK output                                         */
  SIM_LPOCLKS_LPO32KCLKEN_1            = 1,     /*!< 1 : Enable 32 kHz LPO_CLK output                                          */
} SIM_LPOCLKS_LPO32KCLKEN_Enum;

/* ===========================================  SIM SIM_LPOCLKS LPOCLKSEL [2..3]  ============================================ */
typedef enum {                                  /*!< SIM_LPOCLKS_LPOCLKSEL                                                     */
  SIM_LPOCLKS_LPOCLKSEL_00             = 0,     /*!< 00 : 128 kHz LPO_CLK                                                      */
  SIM_LPOCLKS_LPOCLKSEL_01             = 1,     /*!< 01 : No clock                                                             */
  SIM_LPOCLKS_LPOCLKSEL_10             = 2,     /*!< 10 : 32 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK             */
  SIM_LPOCLKS_LPOCLKSEL_11             = 3,     /*!< 11 : 1 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK              */
} SIM_LPOCLKS_LPOCLKSEL_Enum;

/* ===========================================  SIM SIM_LPOCLKS RTCCLKSEL [4..5]  ============================================ */
typedef enum {                                  /*!< SIM_LPOCLKS_RTCCLKSEL                                                     */
  SIM_LPOCLKS_RTCCLKSEL_00             = 0,     /*!< 00 : SOSCDIV1_CLK                                                         */
  SIM_LPOCLKS_RTCCLKSEL_01             = 1,     /*!< 01 : 32 kHz LPO_CLK                                                       */
  SIM_LPOCLKS_RTCCLKSEL_10             = 2,     /*!< 10 : RTC_CLKIN clock                                                      */
  SIM_LPOCLKS_RTCCLKSEL_11             = 3,     /*!< 11 : FIRCDIV1_CLK                                                         */
} SIM_LPOCLKS_RTCCLKSEL_Enum;

/* ======================================================  SIM_ADCOPT  ======================================================= */
/* ===========================================  SIM SIM_ADCOPT ADC0TRGSEL [0..0]  ============================================ */
typedef enum {                                  /*!< SIM_ADCOPT_ADC0TRGSEL                                                     */
  SIM_ADCOPT_ADC0TRGSEL_0              = 0,     /*!< 0 : PDB output                                                            */
  SIM_ADCOPT_ADC0TRGSEL_1              = 1,     /*!< 1 : TRGMUX output                                                         */
} SIM_ADCOPT_ADC0TRGSEL_Enum;

/* ==========================================  SIM SIM_ADCOPT ADC0SWPRETRG [1..3]  =========================================== */
typedef enum {                                  /*!< SIM_ADCOPT_ADC0SWPRETRG                                                   */
  SIM_ADCOPT_ADC0SWPRETRG_000          = 0,     /*!< 000 : Software pretrigger disabled                                        */
  SIM_ADCOPT_ADC0SWPRETRG_001          = 1,     /*!< 001 : Reserved (do not use)                                               */
  SIM_ADCOPT_ADC0SWPRETRG_010          = 2,     /*!< 010 : Reserved (do not use)                                               */
  SIM_ADCOPT_ADC0SWPRETRG_011          = 3,     /*!< 011 : Reserved (do not use)                                               */
  SIM_ADCOPT_ADC0SWPRETRG_100          = 4,     /*!< 100 : Software pretrigger 0                                               */
  SIM_ADCOPT_ADC0SWPRETRG_101          = 5,     /*!< 101 : Software pretrigger 1                                               */
  SIM_ADCOPT_ADC0SWPRETRG_110          = 6,     /*!< 110 : Software pretrigger 2                                               */
  SIM_ADCOPT_ADC0SWPRETRG_111          = 7,     /*!< 111 : Software pretrigger 3                                               */
} SIM_ADCOPT_ADC0SWPRETRG_Enum;

/* ==========================================  SIM SIM_ADCOPT ADC0PRETRGSEL [4..5]  ========================================== */
typedef enum {                                  /*!< SIM_ADCOPT_ADC0PRETRGSEL                                                  */
  SIM_ADCOPT_ADC0PRETRGSEL_00          = 0,     /*!< 00 : PDB pretrigger (default)                                             */
  SIM_ADCOPT_ADC0PRETRGSEL_01          = 1,     /*!< 01 : TRGMUX pretrigger                                                    */
  SIM_ADCOPT_ADC0PRETRGSEL_10          = 2,     /*!< 10 : Software pretrigger                                                  */
} SIM_ADCOPT_ADC0PRETRGSEL_Enum;

/* ===========================================  SIM SIM_ADCOPT ADC1TRGSEL [8..8]  ============================================ */
typedef enum {                                  /*!< SIM_ADCOPT_ADC1TRGSEL                                                     */
  SIM_ADCOPT_ADC1TRGSEL_0              = 0,     /*!< 0 : PDB output                                                            */
  SIM_ADCOPT_ADC1TRGSEL_1              = 1,     /*!< 1 : TRGMUX output                                                         */
} SIM_ADCOPT_ADC1TRGSEL_Enum;

/* ==========================================  SIM SIM_ADCOPT ADC1SWPRETRG [9..11]  ========================================== */
typedef enum {                                  /*!< SIM_ADCOPT_ADC1SWPRETRG                                                   */
  SIM_ADCOPT_ADC1SWPRETRG_000          = 0,     /*!< 000 : Software pretrigger disabled                                        */
  SIM_ADCOPT_ADC1SWPRETRG_001          = 1,     /*!< 001 : Reserved (do not use)                                               */
  SIM_ADCOPT_ADC1SWPRETRG_010          = 2,     /*!< 010 : Reserved (do not use)                                               */
  SIM_ADCOPT_ADC1SWPRETRG_011          = 3,     /*!< 011 : Reserved (do not use)                                               */
  SIM_ADCOPT_ADC1SWPRETRG_100          = 4,     /*!< 100 : Software pretrigger 0                                               */
  SIM_ADCOPT_ADC1SWPRETRG_101          = 5,     /*!< 101 : Software pretrigger 1                                               */
  SIM_ADCOPT_ADC1SWPRETRG_110          = 6,     /*!< 110 : Software pretrigger 2                                               */
  SIM_ADCOPT_ADC1SWPRETRG_111          = 7,     /*!< 111 : Software pretrigger 3                                               */
} SIM_ADCOPT_ADC1SWPRETRG_Enum;

/* =========================================  SIM SIM_ADCOPT ADC1PRETRGSEL [12..13]  ========================================= */
typedef enum {                                  /*!< SIM_ADCOPT_ADC1PRETRGSEL                                                  */
  SIM_ADCOPT_ADC1PRETRGSEL_00          = 0,     /*!< 00 : PDB pretrigger (default)                                             */
  SIM_ADCOPT_ADC1PRETRGSEL_01          = 1,     /*!< 01 : TRGMUX pretrigger                                                    */
  SIM_ADCOPT_ADC1PRETRGSEL_10          = 2,     /*!< 10 : Software pretrigger                                                  */
} SIM_ADCOPT_ADC1PRETRGSEL_Enum;

/* ======================================================  SIM_FTMOPT1  ====================================================== */
/* ===========================================  SIM SIM_FTMOPT1 FTM1CH0SEL [4..5]  =========================================== */
typedef enum {                                  /*!< SIM_FTMOPT1_FTM1CH0SEL                                                    */
  SIM_FTMOPT1_FTM1CH0SEL_00            = 0,     /*!< 00 : FTM1_CH0 input                                                       */
  SIM_FTMOPT1_FTM1CH0SEL_01            = 1,     /*!< 01 : CMP0 output                                                          */
} SIM_FTMOPT1_FTM1CH0SEL_Enum;

/* ===========================================  SIM SIM_FTMOPT1 FTM2CH0SEL [6..7]  =========================================== */
typedef enum {                                  /*!< SIM_FTMOPT1_FTM2CH0SEL                                                    */
  SIM_FTMOPT1_FTM2CH0SEL_00            = 0,     /*!< 00 : FTM2_CH0 input                                                       */
  SIM_FTMOPT1_FTM2CH0SEL_01            = 1,     /*!< 01 : CMP0 output                                                          */
} SIM_FTMOPT1_FTM2CH0SEL_Enum;

/* ===========================================  SIM SIM_FTMOPT1 FTM2CH1SEL [8..8]  =========================================== */
typedef enum {                                  /*!< SIM_FTMOPT1_FTM2CH1SEL                                                    */
  SIM_FTMOPT1_FTM2CH1SEL_0             = 0,     /*!< 0 : FTM2_CH1 input                                                        */
  SIM_FTMOPT1_FTM2CH1SEL_1             = 1,     /*!< 1 : exclusive OR of FTM2_CH0,FTM2_CH1,and FTM1_CH1                        */
} SIM_FTMOPT1_FTM2CH1SEL_Enum;

/* ===========================================  SIM SIM_FTMOPT1 FTMGLDOK [15..15]  =========================================== */
typedef enum {                                  /*!< SIM_FTMOPT1_FTMGLDOK                                                      */
  SIM_FTMOPT1_FTMGLDOK_0               = 0,     /*!< 0 : FTM Global load mechanism disabled.                                   */
  SIM_FTMOPT1_FTMGLDOK_1               = 1,     /*!< 1 : FTM Global load mechanism enabled                                     */
} SIM_FTMOPT1_FTMGLDOK_Enum;

/* =========================================  SIM SIM_FTMOPT1 FTM0_OUTSEL [16..23]  ========================================== */
typedef enum {                                  /*!< SIM_FTMOPT1_FTM0_OUTSEL                                                   */
  SIM_FTMOPT1_FTM0_OUTSEL_00000000     = 0,     /*!< 00000000 : No modulation with FTM1_CH1                                    */
  SIM_FTMOPT1_FTM0_OUTSEL_00000001     = 1,     /*!< 00000001 : Modulation with FTM1_CH1                                       */
} SIM_FTMOPT1_FTM0_OUTSEL_Enum;

/* =========================================  SIM SIM_FTMOPT1 FTM3_OUTSEL [24..31]  ========================================== */
typedef enum {                                  /*!< SIM_FTMOPT1_FTM3_OUTSEL                                                   */
  SIM_FTMOPT1_FTM3_OUTSEL_00000000     = 0,     /*!< 00000000 : No modulation with FTM2_CH1                                    */
  SIM_FTMOPT1_FTM3_OUTSEL_00000001     = 1,     /*!< 00000001 : Modulation with FTM2_CH1                                       */
} SIM_FTMOPT1_FTM3_OUTSEL_Enum;

/* =====================================================  SIM_MISCTRL0  ====================================================== */
/* =========================================  SIM SIM_MISCTRL0 STOP1_MONITOR [9..9]  ========================================= */
typedef enum {                                  /*!< SIM_MISCTRL0_STOP1_MONITOR                                                */
  SIM_MISCTRL0_STOP1_MONITOR_0         = 0,     /*!< 0 : Bus clock enabled or STOP1 entry aborted                              */
  SIM_MISCTRL0_STOP1_MONITOR_1         = 1,     /*!< 1 : STOP1 entry successful                                                */
} SIM_MISCTRL0_STOP1_MONITOR_Enum;

/* ========================================  SIM SIM_MISCTRL0 STOP2_MONITOR [10..10]  ======================================== */
typedef enum {                                  /*!< SIM_MISCTRL0_STOP2_MONITOR                                                */
  SIM_MISCTRL0_STOP2_MONITOR_0         = 0,     /*!< 0 : System clock enabled or STOP2 entry aborted                           */
  SIM_MISCTRL0_STOP2_MONITOR_1         = 1,     /*!< 1 : STOP2 entry successful                                                */
} SIM_MISCTRL0_STOP2_MONITOR_Enum;

/* ========================================  SIM SIM_MISCTRL0 FTM0_OBE_CTRL [16..16]  ======================================== */
typedef enum {                                  /*!< SIM_MISCTRL0_FTM0_OBE_CTRL                                                */
  SIM_MISCTRL0_FTM0_OBE_CTRL_0         = 0,     /*!< 0 : The FTM channel output is put to safe state when the FTM
                                                     counter is enabled and the FTM channel output is enabled
                                                     by Fault Control (FTM_MODE[FAULTM]!=2b00 and FTM_FLTCTRL[FSTATE]=1b0)
                                                     and PWM is enabled (FTM_SC[PWMENn] = 1b1). Otherwise the
                                                     channel output is tristated.                                              */
  SIM_MISCTRL0_FTM0_OBE_CTRL_1         = 1,     /*!< 1 : The FTM channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECAPEN=1b0, COMBINE=1b0,
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECAPEN=1b1].                  */
} SIM_MISCTRL0_FTM0_OBE_CTRL_Enum;

/* ========================================  SIM SIM_MISCTRL0 FTM1_OBE_CTRL [17..17]  ======================================== */
typedef enum {                                  /*!< SIM_MISCTRL0_FTM1_OBE_CTRL                                                */
  SIM_MISCTRL0_FTM1_OBE_CTRL_0         = 0,     /*!< 0 : The FTM channel output is put to safe state when the FTM
                                                     counter is enabled and the FTM channel output is enabled
                                                     by Fault Control (FTM_MODE[FAULTM]!=2b00 and FTM_FLTCTRL[FSTATE]=1b0)
                                                     and PWM is enabled (FTM_SC[PWMENn] = 1b1). Otherwise the
                                                     channel output is tristated.                                              */
  SIM_MISCTRL0_FTM1_OBE_CTRL_1         = 1,     /*!< 1 : The FTM channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECAPEN=1b0, COMBINE=1b0,
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECAPEN=1b1].                  */
} SIM_MISCTRL0_FTM1_OBE_CTRL_Enum;

/* ========================================  SIM SIM_MISCTRL0 FTM2_OBE_CTRL [18..18]  ======================================== */
typedef enum {                                  /*!< SIM_MISCTRL0_FTM2_OBE_CTRL                                                */
  SIM_MISCTRL0_FTM2_OBE_CTRL_0         = 0,     /*!< 0 : The FTM channel output is put to safe state when the FTM
                                                     counter is enabled and the FTM channel output is enabled
                                                     by Fault Control (FTM_MODE[FAULTM]!=2b00 and FTM_FLTCTRL[FSTATE]=1b0)
                                                     and PWM is enabled (FTM_SC[PWMENn] = 1b1). Otherwise the
                                                     channel output is tristated.                                              */
  SIM_MISCTRL0_FTM2_OBE_CTRL_1         = 1,     /*!< 1 : The FTM channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECAPEN=1b0, COMBINE=1b0,
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECAPEN=1b1].                  */
} SIM_MISCTRL0_FTM2_OBE_CTRL_Enum;

