nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ========================================  SIM SIM_MISCTRL0 FTM3_OBE_CTRL [19..19]  ======================================== */
typedef enum {                                  /*!< SIM_MISCTRL0_FTM3_OBE_CTRL                                                */
  SIM_MISCTRL0_FTM3_OBE_CTRL_0         = 0,     /*!< 0 : The FTM channel output is put to safe state when the FTM
                                                     counter is enabled and the FTM channel output is enabled
                                                     by Fault Control (FTM_MODE[FAULTM]!=2b00 and FTM_FLTCTRL[FSTATE]=1b0)
                                                     and PWM is enabled (FTM_SC[PWMENn] = 1b1). Otherwise the
                                                     channel output is tristated.                                              */
  SIM_MISCTRL0_FTM3_OBE_CTRL_1         = 1,     /*!< 1 : The FTM channel output state is retained when the channel
                                                     is in output mode. The output channel is tristated when
                                                     the channel is in input capture [DECAPEN=1b0, COMBINE=1b0,
                                                     MSnB:MSnA=2b00] or dual edge capture mode [DECAPEN=1b1].                  */
} SIM_MISCTRL0_FTM3_OBE_CTRL_Enum;

/* =======================================================  SIM_SDID  ======================================================== */
/* =============================================  SIM SIM_SDID PACKAGE [8..11]  ============================================== */
typedef enum {                                  /*!< SIM_SDID_PACKAGE                                                          */
  SIM_SDID_PACKAGE_0010                = 2,     /*!< 0010 : 48 LQFP                                                            */
  SIM_SDID_PACKAGE_0011                = 3,     /*!< 0011 : 64 LQFP                                                            */
  SIM_SDID_PACKAGE_0100                = 4,     /*!< 0100 : 100 LQFP                                                           */
  SIM_SDID_PACKAGE_0110                = 6,     /*!< 0110 : 144 LQFP                                                           */
  SIM_SDID_PACKAGE_0111                = 7,     /*!< 0111 : 176 LQFP                                                           */
  SIM_SDID_PACKAGE_1000                = 8,     /*!< 1000 : 100 MAP BGA                                                        */
} SIM_SDID_PACKAGE_Enum;

/* =============================================  SIM SIM_SDID RAMSIZE [16..19]  ============================================= */
typedef enum {                                  /*!< SIM_SDID_RAMSIZE                                                          */
  SIM_SDID_RAMSIZE_1011                = 11,    /*!< 1011 : 192 KB (S32K148), 96 KB (S32K146), Reserved (others)               */
  SIM_SDID_RAMSIZE_1101                = 13,    /*!< 1101 : 48 KB (S32K144), Reserved (others)                                 */
  SIM_SDID_RAMSIZE_1111                = 15,    /*!< 1111 : 256 KB (S32K148), 128 KB (S32K146), 64 KB (S32K144),
                                                     32 KB (S32K142), 25 KB (S32K118), 17 KB (S32K116)                         */
} SIM_SDID_RAMSIZE_Enum;

/* ======================================================  SIM_PLATCGC  ====================================================== */
/* ============================================  SIM SIM_PLATCGC CGCMSCM [0..0]  ============================================= */
typedef enum {                                  /*!< SIM_PLATCGC_CGCMSCM                                                       */
  SIM_PLATCGC_CGCMSCM_0                = 0,     /*!< 0 : Clock disabled                                                        */
  SIM_PLATCGC_CGCMSCM_1                = 1,     /*!< 1 : Clock enabled                                                         */
} SIM_PLATCGC_CGCMSCM_Enum;

/* =============================================  SIM SIM_PLATCGC CGCMPU [1..1]  ============================================= */
typedef enum {                                  /*!< SIM_PLATCGC_CGCMPU                                                        */
  SIM_PLATCGC_CGCMPU_0                 = 0,     /*!< 0 : Clock disabled                                                        */
  SIM_PLATCGC_CGCMPU_1                 = 1,     /*!< 1 : Clock enabled                                                         */
} SIM_PLATCGC_CGCMPU_Enum;

/* =============================================  SIM SIM_PLATCGC CGCDMA [2..2]  ============================================= */
typedef enum {                                  /*!< SIM_PLATCGC_CGCDMA                                                        */
  SIM_PLATCGC_CGCDMA_0                 = 0,     /*!< 0 : Clock disabled                                                        */
  SIM_PLATCGC_CGCDMA_1                 = 1,     /*!< 1 : Clock enabled                                                         */
} SIM_PLATCGC_CGCDMA_Enum;

/* =============================================  SIM SIM_PLATCGC CGCERM [3..3]  ============================================= */
typedef enum {                                  /*!< SIM_PLATCGC_CGCERM                                                        */
  SIM_PLATCGC_CGCERM_0                 = 0,     /*!< 0 : Clock disabled                                                        */
  SIM_PLATCGC_CGCERM_1                 = 1,     /*!< 1 : Clock enabled                                                         */
} SIM_PLATCGC_CGCERM_Enum;

/* =============================================  SIM SIM_PLATCGC CGCEIM [4..4]  ============================================= */
typedef enum {                                  /*!< SIM_PLATCGC_CGCEIM                                                        */
  SIM_PLATCGC_CGCEIM_0                 = 0,     /*!< 0 : Clock disabled                                                        */
  SIM_PLATCGC_CGCEIM_1                 = 1,     /*!< 1 : Clock enabled                                                         */
} SIM_PLATCGC_CGCEIM_Enum;

