nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  PORTA_GPCHR  ====================================================== */
/* ============================================  PORTA PORTA_GPCHR GPWE [16..31]  ============================================ */
typedef enum {                                  /*!< PORTA_GPCHR_GPWE                                                          */
  PORTA_GPCHR_GPWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTA_GPCHR_GPWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTA_GPCHR_GPWE_Enum;

/* ======================================================  PORTA_GICLR  ====================================================== */
/* ============================================  PORTA PORTA_GICLR GIWE [0..15]  ============================================= */
typedef enum {                                  /*!< PORTA_GICLR_GIWE                                                          */
  PORTA_GICLR_GIWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTA_GICLR_GIWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTA_GICLR_GIWE_Enum;

/* ======================================================  PORTA_GICHR  ====================================================== */
/* ============================================  PORTA PORTA_GICHR GIWE [0..15]  ============================================= */
typedef enum {                                  /*!< PORTA_GICHR_GIWE                                                          */
  PORTA_GICHR_GIWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTA_GICHR_GIWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTA_GICHR_GIWE_Enum;

/* ======================================================  PORTA_ISFR  ======================================================= */
/* =============================================  PORTA PORTA_ISFR ISF [0..31]  ============================================== */
typedef enum {                                  /*!< PORTA_ISFR_ISF                                                            */
  PORTA_ISFR_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTA_ISFR_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTA_ISFR_ISF_Enum;

/* ======================================================  PORTA_DFER  ======================================================= */
/* =============================================  PORTA PORTA_DFER DFE [0..31]  ============================================== */
typedef enum {                                  /*!< PORTA_DFER_DFE                                                            */
  PORTA_DFER_DFE_0                     = 0,     /*!< 0 : Digital filter is disabled on the corresponding pin and
                                                     output of the digital filter is reset to zero.                            */
  PORTA_DFER_DFE_1                     = 1,     /*!< 1 : Digital filter is enabled on the corresponding pin, if the
                                                     pin is configured as a digital input.                                     */
} PORTA_DFER_DFE_Enum;

/* ======================================================  PORTA_DFCR  ======================================================= */
/* ==============================================  PORTA PORTA_DFCR CS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTA_DFCR_CS                                                             */
  PORTA_DFCR_CS_0                      = 0,     /*!< 0 : Digital filters are clocked by the bus clock.                         */
  PORTA_DFCR_CS_1                      = 1,     /*!< 1 : Digital filters are clocked by the LPO clock.                         */
} PORTA_DFCR_CS_Enum;

/* ======================================================  PORTA_DFWR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           PORTB                                           ================ */
/* =========================================================================================================================== */

