nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  PORTB PORTB_PCR19 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTB_PCR19_ISF                                                           */
  PORTB_PCR19_ISF_0                    = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTB_PCR19_ISF_1                    = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTB_PCR19_ISF_Enum;

/* ======================================================  PORTB_PCR20  ====================================================== */
/* ==============================================  PORTB PORTB_PCR20 PS [0..0]  ============================================== */
typedef enum {                                  /*!< PORTB_PCR20_PS                                                            */
  PORTB_PCR20_PS_0                     = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTB_PCR20_PS_1                     = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTB_PCR20_PS_Enum;

/* ==============================================  PORTB PORTB_PCR20 PE [1..1]  ============================================== */
typedef enum {                                  /*!< PORTB_PCR20_PE                                                            */
  PORTB_PCR20_PE_0                     = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTB_PCR20_PE_1                     = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTB_PCR20_PE_Enum;

/* =============================================  PORTB PORTB_PCR20 MUX [8..10]  ============================================= */
typedef enum {                                  /*!< PORTB_PCR20_MUX                                                           */
  PORTB_PCR20_MUX_000                  = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTB_PCR20_MUX_001                  = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTB_PCR20_MUX_010                  = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTB_PCR20_MUX_011                  = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTB_PCR20_MUX_100                  = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTB_PCR20_MUX_101                  = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTB_PCR20_MUX_110                  = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTB_PCR20_MUX_111                  = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTB_PCR20_MUX_Enum;

/* =============================================  PORTB PORTB_PCR20 LK [15..15]  ============================================= */
typedef enum {                                  /*!< PORTB_PCR20_LK                                                            */
  PORTB_PCR20_LK_0                     = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTB_PCR20_LK_1                     = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTB_PCR20_LK_Enum;

/* ============================================  PORTB PORTB_PCR20 IRQC [16..19]  ============================================ */
typedef enum {                                  /*!< PORTB_PCR20_IRQC                                                          */
  PORTB_PCR20_IRQC_0000                = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTB_PCR20_IRQC_0001                = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTB_PCR20_IRQC_0010                = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTB_PCR20_IRQC_0011                = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTB_PCR20_IRQC_1000                = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTB_PCR20_IRQC_1001                = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTB_PCR20_IRQC_1010                = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTB_PCR20_IRQC_1011                = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTB_PCR20_IRQC_1100                = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTB_PCR20_IRQC_Enum;

