nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  PORTB PORTB_PCR31 IRQC [16..19]  ============================================ */
typedef enum {                                  /*!< PORTB_PCR31_IRQC                                                          */
  PORTB_PCR31_IRQC_0000                = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTB_PCR31_IRQC_0001                = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTB_PCR31_IRQC_0010                = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTB_PCR31_IRQC_0011                = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTB_PCR31_IRQC_1000                = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTB_PCR31_IRQC_1001                = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTB_PCR31_IRQC_1010                = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTB_PCR31_IRQC_1011                = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTB_PCR31_IRQC_1100                = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTB_PCR31_IRQC_Enum;

/* ============================================  PORTB PORTB_PCR31 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTB_PCR31_ISF                                                           */
  PORTB_PCR31_ISF_0                    = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTB_PCR31_ISF_1                    = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTB_PCR31_ISF_Enum;

/* ======================================================  PORTB_GPCLR  ====================================================== */
/* ============================================  PORTB PORTB_GPCLR GPWE [16..31]  ============================================ */
typedef enum {                                  /*!< PORTB_GPCLR_GPWE                                                          */
  PORTB_GPCLR_GPWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTB_GPCLR_GPWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTB_GPCLR_GPWE_Enum;

/* ======================================================  PORTB_GPCHR  ====================================================== */
/* ============================================  PORTB PORTB_GPCHR GPWE [16..31]  ============================================ */
typedef enum {                                  /*!< PORTB_GPCHR_GPWE                                                          */
  PORTB_GPCHR_GPWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTB_GPCHR_GPWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTB_GPCHR_GPWE_Enum;

/* ======================================================  PORTB_GICLR  ====================================================== */
/* ============================================  PORTB PORTB_GICLR GIWE [0..15]  ============================================= */
typedef enum {                                  /*!< PORTB_GICLR_GIWE                                                          */
  PORTB_GICLR_GIWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTB_GICLR_GIWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTB_GICLR_GIWE_Enum;

/* ======================================================  PORTB_GICHR  ====================================================== */
/* ============================================  PORTB PORTB_GICHR GIWE [0..15]  ============================================= */
typedef enum {                                  /*!< PORTB_GICHR_GIWE                                                          */
  PORTB_GICHR_GIWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTB_GICHR_GIWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTB_GICHR_GIWE_Enum;

/* ======================================================  PORTB_ISFR  ======================================================= */
/* =============================================  PORTB PORTB_ISFR ISF [0..31]  ============================================== */
typedef enum {                                  /*!< PORTB_ISFR_ISF                                                            */
  PORTB_ISFR_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTB_ISFR_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTB_ISFR_ISF_Enum;

/* ======================================================  PORTB_DFER  ======================================================= */
/* =============================================  PORTB PORTB_DFER DFE [0..31]  ============================================== */
typedef enum {                                  /*!< PORTB_DFER_DFE                                                            */
  PORTB_DFER_DFE_0                     = 0,     /*!< 0 : Digital filter is disabled on the corresponding pin and
                                                     output of the digital filter is reset to zero.                            */
  PORTB_DFER_DFE_1                     = 1,     /*!< 1 : Digital filter is enabled on the corresponding pin, if the
                                                     pin is configured as a digital input.                                     */
} PORTB_DFER_DFE_Enum;

