nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  PORTC PORTC_PCR31 MUX [8..10]  ============================================= */
typedef enum {                                  /*!< PORTC_PCR31_MUX                                                           */
  PORTC_PCR31_MUX_000                  = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTC_PCR31_MUX_001                  = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTC_PCR31_MUX_010                  = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTC_PCR31_MUX_011                  = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTC_PCR31_MUX_100                  = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTC_PCR31_MUX_101                  = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTC_PCR31_MUX_110                  = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTC_PCR31_MUX_111                  = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTC_PCR31_MUX_Enum;

/* =============================================  PORTC PORTC_PCR31 LK [15..15]  ============================================= */
typedef enum {                                  /*!< PORTC_PCR31_LK                                                            */
  PORTC_PCR31_LK_0                     = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTC_PCR31_LK_1                     = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTC_PCR31_LK_Enum;

/* ============================================  PORTC PORTC_PCR31 IRQC [16..19]  ============================================ */
typedef enum {                                  /*!< PORTC_PCR31_IRQC                                                          */
  PORTC_PCR31_IRQC_0000                = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTC_PCR31_IRQC_0001                = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTC_PCR31_IRQC_0010                = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTC_PCR31_IRQC_0011                = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTC_PCR31_IRQC_1000                = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTC_PCR31_IRQC_1001                = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTC_PCR31_IRQC_1010                = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTC_PCR31_IRQC_1011                = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTC_PCR31_IRQC_1100                = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTC_PCR31_IRQC_Enum;

/* ============================================  PORTC PORTC_PCR31 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTC_PCR31_ISF                                                           */
  PORTC_PCR31_ISF_0                    = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTC_PCR31_ISF_1                    = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTC_PCR31_ISF_Enum;

/* ======================================================  PORTC_GPCLR  ====================================================== */
/* ============================================  PORTC PORTC_GPCLR GPWE [16..31]  ============================================ */
typedef enum {                                  /*!< PORTC_GPCLR_GPWE                                                          */
  PORTC_GPCLR_GPWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTC_GPCLR_GPWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTC_GPCLR_GPWE_Enum;

/* ======================================================  PORTC_GPCHR  ====================================================== */
/* ============================================  PORTC PORTC_GPCHR GPWE [16..31]  ============================================ */
typedef enum {                                  /*!< PORTC_GPCHR_GPWE                                                          */
  PORTC_GPCHR_GPWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTC_GPCHR_GPWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTC_GPCHR_GPWE_Enum;

/* ======================================================  PORTC_GICLR  ====================================================== */
/* ============================================  PORTC PORTC_GICLR GIWE [0..15]  ============================================= */
typedef enum {                                  /*!< PORTC_GICLR_GIWE                                                          */
  PORTC_GICLR_GIWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTC_GICLR_GIWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTC_GICLR_GIWE_Enum;

/* ======================================================  PORTC_GICHR  ====================================================== */
/* ============================================  PORTC PORTC_GICHR GIWE [0..15]  ============================================= */
typedef enum {                                  /*!< PORTC_GICHR_GIWE                                                          */
  PORTC_GICHR_GIWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTC_GICHR_GIWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTC_GICHR_GIWE_Enum;

/* ======================================================  PORTC_ISFR  ======================================================= */
/* =============================================  PORTC PORTC_ISFR ISF [0..31]  ============================================== */
typedef enum {                                  /*!< PORTC_ISFR_ISF                                                            */
  PORTC_ISFR_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTC_ISFR_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTC_ISFR_ISF_Enum;

/* ======================================================  PORTC_DFER  ======================================================= */
/* =============================================  PORTC PORTC_DFER DFE [0..31]  ============================================== */
typedef enum {                                  /*!< PORTC_DFER_DFE                                                            */
  PORTC_DFER_DFE_0                     = 0,     /*!< 0 : Digital filter is disabled on the corresponding pin and
                                                     output of the digital filter is reset to zero.                            */
  PORTC_DFER_DFE_1                     = 1,     /*!< 1 : Digital filter is enabled on the corresponding pin, if the
                                                     pin is configured as a digital input.                                     */
} PORTC_DFER_DFE_Enum;

/* ======================================================  PORTC_DFCR  ======================================================= */
/* ==============================================  PORTC PORTC_DFCR CS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTC_DFCR_CS                                                             */
  PORTC_DFCR_CS_0                      = 0,     /*!< 0 : Digital filters are clocked by the bus clock.                         */
  PORTC_DFCR_CS_1                      = 1,     /*!< 1 : Digital filters are clocked by the LPO clock.                         */
} PORTC_DFCR_CS_Enum;

/* ======================================================  PORTC_DFWR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           PORTD                                           ================ */
/* =========================================================================================================================== */

/* ======================================================  PORTD_PCR0  ======================================================= */
/* ==============================================  PORTD PORTD_PCR0 PS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTD_PCR0_PS                                                             */
  PORTD_PCR0_PS_0                      = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTD_PCR0_PS_1                      = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTD_PCR0_PS_Enum;

/* ==============================================  PORTD PORTD_PCR0 PE [1..1]  =============================================== */
typedef enum {                                  /*!< PORTD_PCR0_PE                                                             */
  PORTD_PCR0_PE_0                      = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTD_PCR0_PE_1                      = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTD_PCR0_PE_Enum;

/* ==============================================  PORTD PORTD_PCR0 DSE [6..6]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR0_DSE                                                            */
  PORTD_PCR0_DSE_0                     = 0,     /*!< 0 : Low drive strength is configured on the corresponding pin,
                                                     if pin is configured as a digital output.                                 */
  PORTD_PCR0_DSE_1                     = 1,     /*!< 1 : High drive strength is configured on the corresponding pin,
                                                     if pin is configured as a digital output.                                 */
} PORTD_PCR0_DSE_Enum;

/* =============================================  PORTD PORTD_PCR0 MUX [8..10]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR0_MUX                                                            */
  PORTD_PCR0_MUX_000                   = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTD_PCR0_MUX_001                   = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTD_PCR0_MUX_010                   = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTD_PCR0_MUX_011                   = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTD_PCR0_MUX_100                   = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTD_PCR0_MUX_101                   = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTD_PCR0_MUX_110                   = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTD_PCR0_MUX_111                   = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTD_PCR0_MUX_Enum;

/* =============================================  PORTD PORTD_PCR0 LK [15..15]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR0_LK                                                             */
  PORTD_PCR0_LK_0                      = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTD_PCR0_LK_1                      = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTD_PCR0_LK_Enum;

/* ============================================  PORTD PORTD_PCR0 IRQC [16..19]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR0_IRQC                                                           */
  PORTD_PCR0_IRQC_0000                 = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTD_PCR0_IRQC_0001                 = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTD_PCR0_IRQC_0010                 = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTD_PCR0_IRQC_0011                 = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTD_PCR0_IRQC_1000                 = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTD_PCR0_IRQC_1001                 = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTD_PCR0_IRQC_1010                 = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTD_PCR0_IRQC_1011                 = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTD_PCR0_IRQC_1100                 = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTD_PCR0_IRQC_Enum;

/* =============================================  PORTD PORTD_PCR0 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR0_ISF                                                            */
  PORTD_PCR0_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTD_PCR0_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTD_PCR0_ISF_Enum;

