nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  PORTD PORTD_PCR5 LK [15..15]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR5_LK                                                             */
  PORTD_PCR5_LK_0                      = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTD_PCR5_LK_1                      = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTD_PCR5_LK_Enum;

/* ============================================  PORTD PORTD_PCR5 IRQC [16..19]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR5_IRQC                                                           */
  PORTD_PCR5_IRQC_0000                 = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTD_PCR5_IRQC_0001                 = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTD_PCR5_IRQC_0010                 = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTD_PCR5_IRQC_0011                 = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTD_PCR5_IRQC_1000                 = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTD_PCR5_IRQC_1001                 = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTD_PCR5_IRQC_1010                 = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTD_PCR5_IRQC_1011                 = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTD_PCR5_IRQC_1100                 = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTD_PCR5_IRQC_Enum;

/* =============================================  PORTD PORTD_PCR5 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR5_ISF                                                            */
  PORTD_PCR5_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTD_PCR5_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTD_PCR5_ISF_Enum;

/* ======================================================  PORTD_PCR6  ======================================================= */
/* ==============================================  PORTD PORTD_PCR6 PS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTD_PCR6_PS                                                             */
  PORTD_PCR6_PS_0                      = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTD_PCR6_PS_1                      = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTD_PCR6_PS_Enum;

/* ==============================================  PORTD PORTD_PCR6 PE [1..1]  =============================================== */
typedef enum {                                  /*!< PORTD_PCR6_PE                                                             */
  PORTD_PCR6_PE_0                      = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTD_PCR6_PE_1                      = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTD_PCR6_PE_Enum;

/* =============================================  PORTD PORTD_PCR6 MUX [8..10]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR6_MUX                                                            */
  PORTD_PCR6_MUX_000                   = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTD_PCR6_MUX_001                   = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTD_PCR6_MUX_010                   = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTD_PCR6_MUX_011                   = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTD_PCR6_MUX_100                   = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTD_PCR6_MUX_101                   = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTD_PCR6_MUX_110                   = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTD_PCR6_MUX_111                   = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTD_PCR6_MUX_Enum;

/* =============================================  PORTD PORTD_PCR6 LK [15..15]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR6_LK                                                             */
  PORTD_PCR6_LK_0                      = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTD_PCR6_LK_1                      = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTD_PCR6_LK_Enum;

/* ============================================  PORTD PORTD_PCR6 IRQC [16..19]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR6_IRQC                                                           */
  PORTD_PCR6_IRQC_0000                 = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTD_PCR6_IRQC_0001                 = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTD_PCR6_IRQC_0010                 = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTD_PCR6_IRQC_0011                 = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTD_PCR6_IRQC_1000                 = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTD_PCR6_IRQC_1001                 = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTD_PCR6_IRQC_1010                 = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTD_PCR6_IRQC_1011                 = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTD_PCR6_IRQC_1100                 = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTD_PCR6_IRQC_Enum;

/* =============================================  PORTD PORTD_PCR6 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR6_ISF                                                            */
  PORTD_PCR6_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTD_PCR6_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTD_PCR6_ISF_Enum;

/* ======================================================  PORTD_PCR7  ======================================================= */
/* ==============================================  PORTD PORTD_PCR7 PS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTD_PCR7_PS                                                             */
  PORTD_PCR7_PS_0                      = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTD_PCR7_PS_1                      = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTD_PCR7_PS_Enum;

/* ==============================================  PORTD PORTD_PCR7 PE [1..1]  =============================================== */
typedef enum {                                  /*!< PORTD_PCR7_PE                                                             */
  PORTD_PCR7_PE_0                      = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTD_PCR7_PE_1                      = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTD_PCR7_PE_Enum;

