nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  PORTD PORTD_PCR30 IRQC [16..19]  ============================================ */
typedef enum {                                  /*!< PORTD_PCR30_IRQC                                                          */
  PORTD_PCR30_IRQC_0000                = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTD_PCR30_IRQC_0001                = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTD_PCR30_IRQC_0010                = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTD_PCR30_IRQC_0011                = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTD_PCR30_IRQC_1000                = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTD_PCR30_IRQC_1001                = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTD_PCR30_IRQC_1010                = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTD_PCR30_IRQC_1011                = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTD_PCR30_IRQC_1100                = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTD_PCR30_IRQC_Enum;

/* ============================================  PORTD PORTD_PCR30 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR30_ISF                                                           */
  PORTD_PCR30_ISF_0                    = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTD_PCR30_ISF_1                    = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTD_PCR30_ISF_Enum;

/* ======================================================  PORTD_PCR31  ====================================================== */
/* ==============================================  PORTD PORTD_PCR31 PS [0..0]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR31_PS                                                            */
  PORTD_PCR31_PS_0                     = 0,     /*!< 0 : Internal pulldown resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
  PORTD_PCR31_PS_1                     = 1,     /*!< 1 : Internal pullup resistor is enabled on the corresponding
                                                     pin, if the corresponding PE field is set.                                */
} PORTD_PCR31_PS_Enum;

/* ==============================================  PORTD PORTD_PCR31 PE [1..1]  ============================================== */
typedef enum {                                  /*!< PORTD_PCR31_PE                                                            */
  PORTD_PCR31_PE_0                     = 0,     /*!< 0 : Internal pullup or pulldown resistor is not enabled on the
                                                     corresponding pin.                                                        */
  PORTD_PCR31_PE_1                     = 1,     /*!< 1 : Internal pullup or pulldown resistor is enabled on the corresponding
                                                     pin, if the pin is configured as a digital input.                         */
} PORTD_PCR31_PE_Enum;

/* =============================================  PORTD PORTD_PCR31 MUX [8..10]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR31_MUX                                                           */
  PORTD_PCR31_MUX_000                  = 0,     /*!< 000 : Pin disabled (Alternative 0) (analog).                              */
  PORTD_PCR31_MUX_001                  = 1,     /*!< 001 : Alternative 1 (GPIO).                                               */
  PORTD_PCR31_MUX_010                  = 2,     /*!< 010 : Alternative 2 (chip-specific).                                      */
  PORTD_PCR31_MUX_011                  = 3,     /*!< 011 : Alternative 3 (chip-specific).                                      */
  PORTD_PCR31_MUX_100                  = 4,     /*!< 100 : Alternative 4 (chip-specific).                                      */
  PORTD_PCR31_MUX_101                  = 5,     /*!< 101 : Alternative 5 (chip-specific).                                      */
  PORTD_PCR31_MUX_110                  = 6,     /*!< 110 : Alternative 6 (chip-specific).                                      */
  PORTD_PCR31_MUX_111                  = 7,     /*!< 111 : Alternative 7 (chip-specific).                                      */
} PORTD_PCR31_MUX_Enum;

/* =============================================  PORTD PORTD_PCR31 LK [15..15]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR31_LK                                                            */
  PORTD_PCR31_LK_0                     = 0,     /*!< 0 : Pin Control Register fields [15:0] are not locked.                    */
  PORTD_PCR31_LK_1                     = 1,     /*!< 1 : Pin Control Register fields [15:0] are locked and cannot
                                                     be updated until the next system reset.                                   */
} PORTD_PCR31_LK_Enum;

/* ============================================  PORTD PORTD_PCR31 IRQC [16..19]  ============================================ */
typedef enum {                                  /*!< PORTD_PCR31_IRQC                                                          */
  PORTD_PCR31_IRQC_0000                = 0,     /*!< 0000 : Interrupt Status Flag (ISF) is disabled.                           */
  PORTD_PCR31_IRQC_0001                = 1,     /*!< 0001 : ISF flag and DMA request on rising edge.                           */
  PORTD_PCR31_IRQC_0010                = 2,     /*!< 0010 : ISF flag and DMA request on falling edge.                          */
  PORTD_PCR31_IRQC_0011                = 3,     /*!< 0011 : ISF flag and DMA request on either edge.                           */
  PORTD_PCR31_IRQC_1000                = 8,     /*!< 1000 : ISF flag and Interrupt when logic 0.                               */
  PORTD_PCR31_IRQC_1001                = 9,     /*!< 1001 : ISF flag and Interrupt on rising-edge.                             */
  PORTD_PCR31_IRQC_1010                = 10,    /*!< 1010 : ISF flag and Interrupt on falling-edge.                            */
  PORTD_PCR31_IRQC_1011                = 11,    /*!< 1011 : ISF flag and Interrupt on either edge.                             */
  PORTD_PCR31_IRQC_1100                = 12,    /*!< 1100 : ISF flag and Interrupt when logic 1.                               */
} PORTD_PCR31_IRQC_Enum;

/* ============================================  PORTD PORTD_PCR31 ISF [24..24]  ============================================= */
typedef enum {                                  /*!< PORTD_PCR31_ISF                                                           */
  PORTD_PCR31_ISF_0                    = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTD_PCR31_ISF_1                    = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTD_PCR31_ISF_Enum;

/* ======================================================  PORTD_GPCLR  ====================================================== */
/* ============================================  PORTD PORTD_GPCLR GPWE [16..31]  ============================================ */
typedef enum {                                  /*!< PORTD_GPCLR_GPWE                                                          */
  PORTD_GPCLR_GPWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTD_GPCLR_GPWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTD_GPCLR_GPWE_Enum;

/* ======================================================  PORTD_GPCHR  ====================================================== */
/* ============================================  PORTD PORTD_GPCHR GPWE [16..31]  ============================================ */
typedef enum {                                  /*!< PORTD_GPCHR_GPWE                                                          */
  PORTD_GPCHR_GPWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTD_GPCHR_GPWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTD_GPCHR_GPWE_Enum;

/* ======================================================  PORTD_GICLR  ====================================================== */
/* ============================================  PORTD PORTD_GICLR GIWE [0..15]  ============================================= */
typedef enum {                                  /*!< PORTD_GICLR_GIWE                                                          */
  PORTD_GICLR_GIWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTD_GICLR_GIWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTD_GICLR_GIWE_Enum;

/* ======================================================  PORTD_GICHR  ====================================================== */
/* ============================================  PORTD PORTD_GICHR GIWE [0..15]  ============================================= */
typedef enum {                                  /*!< PORTD_GICHR_GIWE                                                          */
  PORTD_GICHR_GIWE_0                   = 0,     /*!< 0 : Corresponding Pin Control Register is not updated with the
                                                     value in GPWD.                                                            */
  PORTD_GICHR_GIWE_1                   = 1,     /*!< 1 : Corresponding Pin Control Register is updated with the value
                                                     in GPWD.                                                                  */
} PORTD_GICHR_GIWE_Enum;

/* ======================================================  PORTD_ISFR  ======================================================= */
/* =============================================  PORTD PORTD_ISFR ISF [0..31]  ============================================== */
typedef enum {                                  /*!< PORTD_ISFR_ISF                                                            */
  PORTD_ISFR_ISF_0                     = 0,     /*!< 0 : Configured interrupt is not detected.                                 */
  PORTD_ISFR_ISF_1                     = 1,     /*!< 1 : Configured interrupt is detected. If the pin is configured
                                                     to generate a DMA request, then the corresponding flag
                                                     will be cleared automatically at the completion of the
                                                     requested DMA transfer. Otherwise, the flag remains set
                                                     until a logic 1 is written to the flag. If the pin is configured
                                                     for a level sensitive interrupt and the pin remains asserted,
                                                     then the flag is set again immediately after it is cleared.               */
} PORTD_ISFR_ISF_Enum;

/* ======================================================  PORTD_DFER  ======================================================= */
/* =============================================  PORTD PORTD_DFER DFE [0..31]  ============================================== */
typedef enum {                                  /*!< PORTD_DFER_DFE                                                            */
  PORTD_DFER_DFE_0                     = 0,     /*!< 0 : Digital filter is disabled on the corresponding pin and
                                                     output of the digital filter is reset to zero.                            */
  PORTD_DFER_DFE_1                     = 1,     /*!< 1 : Digital filter is enabled on the corresponding pin, if the
                                                     pin is configured as a digital input.                                     */
} PORTD_DFER_DFE_Enum;

/* ======================================================  PORTD_DFCR  ======================================================= */
/* ==============================================  PORTD PORTD_DFCR CS [0..0]  =============================================== */
typedef enum {                                  /*!< PORTD_DFCR_CS                                                             */
  PORTD_DFCR_CS_0                      = 0,     /*!< 0 : Digital filters are clocked by the bus clock.                         */
  PORTD_DFCR_CS_1                      = 1,     /*!< 1 : Digital filters are clocked by the LPO clock.                         */
} PORTD_DFCR_CS_Enum;

/* ======================================================  PORTD_DFWR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           PORTE                                           ================ */
/* =========================================================================================================================== */

