nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  WDOG WDOG_CS CMD32EN [13..13]  ============================================= */
typedef enum {                                  /*!< WDOG_CS_CMD32EN                                                           */
  WDOG_CS_CMD32EN_0                    = 0,     /*!< 0 : Disables support for 32-bit refresh/unlock command write
                                                     words. Only 16-bit or 8-bit is supported.                                 */
  WDOG_CS_CMD32EN_1                    = 1,     /*!< 1 : Enables support for 32-bit refresh/unlock command write
                                                     words. 16-bit or 8-bit is NOT supported.                                  */
} WDOG_CS_CMD32EN_Enum;

/* ===============================================  WDOG WDOG_CS FLG [14..14]  =============================================== */
typedef enum {                                  /*!< WDOG_CS_FLG                                                               */
  WDOG_CS_FLG_0                        = 0,     /*!< 0 : No interrupt occurred.                                                */
  WDOG_CS_FLG_1                        = 1,     /*!< 1 : An interrupt occurred.                                                */
} WDOG_CS_FLG_Enum;

/* ===============================================  WDOG WDOG_CS WIN [15..15]  =============================================== */
typedef enum {                                  /*!< WDOG_CS_WIN                                                               */
  WDOG_CS_WIN_0                        = 0,     /*!< 0 : Window mode disabled.                                                 */
  WDOG_CS_WIN_1                        = 1,     /*!< 1 : Window mode enabled.                                                  */
} WDOG_CS_WIN_Enum;

/* =======================================================  WDOG_CNT  ======================================================== */
/* ======================================================  WDOG_TOVAL  ======================================================= */
/* =======================================================  WDOG_WIN  ======================================================== */


/* =========================================================================================================================== */
/* ================                                          FLEXIO                                           ================ */
/* =========================================================================================================================== */

/* =====================================================  FLEXIO_VERID  ====================================================== */
/* ==========================================  FLEXIO FLEXIO_VERID FEATURE [0..15]  ========================================== */
typedef enum {                                  /*!< FLEXIO_VERID_FEATURE                                                      */
  FLEXIO_VERID_FEATURE_0000000000000000 = 0,    /*!< 0000000000000000 : Standard features implemented.                         */
  FLEXIO_VERID_FEATURE_0000000000000001 = 1,    /*!< 0000000000000001 : Supports state, logic and parallel modes.              */
} FLEXIO_VERID_FEATURE_Enum;

/* =====================================================  FLEXIO_PARAM  ====================================================== */
/* ======================================================  FLEXIO_CTRL  ====================================================== */
/* ===========================================  FLEXIO FLEXIO_CTRL FLEXEN [0..0]  ============================================ */
typedef enum {                                  /*!< FLEXIO_CTRL_FLEXEN                                                        */
  FLEXIO_CTRL_FLEXEN_0                 = 0,     /*!< 0 : FlexIO module is disabled.                                            */
  FLEXIO_CTRL_FLEXEN_1                 = 1,     /*!< 1 : FlexIO module is enabled.                                             */
} FLEXIO_CTRL_FLEXEN_Enum;

/* ============================================  FLEXIO FLEXIO_CTRL SWRST [1..1]  ============================================ */
typedef enum {                                  /*!< FLEXIO_CTRL_SWRST                                                         */
  FLEXIO_CTRL_SWRST_0                  = 0,     /*!< 0 : Software reset is disabled                                            */
  FLEXIO_CTRL_SWRST_1                  = 1,     /*!< 1 : Software reset is enabled, all FlexIO registers except the
                                                     Control Register are reset.                                               */
} FLEXIO_CTRL_SWRST_Enum;

/* ===========================================  FLEXIO FLEXIO_CTRL FASTACC [2..2]  =========================================== */
typedef enum {                                  /*!< FLEXIO_CTRL_FASTACC                                                       */
  FLEXIO_CTRL_FASTACC_0                = 0,     /*!< 0 : Configures for normal register accesses to FlexIO                     */
  FLEXIO_CTRL_FASTACC_1                = 1,     /*!< 1 : Configures for fast register accesses to FlexIO                       */
} FLEXIO_CTRL_FASTACC_Enum;

/* ===========================================  FLEXIO FLEXIO_CTRL DBGE [30..30]  ============================================ */
typedef enum {                                  /*!< FLEXIO_CTRL_DBGE                                                          */
  FLEXIO_CTRL_DBGE_0                   = 0,     /*!< 0 : FlexIO is disabled in debug modes.                                    */
  FLEXIO_CTRL_DBGE_1                   = 1,     /*!< 1 : FlexIO is enabled in debug modes                                      */
} FLEXIO_CTRL_DBGE_Enum;

/* ===========================================  FLEXIO FLEXIO_CTRL DOZEN [31..31]  =========================================== */
typedef enum {                                  /*!< FLEXIO_CTRL_DOZEN                                                         */
  FLEXIO_CTRL_DOZEN_0                  = 0,     /*!< 0 : FlexIO enabled in Doze modes.                                         */
  FLEXIO_CTRL_DOZEN_1                  = 1,     /*!< 1 : FlexIO disabled in Doze modes.                                        */
} FLEXIO_CTRL_DOZEN_Enum;

/* ======================================================  FLEXIO_PIN  ======================================================= */
/* ===================================================  FLEXIO_SHIFTSTAT  ==================================================== */
/* ====================================================  FLEXIO_SHIFTERR  ==================================================== */
/* ====================================================  FLEXIO_TIMSTAT  ===================================================== */
/* ===================================================  FLEXIO_SHIFTSIEN  ==================================================== */
/* ===================================================  FLEXIO_SHIFTEIEN  ==================================================== */
/* =====================================================  FLEXIO_TIMIEN  ===================================================== */
/* ===================================================  FLEXIO_SHIFTSDEN  ==================================================== */
/* ===================================================  FLEXIO_SHIFTCTL0  ==================================================== */
/* ==========================================  FLEXIO FLEXIO_SHIFTCTL0 SMOD [0..2]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL0_SMOD                                                     */
  FLEXIO_SHIFTCTL0_SMOD_0              = 0,     /*!< 0 : Disabled.                                                             */
  FLEXIO_SHIFTCTL0_SMOD_1              = 1,     /*!< 1 : Receive mode. Captures the current Shifter content into
                                                     the SHIFTBUF on expiration of the Timer.                                  */
  FLEXIO_SHIFTCTL0_SMOD_10             = 2,     /*!< 10 : Transmit mode. Load SHIFTBUF contents into the Shifter
                                                     on expiration of the Timer.                                               */
  FLEXIO_SHIFTCTL0_SMOD_100            = 4,     /*!< 100 : Match Store mode. Shifter data is compared to SHIFTBUF
                                                     content on expiration of the Timer.                                       */
  FLEXIO_SHIFTCTL0_SMOD_101            = 5,     /*!< 101 : Match Continuous mode. Shifter data is continuously compared
                                                     to SHIFTBUF contents.                                                     */
} FLEXIO_SHIFTCTL0_SMOD_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCTL0 PINPOL [7..7]  ========================================= */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL0_PINPOL                                                   */
  FLEXIO_SHIFTCTL0_PINPOL_0            = 0,     /*!< 0 : Pin is active high                                                    */
  FLEXIO_SHIFTCTL0_PINPOL_1            = 1,     /*!< 1 : Pin is active low                                                     */
} FLEXIO_SHIFTCTL0_PINPOL_Enum;

/* ========================================  FLEXIO FLEXIO_SHIFTCTL0 PINCFG [16..17]  ======================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL0_PINCFG                                                   */
  FLEXIO_SHIFTCTL0_PINCFG_0            = 0,     /*!< 0 : Shifter pin output disabled                                           */
  FLEXIO_SHIFTCTL0_PINCFG_1            = 1,     /*!< 1 : Shifter pin open drain or bidirectional output enable                 */
  FLEXIO_SHIFTCTL0_PINCFG_10           = 2,     /*!< 10 : Shifter pin bidirectional output data                                */
  FLEXIO_SHIFTCTL0_PINCFG_11           = 3,     /*!< 11 : Shifter pin output                                                   */
} FLEXIO_SHIFTCTL0_PINCFG_Enum;

/* ========================================  FLEXIO FLEXIO_SHIFTCTL0 TIMPOL [23..23]  ======================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL0_TIMPOL                                                   */
  FLEXIO_SHIFTCTL0_TIMPOL_0            = 0,     /*!< 0 : Shift on posedge of Shift clock                                       */
  FLEXIO_SHIFTCTL0_TIMPOL_1            = 1,     /*!< 1 : Shift on negedge of Shift clock                                       */
} FLEXIO_SHIFTCTL0_TIMPOL_Enum;

/* ===================================================  FLEXIO_SHIFTCTL1  ==================================================== */
/* ==========================================  FLEXIO FLEXIO_SHIFTCTL1 SMOD [0..2]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL1_SMOD                                                     */
  FLEXIO_SHIFTCTL1_SMOD_0              = 0,     /*!< 0 : Disabled.                                                             */
  FLEXIO_SHIFTCTL1_SMOD_1              = 1,     /*!< 1 : Receive mode. Captures the current Shifter content into
                                                     the SHIFTBUF on expiration of the Timer.                                  */
  FLEXIO_SHIFTCTL1_SMOD_10             = 2,     /*!< 10 : Transmit mode. Load SHIFTBUF contents into the Shifter
                                                     on expiration of the Timer.                                               */
  FLEXIO_SHIFTCTL1_SMOD_100            = 4,     /*!< 100 : Match Store mode. Shifter data is compared to SHIFTBUF
                                                     content on expiration of the Timer.                                       */
  FLEXIO_SHIFTCTL1_SMOD_101            = 5,     /*!< 101 : Match Continuous mode. Shifter data is continuously compared
                                                     to SHIFTBUF contents.                                                     */
} FLEXIO_SHIFTCTL1_SMOD_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCTL1 PINPOL [7..7]  ========================================= */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL1_PINPOL                                                   */
  FLEXIO_SHIFTCTL1_PINPOL_0            = 0,     /*!< 0 : Pin is active high                                                    */
  FLEXIO_SHIFTCTL1_PINPOL_1            = 1,     /*!< 1 : Pin is active low                                                     */
} FLEXIO_SHIFTCTL1_PINPOL_Enum;

/* ========================================  FLEXIO FLEXIO_SHIFTCTL1 PINCFG [16..17]  ======================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL1_PINCFG                                                   */
  FLEXIO_SHIFTCTL1_PINCFG_0            = 0,     /*!< 0 : Shifter pin output disabled                                           */
  FLEXIO_SHIFTCTL1_PINCFG_1            = 1,     /*!< 1 : Shifter pin open drain or bidirectional output enable                 */
  FLEXIO_SHIFTCTL1_PINCFG_10           = 2,     /*!< 10 : Shifter pin bidirectional output data                                */
  FLEXIO_SHIFTCTL1_PINCFG_11           = 3,     /*!< 11 : Shifter pin output                                                   */
} FLEXIO_SHIFTCTL1_PINCFG_Enum;

/* ========================================  FLEXIO FLEXIO_SHIFTCTL1 TIMPOL [23..23]  ======================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL1_TIMPOL                                                   */
  FLEXIO_SHIFTCTL1_TIMPOL_0            = 0,     /*!< 0 : Shift on posedge of Shift clock                                       */
  FLEXIO_SHIFTCTL1_TIMPOL_1            = 1,     /*!< 1 : Shift on negedge of Shift clock                                       */
} FLEXIO_SHIFTCTL1_TIMPOL_Enum;

/* ===================================================  FLEXIO_SHIFTCTL2  ==================================================== */
/* ==========================================  FLEXIO FLEXIO_SHIFTCTL2 SMOD [0..2]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL2_SMOD                                                     */
  FLEXIO_SHIFTCTL2_SMOD_0              = 0,     /*!< 0 : Disabled.                                                             */
  FLEXIO_SHIFTCTL2_SMOD_1              = 1,     /*!< 1 : Receive mode. Captures the current Shifter content into
                                                     the SHIFTBUF on expiration of the Timer.                                  */
  FLEXIO_SHIFTCTL2_SMOD_10             = 2,     /*!< 10 : Transmit mode. Load SHIFTBUF contents into the Shifter
                                                     on expiration of the Timer.                                               */
  FLEXIO_SHIFTCTL2_SMOD_100            = 4,     /*!< 100 : Match Store mode. Shifter data is compared to SHIFTBUF
                                                     content on expiration of the Timer.                                       */
  FLEXIO_SHIFTCTL2_SMOD_101            = 5,     /*!< 101 : Match Continuous mode. Shifter data is continuously compared
                                                     to SHIFTBUF contents.                                                     */
} FLEXIO_SHIFTCTL2_SMOD_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCTL2 PINPOL [7..7]  ========================================= */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL2_PINPOL                                                   */
  FLEXIO_SHIFTCTL2_PINPOL_0            = 0,     /*!< 0 : Pin is active high                                                    */
  FLEXIO_SHIFTCTL2_PINPOL_1            = 1,     /*!< 1 : Pin is active low                                                     */
} FLEXIO_SHIFTCTL2_PINPOL_Enum;

/* ========================================  FLEXIO FLEXIO_SHIFTCTL2 PINCFG [16..17]  ======================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL2_PINCFG                                                   */
  FLEXIO_SHIFTCTL2_PINCFG_0            = 0,     /*!< 0 : Shifter pin output disabled                                           */
  FLEXIO_SHIFTCTL2_PINCFG_1            = 1,     /*!< 1 : Shifter pin open drain or bidirectional output enable                 */
  FLEXIO_SHIFTCTL2_PINCFG_10           = 2,     /*!< 10 : Shifter pin bidirectional output data                                */
  FLEXIO_SHIFTCTL2_PINCFG_11           = 3,     /*!< 11 : Shifter pin output                                                   */
} FLEXIO_SHIFTCTL2_PINCFG_Enum;

