nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ========================================  FLEXIO FLEXIO_SHIFTCTL2 TIMPOL [23..23]  ======================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL2_TIMPOL                                                   */
  FLEXIO_SHIFTCTL2_TIMPOL_0            = 0,     /*!< 0 : Shift on posedge of Shift clock                                       */
  FLEXIO_SHIFTCTL2_TIMPOL_1            = 1,     /*!< 1 : Shift on negedge of Shift clock                                       */
} FLEXIO_SHIFTCTL2_TIMPOL_Enum;

/* ===================================================  FLEXIO_SHIFTCTL3  ==================================================== */
/* ==========================================  FLEXIO FLEXIO_SHIFTCTL3 SMOD [0..2]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL3_SMOD                                                     */
  FLEXIO_SHIFTCTL3_SMOD_0              = 0,     /*!< 0 : Disabled.                                                             */
  FLEXIO_SHIFTCTL3_SMOD_1              = 1,     /*!< 1 : Receive mode. Captures the current Shifter content into
                                                     the SHIFTBUF on expiration of the Timer.                                  */
  FLEXIO_SHIFTCTL3_SMOD_10             = 2,     /*!< 10 : Transmit mode. Load SHIFTBUF contents into the Shifter
                                                     on expiration of the Timer.                                               */
  FLEXIO_SHIFTCTL3_SMOD_100            = 4,     /*!< 100 : Match Store mode. Shifter data is compared to SHIFTBUF
                                                     content on expiration of the Timer.                                       */
  FLEXIO_SHIFTCTL3_SMOD_101            = 5,     /*!< 101 : Match Continuous mode. Shifter data is continuously compared
                                                     to SHIFTBUF contents.                                                     */
} FLEXIO_SHIFTCTL3_SMOD_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCTL3 PINPOL [7..7]  ========================================= */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL3_PINPOL                                                   */
  FLEXIO_SHIFTCTL3_PINPOL_0            = 0,     /*!< 0 : Pin is active high                                                    */
  FLEXIO_SHIFTCTL3_PINPOL_1            = 1,     /*!< 1 : Pin is active low                                                     */
} FLEXIO_SHIFTCTL3_PINPOL_Enum;

/* ========================================  FLEXIO FLEXIO_SHIFTCTL3 PINCFG [16..17]  ======================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL3_PINCFG                                                   */
  FLEXIO_SHIFTCTL3_PINCFG_0            = 0,     /*!< 0 : Shifter pin output disabled                                           */
  FLEXIO_SHIFTCTL3_PINCFG_1            = 1,     /*!< 1 : Shifter pin open drain or bidirectional output enable                 */
  FLEXIO_SHIFTCTL3_PINCFG_10           = 2,     /*!< 10 : Shifter pin bidirectional output data                                */
  FLEXIO_SHIFTCTL3_PINCFG_11           = 3,     /*!< 11 : Shifter pin output                                                   */
} FLEXIO_SHIFTCTL3_PINCFG_Enum;

/* ========================================  FLEXIO FLEXIO_SHIFTCTL3 TIMPOL [23..23]  ======================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCTL3_TIMPOL                                                   */
  FLEXIO_SHIFTCTL3_TIMPOL_0            = 0,     /*!< 0 : Shift on posedge of Shift clock                                       */
  FLEXIO_SHIFTCTL3_TIMPOL_1            = 1,     /*!< 1 : Shift on negedge of Shift clock                                       */
} FLEXIO_SHIFTCTL3_TIMPOL_Enum;

/* ===================================================  FLEXIO_SHIFTCFG0  ==================================================== */
/* =========================================  FLEXIO FLEXIO_SHIFTCFG0 SSTART [0..1]  ========================================= */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG0_SSTART                                                   */
  FLEXIO_SHIFTCFG0_SSTART_0            = 0,     /*!< 0 : Start bit disabled for transmitter/receiver/match store,
                                                     transmitter loads data on enable                                          */
  FLEXIO_SHIFTCFG0_SSTART_1            = 1,     /*!< 1 : Start bit disabled for transmitter/receiver/match store,
                                                     transmitter loads data on first shift                                     */
  FLEXIO_SHIFTCFG0_SSTART_10           = 2,     /*!< 10 : Transmitter outputs start bit value 0 before loading data
                                                     on first shift, receiver/match store sets error flag if
                                                     start bit is not 0                                                        */
  FLEXIO_SHIFTCFG0_SSTART_11           = 3,     /*!< 11 : Transmitter outputs start bit value 1 before loading data
                                                     on first shift, receiver/match store sets error flag if
                                                     start bit is not 1                                                        */
} FLEXIO_SHIFTCFG0_SSTART_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCFG0 SSTOP [4..5]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG0_SSTOP                                                    */
  FLEXIO_SHIFTCFG0_SSTOP_0             = 0,     /*!< 0 : Stop bit disabled for transmitter/receiver/match store                */
  FLEXIO_SHIFTCFG0_SSTOP_1             = 1,     /*!< 1 : Reserved for transmitter/receiver/match store                         */
  FLEXIO_SHIFTCFG0_SSTOP_10            = 2,     /*!< 10 : Transmitter outputs stop bit value 0 on store, receiver/match
                                                     store sets error flag if stop bit is not 0                                */
  FLEXIO_SHIFTCFG0_SSTOP_11            = 3,     /*!< 11 : Transmitter outputs stop bit value 1 on store, receiver/match
                                                     store sets error flag if stop bit is not 1                                */
} FLEXIO_SHIFTCFG0_SSTOP_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCFG0 INSRC [8..8]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG0_INSRC                                                    */
  FLEXIO_SHIFTCFG0_INSRC_0             = 0,     /*!< 0 : Pin                                                                   */
  FLEXIO_SHIFTCFG0_INSRC_1             = 1,     /*!< 1 : Shifter N+1 Output                                                    */
} FLEXIO_SHIFTCFG0_INSRC_Enum;

/* ===================================================  FLEXIO_SHIFTCFG1  ==================================================== */
/* =========================================  FLEXIO FLEXIO_SHIFTCFG1 SSTART [0..1]  ========================================= */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG1_SSTART                                                   */
  FLEXIO_SHIFTCFG1_SSTART_0            = 0,     /*!< 0 : Start bit disabled for transmitter/receiver/match store,
                                                     transmitter loads data on enable                                          */
  FLEXIO_SHIFTCFG1_SSTART_1            = 1,     /*!< 1 : Start bit disabled for transmitter/receiver/match store,
                                                     transmitter loads data on first shift                                     */
  FLEXIO_SHIFTCFG1_SSTART_10           = 2,     /*!< 10 : Transmitter outputs start bit value 0 before loading data
                                                     on first shift, receiver/match store sets error flag if
                                                     start bit is not 0                                                        */
  FLEXIO_SHIFTCFG1_SSTART_11           = 3,     /*!< 11 : Transmitter outputs start bit value 1 before loading data
                                                     on first shift, receiver/match store sets error flag if
                                                     start bit is not 1                                                        */
} FLEXIO_SHIFTCFG1_SSTART_Enum;

