nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =========================================  FLEXIO FLEXIO_SHIFTCFG1 SSTOP [4..5]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG1_SSTOP                                                    */
  FLEXIO_SHIFTCFG1_SSTOP_0             = 0,     /*!< 0 : Stop bit disabled for transmitter/receiver/match store                */
  FLEXIO_SHIFTCFG1_SSTOP_1             = 1,     /*!< 1 : Reserved for transmitter/receiver/match store                         */
  FLEXIO_SHIFTCFG1_SSTOP_10            = 2,     /*!< 10 : Transmitter outputs stop bit value 0 on store, receiver/match
                                                     store sets error flag if stop bit is not 0                                */
  FLEXIO_SHIFTCFG1_SSTOP_11            = 3,     /*!< 11 : Transmitter outputs stop bit value 1 on store, receiver/match
                                                     store sets error flag if stop bit is not 1                                */
} FLEXIO_SHIFTCFG1_SSTOP_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCFG1 INSRC [8..8]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG1_INSRC                                                    */
  FLEXIO_SHIFTCFG1_INSRC_0             = 0,     /*!< 0 : Pin                                                                   */
  FLEXIO_SHIFTCFG1_INSRC_1             = 1,     /*!< 1 : Shifter N+1 Output                                                    */
} FLEXIO_SHIFTCFG1_INSRC_Enum;

/* ===================================================  FLEXIO_SHIFTCFG2  ==================================================== */
/* =========================================  FLEXIO FLEXIO_SHIFTCFG2 SSTART [0..1]  ========================================= */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG2_SSTART                                                   */
  FLEXIO_SHIFTCFG2_SSTART_0            = 0,     /*!< 0 : Start bit disabled for transmitter/receiver/match store,
                                                     transmitter loads data on enable                                          */
  FLEXIO_SHIFTCFG2_SSTART_1            = 1,     /*!< 1 : Start bit disabled for transmitter/receiver/match store,
                                                     transmitter loads data on first shift                                     */
  FLEXIO_SHIFTCFG2_SSTART_10           = 2,     /*!< 10 : Transmitter outputs start bit value 0 before loading data
                                                     on first shift, receiver/match store sets error flag if
                                                     start bit is not 0                                                        */
  FLEXIO_SHIFTCFG2_SSTART_11           = 3,     /*!< 11 : Transmitter outputs start bit value 1 before loading data
                                                     on first shift, receiver/match store sets error flag if
                                                     start bit is not 1                                                        */
} FLEXIO_SHIFTCFG2_SSTART_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCFG2 SSTOP [4..5]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG2_SSTOP                                                    */
  FLEXIO_SHIFTCFG2_SSTOP_0             = 0,     /*!< 0 : Stop bit disabled for transmitter/receiver/match store                */
  FLEXIO_SHIFTCFG2_SSTOP_1             = 1,     /*!< 1 : Reserved for transmitter/receiver/match store                         */
  FLEXIO_SHIFTCFG2_SSTOP_10            = 2,     /*!< 10 : Transmitter outputs stop bit value 0 on store, receiver/match
                                                     store sets error flag if stop bit is not 0                                */
  FLEXIO_SHIFTCFG2_SSTOP_11            = 3,     /*!< 11 : Transmitter outputs stop bit value 1 on store, receiver/match
                                                     store sets error flag if stop bit is not 1                                */
} FLEXIO_SHIFTCFG2_SSTOP_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCFG2 INSRC [8..8]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG2_INSRC                                                    */
  FLEXIO_SHIFTCFG2_INSRC_0             = 0,     /*!< 0 : Pin                                                                   */
  FLEXIO_SHIFTCFG2_INSRC_1             = 1,     /*!< 1 : Shifter N+1 Output                                                    */
} FLEXIO_SHIFTCFG2_INSRC_Enum;

/* ===================================================  FLEXIO_SHIFTCFG3  ==================================================== */
/* =========================================  FLEXIO FLEXIO_SHIFTCFG3 SSTART [0..1]  ========================================= */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG3_SSTART                                                   */
  FLEXIO_SHIFTCFG3_SSTART_0            = 0,     /*!< 0 : Start bit disabled for transmitter/receiver/match store,
                                                     transmitter loads data on enable                                          */
  FLEXIO_SHIFTCFG3_SSTART_1            = 1,     /*!< 1 : Start bit disabled for transmitter/receiver/match store,
                                                     transmitter loads data on first shift                                     */
  FLEXIO_SHIFTCFG3_SSTART_10           = 2,     /*!< 10 : Transmitter outputs start bit value 0 before loading data
                                                     on first shift, receiver/match store sets error flag if
                                                     start bit is not 0                                                        */
  FLEXIO_SHIFTCFG3_SSTART_11           = 3,     /*!< 11 : Transmitter outputs start bit value 1 before loading data
                                                     on first shift, receiver/match store sets error flag if
                                                     start bit is not 1                                                        */
} FLEXIO_SHIFTCFG3_SSTART_Enum;

/* =========================================  FLEXIO FLEXIO_SHIFTCFG3 SSTOP [4..5]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG3_SSTOP                                                    */
  FLEXIO_SHIFTCFG3_SSTOP_0             = 0,     /*!< 0 : Stop bit disabled for transmitter/receiver/match store                */
  FLEXIO_SHIFTCFG3_SSTOP_1             = 1,     /*!< 1 : Reserved for transmitter/receiver/match store                         */
  FLEXIO_SHIFTCFG3_SSTOP_10            = 2,     /*!< 10 : Transmitter outputs stop bit value 0 on store, receiver/match
                                                     store sets error flag if stop bit is not 0                                */
  FLEXIO_SHIFTCFG3_SSTOP_11            = 3,     /*!< 11 : Transmitter outputs stop bit value 1 on store, receiver/match
                                                     store sets error flag if stop bit is not 1                                */
} FLEXIO_SHIFTCFG3_SSTOP_Enum;

