nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =========================================  FLEXIO FLEXIO_SHIFTCFG3 INSRC [8..8]  ========================================== */
typedef enum {                                  /*!< FLEXIO_SHIFTCFG3_INSRC                                                    */
  FLEXIO_SHIFTCFG3_INSRC_0             = 0,     /*!< 0 : Pin                                                                   */
  FLEXIO_SHIFTCFG3_INSRC_1             = 1,     /*!< 1 : Shifter N+1 Output                                                    */
} FLEXIO_SHIFTCFG3_INSRC_Enum;

/* ===================================================  FLEXIO_SHIFTBUF0  ==================================================== */
/* ===================================================  FLEXIO_SHIFTBUF1  ==================================================== */
/* ===================================================  FLEXIO_SHIFTBUF2  ==================================================== */
/* ===================================================  FLEXIO_SHIFTBUF3  ==================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBIS0  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBIS1  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBIS2  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBIS3  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBYS0  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBYS1  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBYS2  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBYS3  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBBS0  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBBS1  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBBS2  ================================================== */
/* ==================================================  FLEXIO_SHIFTBUFBBS3  ================================================== */
/* ====================================================  FLEXIO_TIMCTL0  ===================================================== */
/* ==========================================  FLEXIO FLEXIO_TIMCTL0 TIMOD [0..1]  =========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCTL0_TIMOD                                                      */
  FLEXIO_TIMCTL0_TIMOD_0               = 0,     /*!< 0 : Timer Disabled.                                                       */
  FLEXIO_TIMCTL0_TIMOD_1               = 1,     /*!< 1 : Dual 8-bit counters baud/bit mode.                                    */
  FLEXIO_TIMCTL0_TIMOD_10              = 2,     /*!< 10 : Dual 8-bit counters PWM mode.                                        */
  FLEXIO_TIMCTL0_TIMOD_11              = 3,     /*!< 11 : Single 16-bit counter mode.                                          */
} FLEXIO_TIMCTL0_TIMOD_Enum;

/* ==========================================  FLEXIO FLEXIO_TIMCTL0 PINPOL [7..7]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCTL0_PINPOL                                                     */
  FLEXIO_TIMCTL0_PINPOL_0              = 0,     /*!< 0 : Pin is active high                                                    */
  FLEXIO_TIMCTL0_PINPOL_1              = 1,     /*!< 1 : Pin is active low                                                     */
} FLEXIO_TIMCTL0_PINPOL_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL0 PINCFG [16..17]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL0_PINCFG                                                     */
  FLEXIO_TIMCTL0_PINCFG_0              = 0,     /*!< 0 : Timer pin output disabled                                             */
  FLEXIO_TIMCTL0_PINCFG_1              = 1,     /*!< 1 : Timer pin open drain or bidirectional output enable                   */
  FLEXIO_TIMCTL0_PINCFG_10             = 2,     /*!< 10 : Timer pin bidirectional output data                                  */
  FLEXIO_TIMCTL0_PINCFG_11             = 3,     /*!< 11 : Timer pin output                                                     */
} FLEXIO_TIMCTL0_PINCFG_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL0 TRGSRC [22..22]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL0_TRGSRC                                                     */
  FLEXIO_TIMCTL0_TRGSRC_0              = 0,     /*!< 0 : External trigger selected                                             */
  FLEXIO_TIMCTL0_TRGSRC_1              = 1,     /*!< 1 : Internal trigger selected                                             */
} FLEXIO_TIMCTL0_TRGSRC_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL0 TRGPOL [23..23]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL0_TRGPOL                                                     */
  FLEXIO_TIMCTL0_TRGPOL_0              = 0,     /*!< 0 : Trigger active high                                                   */
  FLEXIO_TIMCTL0_TRGPOL_1              = 1,     /*!< 1 : Trigger active low                                                    */
} FLEXIO_TIMCTL0_TRGPOL_Enum;

/* ====================================================  FLEXIO_TIMCTL1  ===================================================== */
/* ==========================================  FLEXIO FLEXIO_TIMCTL1 TIMOD [0..1]  =========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCTL1_TIMOD                                                      */
  FLEXIO_TIMCTL1_TIMOD_0               = 0,     /*!< 0 : Timer Disabled.                                                       */
  FLEXIO_TIMCTL1_TIMOD_1               = 1,     /*!< 1 : Dual 8-bit counters baud/bit mode.                                    */
  FLEXIO_TIMCTL1_TIMOD_10              = 2,     /*!< 10 : Dual 8-bit counters PWM mode.                                        */
  FLEXIO_TIMCTL1_TIMOD_11              = 3,     /*!< 11 : Single 16-bit counter mode.                                          */
} FLEXIO_TIMCTL1_TIMOD_Enum;

/* ==========================================  FLEXIO FLEXIO_TIMCTL1 PINPOL [7..7]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCTL1_PINPOL                                                     */
  FLEXIO_TIMCTL1_PINPOL_0              = 0,     /*!< 0 : Pin is active high                                                    */
  FLEXIO_TIMCTL1_PINPOL_1              = 1,     /*!< 1 : Pin is active low                                                     */
} FLEXIO_TIMCTL1_PINPOL_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL1 PINCFG [16..17]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL1_PINCFG                                                     */
  FLEXIO_TIMCTL1_PINCFG_0              = 0,     /*!< 0 : Timer pin output disabled                                             */
  FLEXIO_TIMCTL1_PINCFG_1              = 1,     /*!< 1 : Timer pin open drain or bidirectional output enable                   */
  FLEXIO_TIMCTL1_PINCFG_10             = 2,     /*!< 10 : Timer pin bidirectional output data                                  */
  FLEXIO_TIMCTL1_PINCFG_11             = 3,     /*!< 11 : Timer pin output                                                     */
} FLEXIO_TIMCTL1_PINCFG_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL1 TRGSRC [22..22]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL1_TRGSRC                                                     */
  FLEXIO_TIMCTL1_TRGSRC_0              = 0,     /*!< 0 : External trigger selected                                             */
  FLEXIO_TIMCTL1_TRGSRC_1              = 1,     /*!< 1 : Internal trigger selected                                             */
} FLEXIO_TIMCTL1_TRGSRC_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL1 TRGPOL [23..23]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL1_TRGPOL                                                     */
  FLEXIO_TIMCTL1_TRGPOL_0              = 0,     /*!< 0 : Trigger active high                                                   */
  FLEXIO_TIMCTL1_TRGPOL_1              = 1,     /*!< 1 : Trigger active low                                                    */
} FLEXIO_TIMCTL1_TRGPOL_Enum;

