nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ====================================================  FLEXIO_TIMCTL2  ===================================================== */
/* ==========================================  FLEXIO FLEXIO_TIMCTL2 TIMOD [0..1]  =========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCTL2_TIMOD                                                      */
  FLEXIO_TIMCTL2_TIMOD_0               = 0,     /*!< 0 : Timer Disabled.                                                       */
  FLEXIO_TIMCTL2_TIMOD_1               = 1,     /*!< 1 : Dual 8-bit counters baud/bit mode.                                    */
  FLEXIO_TIMCTL2_TIMOD_10              = 2,     /*!< 10 : Dual 8-bit counters PWM mode.                                        */
  FLEXIO_TIMCTL2_TIMOD_11              = 3,     /*!< 11 : Single 16-bit counter mode.                                          */
} FLEXIO_TIMCTL2_TIMOD_Enum;

/* ==========================================  FLEXIO FLEXIO_TIMCTL2 PINPOL [7..7]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCTL2_PINPOL                                                     */
  FLEXIO_TIMCTL2_PINPOL_0              = 0,     /*!< 0 : Pin is active high                                                    */
  FLEXIO_TIMCTL2_PINPOL_1              = 1,     /*!< 1 : Pin is active low                                                     */
} FLEXIO_TIMCTL2_PINPOL_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL2 PINCFG [16..17]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL2_PINCFG                                                     */
  FLEXIO_TIMCTL2_PINCFG_0              = 0,     /*!< 0 : Timer pin output disabled                                             */
  FLEXIO_TIMCTL2_PINCFG_1              = 1,     /*!< 1 : Timer pin open drain or bidirectional output enable                   */
  FLEXIO_TIMCTL2_PINCFG_10             = 2,     /*!< 10 : Timer pin bidirectional output data                                  */
  FLEXIO_TIMCTL2_PINCFG_11             = 3,     /*!< 11 : Timer pin output                                                     */
} FLEXIO_TIMCTL2_PINCFG_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL2 TRGSRC [22..22]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL2_TRGSRC                                                     */
  FLEXIO_TIMCTL2_TRGSRC_0              = 0,     /*!< 0 : External trigger selected                                             */
  FLEXIO_TIMCTL2_TRGSRC_1              = 1,     /*!< 1 : Internal trigger selected                                             */
} FLEXIO_TIMCTL2_TRGSRC_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL2 TRGPOL [23..23]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL2_TRGPOL                                                     */
  FLEXIO_TIMCTL2_TRGPOL_0              = 0,     /*!< 0 : Trigger active high                                                   */
  FLEXIO_TIMCTL2_TRGPOL_1              = 1,     /*!< 1 : Trigger active low                                                    */
} FLEXIO_TIMCTL2_TRGPOL_Enum;

/* ====================================================  FLEXIO_TIMCTL3  ===================================================== */
/* ==========================================  FLEXIO FLEXIO_TIMCTL3 TIMOD [0..1]  =========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCTL3_TIMOD                                                      */
  FLEXIO_TIMCTL3_TIMOD_0               = 0,     /*!< 0 : Timer Disabled.                                                       */
  FLEXIO_TIMCTL3_TIMOD_1               = 1,     /*!< 1 : Dual 8-bit counters baud/bit mode.                                    */
  FLEXIO_TIMCTL3_TIMOD_10              = 2,     /*!< 10 : Dual 8-bit counters PWM mode.                                        */
  FLEXIO_TIMCTL3_TIMOD_11              = 3,     /*!< 11 : Single 16-bit counter mode.                                          */
} FLEXIO_TIMCTL3_TIMOD_Enum;

/* ==========================================  FLEXIO FLEXIO_TIMCTL3 PINPOL [7..7]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCTL3_PINPOL                                                     */
  FLEXIO_TIMCTL3_PINPOL_0              = 0,     /*!< 0 : Pin is active high                                                    */
  FLEXIO_TIMCTL3_PINPOL_1              = 1,     /*!< 1 : Pin is active low                                                     */
} FLEXIO_TIMCTL3_PINPOL_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL3 PINCFG [16..17]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL3_PINCFG                                                     */
  FLEXIO_TIMCTL3_PINCFG_0              = 0,     /*!< 0 : Timer pin output disabled                                             */
  FLEXIO_TIMCTL3_PINCFG_1              = 1,     /*!< 1 : Timer pin open drain or bidirectional output enable                   */
  FLEXIO_TIMCTL3_PINCFG_10             = 2,     /*!< 10 : Timer pin bidirectional output data                                  */
  FLEXIO_TIMCTL3_PINCFG_11             = 3,     /*!< 11 : Timer pin output                                                     */
} FLEXIO_TIMCTL3_PINCFG_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL3 TRGSRC [22..22]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL3_TRGSRC                                                     */
  FLEXIO_TIMCTL3_TRGSRC_0              = 0,     /*!< 0 : External trigger selected                                             */
  FLEXIO_TIMCTL3_TRGSRC_1              = 1,     /*!< 1 : Internal trigger selected                                             */
} FLEXIO_TIMCTL3_TRGSRC_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCTL3 TRGPOL [23..23]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCTL3_TRGPOL                                                     */
  FLEXIO_TIMCTL3_TRGPOL_0              = 0,     /*!< 0 : Trigger active high                                                   */
  FLEXIO_TIMCTL3_TRGPOL_1              = 1,     /*!< 1 : Trigger active low                                                    */
} FLEXIO_TIMCTL3_TRGPOL_Enum;

/* ====================================================  FLEXIO_TIMCFG0  ===================================================== */
/* ==========================================  FLEXIO FLEXIO_TIMCFG0 TSTART [1..1]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCFG0_TSTART                                                     */
  FLEXIO_TIMCFG0_TSTART_0              = 0,     /*!< 0 : Start bit disabled                                                    */
  FLEXIO_TIMCFG0_TSTART_1              = 1,     /*!< 1 : Start bit enabled                                                     */
} FLEXIO_TIMCFG0_TSTART_Enum;

