nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ====================================================  FLEXIO_TIMCFG1  ===================================================== */
/* ==========================================  FLEXIO FLEXIO_TIMCFG1 TSTART [1..1]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCFG1_TSTART                                                     */
  FLEXIO_TIMCFG1_TSTART_0              = 0,     /*!< 0 : Start bit disabled                                                    */
  FLEXIO_TIMCFG1_TSTART_1              = 1,     /*!< 1 : Start bit enabled                                                     */
} FLEXIO_TIMCFG1_TSTART_Enum;

/* ==========================================  FLEXIO FLEXIO_TIMCFG1 TSTOP [4..5]  =========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCFG1_TSTOP                                                      */
  FLEXIO_TIMCFG1_TSTOP_0               = 0,     /*!< 0 : Stop bit disabled                                                     */
  FLEXIO_TIMCFG1_TSTOP_1               = 1,     /*!< 1 : Stop bit is enabled on timer compare                                  */
  FLEXIO_TIMCFG1_TSTOP_10              = 2,     /*!< 10 : Stop bit is enabled on timer disable                                 */
  FLEXIO_TIMCFG1_TSTOP_11              = 3,     /*!< 11 : Stop bit is enabled on timer compare and timer disable               */
} FLEXIO_TIMCFG1_TSTOP_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG1 TIMENA [8..10]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCFG1_TIMENA                                                     */
  FLEXIO_TIMCFG1_TIMENA_0              = 0,     /*!< 0 : Timer always enabled                                                  */
  FLEXIO_TIMCFG1_TIMENA_1              = 1,     /*!< 1 : Timer enabled on Timer N-1 enable                                     */
  FLEXIO_TIMCFG1_TIMENA_10             = 2,     /*!< 10 : Timer enabled on Trigger high                                        */
  FLEXIO_TIMCFG1_TIMENA_11             = 3,     /*!< 11 : Timer enabled on Trigger high and Pin high                           */
  FLEXIO_TIMCFG1_TIMENA_100            = 4,     /*!< 100 : Timer enabled on Pin rising edge                                    */
  FLEXIO_TIMCFG1_TIMENA_101            = 5,     /*!< 101 : Timer enabled on Pin rising edge and Trigger high                   */
  FLEXIO_TIMCFG1_TIMENA_110            = 6,     /*!< 110 : Timer enabled on Trigger rising edge                                */
  FLEXIO_TIMCFG1_TIMENA_111            = 7,     /*!< 111 : Timer enabled on Trigger rising or falling edge                     */
} FLEXIO_TIMCFG1_TIMENA_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG1 TIMDIS [12..14]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCFG1_TIMDIS                                                     */
  FLEXIO_TIMCFG1_TIMDIS_0              = 0,     /*!< 0 : Timer never disabled                                                  */
  FLEXIO_TIMCFG1_TIMDIS_1              = 1,     /*!< 1 : Timer disabled on Timer N-1 disable                                   */
  FLEXIO_TIMCFG1_TIMDIS_10             = 2,     /*!< 10 : Timer disabled on Timer compare                                      */
  FLEXIO_TIMCFG1_TIMDIS_11             = 3,     /*!< 11 : Timer disabled on Timer compare and Trigger Low                      */
  FLEXIO_TIMCFG1_TIMDIS_100            = 4,     /*!< 100 : Timer disabled on Pin rising or falling edge                        */
  FLEXIO_TIMCFG1_TIMDIS_101            = 5,     /*!< 101 : Timer disabled on Pin rising or falling edge provided
                                                     Trigger is high                                                           */
  FLEXIO_TIMCFG1_TIMDIS_110            = 6,     /*!< 110 : Timer disabled on Trigger falling edge                              */
} FLEXIO_TIMCFG1_TIMDIS_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG1 TIMRST [16..18]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCFG1_TIMRST                                                     */
  FLEXIO_TIMCFG1_TIMRST_0              = 0,     /*!< 0 : Timer never reset                                                     */
  FLEXIO_TIMCFG1_TIMRST_10             = 2,     /*!< 10 : Timer reset on Timer Pin equal to Timer Output                       */
  FLEXIO_TIMCFG1_TIMRST_11             = 3,     /*!< 11 : Timer reset on Timer Trigger equal to Timer Output                   */
  FLEXIO_TIMCFG1_TIMRST_100            = 4,     /*!< 100 : Timer reset on Timer Pin rising edge                                */
  FLEXIO_TIMCFG1_TIMRST_110            = 6,     /*!< 110 : Timer reset on Trigger rising edge                                  */
  FLEXIO_TIMCFG1_TIMRST_111            = 7,     /*!< 111 : Timer reset on Trigger rising or falling edge                       */
} FLEXIO_TIMCFG1_TIMRST_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG1 TIMDEC [20..21]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCFG1_TIMDEC                                                     */
  FLEXIO_TIMCFG1_TIMDEC_0              = 0,     /*!< 0 : Decrement counter on FlexIO clock, Shift clock equals Timer
                                                     output.                                                                   */
  FLEXIO_TIMCFG1_TIMDEC_1              = 1,     /*!< 1 : Decrement counter on Trigger input (both edges), Shift clock
                                                     equals Timer output.                                                      */
  FLEXIO_TIMCFG1_TIMDEC_10             = 2,     /*!< 10 : Decrement counter on Pin input (both edges), Shift clock
                                                     equals Pin input.                                                         */
  FLEXIO_TIMCFG1_TIMDEC_11             = 3,     /*!< 11 : Decrement counter on Trigger input (both edges), Shift
                                                     clock equals Trigger input.                                               */
} FLEXIO_TIMCFG1_TIMDEC_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG1 TIMOUT [24..25]  ========================================= */
typedef enum {                                  /*!< FLEXIO_TIMCFG1_TIMOUT                                                     */
  FLEXIO_TIMCFG1_TIMOUT_0              = 0,     /*!< 0 : Timer output is logic one when enabled and is not affected
                                                     by timer reset                                                            */
  FLEXIO_TIMCFG1_TIMOUT_1              = 1,     /*!< 1 : Timer output is logic zero when enabled and is not affected
                                                     by timer reset                                                            */
  FLEXIO_TIMCFG1_TIMOUT_10             = 2,     /*!< 10 : Timer output is logic one when enabled and on timer reset            */
  FLEXIO_TIMCFG1_TIMOUT_11             = 3,     /*!< 11 : Timer output is logic zero when enabled and on timer reset           */
} FLEXIO_TIMCFG1_TIMOUT_Enum;

/* ====================================================  FLEXIO_TIMCFG2  ===================================================== */
/* ==========================================  FLEXIO FLEXIO_TIMCFG2 TSTART [1..1]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCFG2_TSTART                                                     */
  FLEXIO_TIMCFG2_TSTART_0              = 0,     /*!< 0 : Start bit disabled                                                    */
  FLEXIO_TIMCFG2_TSTART_1              = 1,     /*!< 1 : Start bit enabled                                                     */
} FLEXIO_TIMCFG2_TSTART_Enum;

/* ==========================================  FLEXIO FLEXIO_TIMCFG2 TSTOP [4..5]  =========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCFG2_TSTOP                                                      */
  FLEXIO_TIMCFG2_TSTOP_0               = 0,     /*!< 0 : Stop bit disabled                                                     */
  FLEXIO_TIMCFG2_TSTOP_1               = 1,     /*!< 1 : Stop bit is enabled on timer compare                                  */
  FLEXIO_TIMCFG2_TSTOP_10              = 2,     /*!< 10 : Stop bit is enabled on timer disable                                 */
  FLEXIO_TIMCFG2_TSTOP_11              = 3,     /*!< 11 : Stop bit is enabled on timer compare and timer disable               */
} FLEXIO_TIMCFG2_TSTOP_Enum;

/* =========================================  FLEXIO FLEXIO_TIMCFG2 TIMENA [8..10]  ========================================== */
typedef enum {                                  /*!< FLEXIO_TIMCFG2_TIMENA                                                     */
  FLEXIO_TIMCFG2_TIMENA_0              = 0,     /*!< 0 : Timer always enabled                                                  */
  FLEXIO_TIMCFG2_TIMENA_1              = 1,     /*!< 1 : Timer enabled on Timer N-1 enable                                     */
  FLEXIO_TIMCFG2_TIMENA_10             = 2,     /*!< 10 : Timer enabled on Trigger high                                        */
  FLEXIO_TIMCFG2_TIMENA_11             = 3,     /*!< 11 : Timer enabled on Trigger high and Pin high                           */
  FLEXIO_TIMCFG2_TIMENA_100            = 4,     /*!< 100 : Timer enabled on Pin rising edge                                    */
  FLEXIO_TIMCFG2_TIMENA_101            = 5,     /*!< 101 : Timer enabled on Pin rising edge and Trigger high                   */
  FLEXIO_TIMCFG2_TIMENA_110            = 6,     /*!< 110 : Timer enabled on Trigger rising edge                                */
  FLEXIO_TIMCFG2_TIMENA_111            = 7,     /*!< 111 : Timer enabled on Trigger rising or falling edge                     */
} FLEXIO_TIMCFG2_TIMENA_Enum;

