nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ====================================================  TRGMUX_EXTOUT0  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_EXTOUT0 LK [31..31]  =========================================== */
typedef enum {                                  /*!< TRGMUX_TRGMUX_EXTOUT0_LK                                                  */
  TRGMUX_TRGMUX_EXTOUT0_LK_0           = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_EXTOUT0_LK_1           = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_EXTOUT0_LK_Enum;

/* ====================================================  TRGMUX_EXTOUT1  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_EXTOUT1 LK [31..31]  =========================================== */
typedef enum {                                  /*!< TRGMUX_TRGMUX_EXTOUT1_LK                                                  */
  TRGMUX_TRGMUX_EXTOUT1_LK_0           = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_EXTOUT1_LK_1           = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_EXTOUT1_LK_Enum;

/* ======================================================  TRGMUX_ADC0  ====================================================== */
/* ============================================  TRGMUX TRGMUX_ADC0 LK [31..31]  ============================================= */
typedef enum {                                  /*!< TRGMUX_TRGMUX_ADC0_LK                                                     */
  TRGMUX_TRGMUX_ADC0_LK_0              = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_ADC0_LK_1              = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_ADC0_LK_Enum;

/* ======================================================  TRGMUX_CMP0  ====================================================== */
/* ============================================  TRGMUX TRGMUX_CMP0 LK [31..31]  ============================================= */
typedef enum {                                  /*!< TRGMUX_TRGMUX_CMP0_LK                                                     */
  TRGMUX_TRGMUX_CMP0_LK_0              = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_CMP0_LK_1              = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_CMP0_LK_Enum;

/* ======================================================  TRGMUX_FTM0  ====================================================== */
/* ============================================  TRGMUX TRGMUX_FTM0 LK [31..31]  ============================================= */
typedef enum {                                  /*!< TRGMUX_TRGMUX_FTM0_LK                                                     */
  TRGMUX_TRGMUX_FTM0_LK_0              = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_FTM0_LK_1              = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_FTM0_LK_Enum;

/* ======================================================  TRGMUX_FTM1  ====================================================== */
/* ============================================  TRGMUX TRGMUX_FTM1 LK [31..31]  ============================================= */
typedef enum {                                  /*!< TRGMUX_TRGMUX_FTM1_LK                                                     */
  TRGMUX_TRGMUX_FTM1_LK_0              = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_FTM1_LK_1              = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_FTM1_LK_Enum;

/* ======================================================  TRGMUX_PDB0  ====================================================== */
/* ============================================  TRGMUX TRGMUX_PDB0 LK [31..31]  ============================================= */
typedef enum {                                  /*!< TRGMUX_TRGMUX_PDB0_LK                                                     */
  TRGMUX_TRGMUX_PDB0_LK_0              = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_PDB0_LK_1              = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_PDB0_LK_Enum;

/* =====================================================  TRGMUX_FLEXIO  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_FLEXIO LK [31..31]  ============================================ */
typedef enum {                                  /*!< TRGMUX_TRGMUX_FLEXIO_LK                                                   */
  TRGMUX_TRGMUX_FLEXIO_LK_0            = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_FLEXIO_LK_1            = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_FLEXIO_LK_Enum;

/* =====================================================  TRGMUX_LPIT0  ====================================================== */
/* ============================================  TRGMUX TRGMUX_LPIT0 LK [31..31]  ============================================ */
typedef enum {                                  /*!< TRGMUX_TRGMUX_LPIT0_LK                                                    */
  TRGMUX_TRGMUX_LPIT0_LK_0             = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_LPIT0_LK_1             = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_LPIT0_LK_Enum;

/* ====================================================  TRGMUX_LPUART0  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_LPUART0 LK [31..31]  =========================================== */
typedef enum {                                  /*!< TRGMUX_TRGMUX_LPUART0_LK                                                  */
  TRGMUX_TRGMUX_LPUART0_LK_0           = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_LPUART0_LK_1           = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_LPUART0_LK_Enum;

/* ====================================================  TRGMUX_LPUART1  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_LPUART1 LK [31..31]  =========================================== */
typedef enum {                                  /*!< TRGMUX_TRGMUX_LPUART1_LK                                                  */
  TRGMUX_TRGMUX_LPUART1_LK_0           = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_LPUART1_LK_1           = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_LPUART1_LK_Enum;

/* =====================================================  TRGMUX_LPI2C0  ===================================================== */
/* ===========================================  TRGMUX TRGMUX_LPI2C0 LK [31..31]  ============================================ */
typedef enum {                                  /*!< TRGMUX_TRGMUX_LPI2C0_LK                                                   */
  TRGMUX_TRGMUX_LPI2C0_LK_0            = 0,     /*!< 0 : Register can be written.                                              */
  TRGMUX_TRGMUX_LPI2C0_LK_1            = 1,     /*!< 1 : Register cannot be written until the next system Reset.               */
} TRGMUX_TRGMUX_LPI2C0_LK_Enum;

