nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  SCG_SOSCCSR  ====================================================== */
/* =============================================  SCG SCG_SOSCCSR SOSCEN [0..0]  ============================================= */
typedef enum {                                  /*!< SCG_SOSCCSR_SOSCEN                                                        */
  SCG_SOSCCSR_SOSCEN_0                 = 0,     /*!< 0 : System OSC is disabled                                                */
  SCG_SOSCCSR_SOSCEN_1                 = 1,     /*!< 1 : System OSC is enabled                                                 */
} SCG_SOSCCSR_SOSCEN_Enum;

/* ============================================  SCG SCG_SOSCCSR SOSCCM [16..16]  ============================================ */
typedef enum {                                  /*!< SCG_SOSCCSR_SOSCCM                                                        */
  SCG_SOSCCSR_SOSCCM_0                 = 0,     /*!< 0 : System OSC Clock Monitor is disabled                                  */
  SCG_SOSCCSR_SOSCCM_1                 = 1,     /*!< 1 : System OSC Clock Monitor is enabled                                   */
} SCG_SOSCCSR_SOSCCM_Enum;

/* ===========================================  SCG SCG_SOSCCSR SOSCCMRE [17..17]  =========================================== */
typedef enum {                                  /*!< SCG_SOSCCSR_SOSCCMRE                                                      */
  SCG_SOSCCSR_SOSCCMRE_0               = 0,     /*!< 0 : Clock Monitor generates interrupt when error detected                 */
  SCG_SOSCCSR_SOSCCMRE_1               = 1,     /*!< 1 : Clock Monitor generates reset when error detected                     */
} SCG_SOSCCSR_SOSCCMRE_Enum;

/* ==============================================  SCG SCG_SOSCCSR LK [23..23]  ============================================== */
typedef enum {                                  /*!< SCG_SOSCCSR_LK                                                            */
  SCG_SOSCCSR_LK_0                     = 0,     /*!< 0 : This Control Status Register can be written.                          */
  SCG_SOSCCSR_LK_1                     = 1,     /*!< 1 : This Control Status Register cannot be written.                       */
} SCG_SOSCCSR_LK_Enum;

/* ===========================================  SCG SCG_SOSCCSR SOSCVLD [24..24]  ============================================ */
typedef enum {                                  /*!< SCG_SOSCCSR_SOSCVLD                                                       */
  SCG_SOSCCSR_SOSCVLD_0                = 0,     /*!< 0 : System OSC is not enabled or clock is not valid                       */
  SCG_SOSCCSR_SOSCVLD_1                = 1,     /*!< 1 : System OSC is enabled and output clock is valid                       */
} SCG_SOSCCSR_SOSCVLD_Enum;

/* ===========================================  SCG SCG_SOSCCSR SOSCSEL [25..25]  ============================================ */
typedef enum {                                  /*!< SCG_SOSCCSR_SOSCSEL                                                       */
  SCG_SOSCCSR_SOSCSEL_0                = 0,     /*!< 0 : System OSC is not the system clock source                             */
  SCG_SOSCCSR_SOSCSEL_1                = 1,     /*!< 1 : System OSC is the system clock source                                 */
} SCG_SOSCCSR_SOSCSEL_Enum;

/* ===========================================  SCG SCG_SOSCCSR SOSCERR [26..26]  ============================================ */
typedef enum {                                  /*!< SCG_SOSCCSR_SOSCERR                                                       */
  SCG_SOSCCSR_SOSCERR_0                = 0,     /*!< 0 : System OSC Clock Monitor is disabled or has not detected
                                                     an error                                                                  */
  SCG_SOSCCSR_SOSCERR_1                = 1,     /*!< 1 : System OSC Clock Monitor is enabled and detected an error             */
} SCG_SOSCCSR_SOSCERR_Enum;

/* ======================================================  SCG_SOSCDIV  ====================================================== */
/* ============================================  SCG SCG_SOSCDIV SOSCDIV1 [0..2]  ============================================ */
typedef enum {                                  /*!< SCG_SOSCDIV_SOSCDIV1                                                      */
  SCG_SOSCDIV_SOSCDIV1_000             = 0,     /*!< 000 : Output disabled                                                     */
  SCG_SOSCDIV_SOSCDIV1_001             = 1,     /*!< 001 : Divide by 1                                                         */
  SCG_SOSCDIV_SOSCDIV1_010             = 2,     /*!< 010 : Divide by 2                                                         */
  SCG_SOSCDIV_SOSCDIV1_011             = 3,     /*!< 011 : Divide by 4                                                         */
  SCG_SOSCDIV_SOSCDIV1_100             = 4,     /*!< 100 : Divide by 8                                                         */
  SCG_SOSCDIV_SOSCDIV1_101             = 5,     /*!< 101 : Divide by 16                                                        */
  SCG_SOSCDIV_SOSCDIV1_110             = 6,     /*!< 110 : Divide by 32                                                        */
  SCG_SOSCDIV_SOSCDIV1_111             = 7,     /*!< 111 : Divide by 64                                                        */
} SCG_SOSCDIV_SOSCDIV1_Enum;

/* ===========================================  SCG SCG_SOSCDIV SOSCDIV2 [8..10]  ============================================ */
typedef enum {                                  /*!< SCG_SOSCDIV_SOSCDIV2                                                      */
  SCG_SOSCDIV_SOSCDIV2_000             = 0,     /*!< 000 : Output disabled                                                     */
  SCG_SOSCDIV_SOSCDIV2_001             = 1,     /*!< 001 : Divide by 1                                                         */
  SCG_SOSCDIV_SOSCDIV2_010             = 2,     /*!< 010 : Divide by 2                                                         */
  SCG_SOSCDIV_SOSCDIV2_011             = 3,     /*!< 011 : Divide by 4                                                         */
  SCG_SOSCDIV_SOSCDIV2_100             = 4,     /*!< 100 : Divide by 8                                                         */
  SCG_SOSCDIV_SOSCDIV2_101             = 5,     /*!< 101 : Divide by 16                                                        */
  SCG_SOSCDIV_SOSCDIV2_110             = 6,     /*!< 110 : Divide by 32                                                        */
  SCG_SOSCDIV_SOSCDIV2_111             = 7,     /*!< 111 : Divide by 64                                                        */
} SCG_SOSCDIV_SOSCDIV2_Enum;

