nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  SCG_SOSCCFG  ====================================================== */
/* =============================================  SCG SCG_SOSCCFG EREFS [2..2]  ============================================== */
typedef enum {                                  /*!< SCG_SOSCCFG_EREFS                                                         */
  SCG_SOSCCFG_EREFS_0                  = 0,     /*!< 0 : External reference clock selected                                     */
  SCG_SOSCCFG_EREFS_1                  = 1,     /*!< 1 : Internal crystal oscillator of OSC selected.                          */
} SCG_SOSCCFG_EREFS_Enum;

/* ==============================================  SCG SCG_SOSCCFG HGO [3..3]  =============================================== */
typedef enum {                                  /*!< SCG_SOSCCFG_HGO                                                           */
  SCG_SOSCCFG_HGO_0                    = 0,     /*!< 0 : Configure crystal oscillator for low-gain operation                   */
  SCG_SOSCCFG_HGO_1                    = 1,     /*!< 1 : Configure crystal oscillator for high-gain operation                  */
} SCG_SOSCCFG_HGO_Enum;

/* =============================================  SCG SCG_SOSCCFG RANGE [4..5]  ============================================== */
typedef enum {                                  /*!< SCG_SOSCCFG_RANGE                                                         */
  SCG_SOSCCFG_RANGE_01                 = 1,     /*!< 01 : Low frequency range selected for the crystal oscillator              */
  SCG_SOSCCFG_RANGE_10                 = 2,     /*!< 10 : Medium frequency range selected for the crytstal oscillator          */
  SCG_SOSCCFG_RANGE_11                 = 3,     /*!< 11 : High frequency range selected for the crystal oscillator             */
} SCG_SOSCCFG_RANGE_Enum;

/* ======================================================  SCG_SIRCCSR  ====================================================== */
/* =============================================  SCG SCG_SIRCCSR SIRCEN [0..0]  ============================================= */
typedef enum {                                  /*!< SCG_SIRCCSR_SIRCEN                                                        */
  SCG_SIRCCSR_SIRCEN_0                 = 0,     /*!< 0 : Slow IRC is disabled                                                  */
  SCG_SIRCCSR_SIRCEN_1                 = 1,     /*!< 1 : Slow IRC is enabled                                                   */
} SCG_SIRCCSR_SIRCEN_Enum;

/* ============================================  SCG SCG_SIRCCSR SIRCSTEN [1..1]  ============================================ */
typedef enum {                                  /*!< SCG_SIRCCSR_SIRCSTEN                                                      */
  SCG_SIRCCSR_SIRCSTEN_0               = 0,     /*!< 0 : Slow IRC is disabled in supported Stop modes                          */
  SCG_SIRCCSR_SIRCSTEN_1               = 1,     /*!< 1 : Slow IRC is enabled in supported Stop modes                           */
} SCG_SIRCCSR_SIRCSTEN_Enum;

/* ============================================  SCG SCG_SIRCCSR SIRCLPEN [2..2]  ============================================ */
typedef enum {                                  /*!< SCG_SIRCCSR_SIRCLPEN                                                      */
  SCG_SIRCCSR_SIRCLPEN_0               = 0,     /*!< 0 : Slow IRC is disabled in VLP modes                                     */
  SCG_SIRCCSR_SIRCLPEN_1               = 1,     /*!< 1 : Slow IRC is enabled in VLP modes                                      */
} SCG_SIRCCSR_SIRCLPEN_Enum;

/* ==============================================  SCG SCG_SIRCCSR LK [23..23]  ============================================== */
typedef enum {                                  /*!< SCG_SIRCCSR_LK                                                            */
  SCG_SIRCCSR_LK_0                     = 0,     /*!< 0 : Control Status Register can be written.                               */
  SCG_SIRCCSR_LK_1                     = 1,     /*!< 1 : Control Status Register cannot be written.                            */
} SCG_SIRCCSR_LK_Enum;

/* ===========================================  SCG SCG_SIRCCSR SIRCVLD [24..24]  ============================================ */
typedef enum {                                  /*!< SCG_SIRCCSR_SIRCVLD                                                       */
  SCG_SIRCCSR_SIRCVLD_0                = 0,     /*!< 0 : Slow IRC is not enabled or clock is not valid                         */
  SCG_SIRCCSR_SIRCVLD_1                = 1,     /*!< 1 : Slow IRC is enabled and output clock is valid                         */
} SCG_SIRCCSR_SIRCVLD_Enum;

/* ===========================================  SCG SCG_SIRCCSR SIRCSEL [25..25]  ============================================ */
typedef enum {                                  /*!< SCG_SIRCCSR_SIRCSEL                                                       */
  SCG_SIRCCSR_SIRCSEL_0                = 0,     /*!< 0 : Slow IRC is not the system clock source                               */
  SCG_SIRCCSR_SIRCSEL_1                = 1,     /*!< 1 : Slow IRC is the system clock source                                   */
} SCG_SIRCCSR_SIRCSEL_Enum;

/* ======================================================  SCG_SIRCDIV  ====================================================== */
/* ============================================  SCG SCG_SIRCDIV SIRCDIV1 [0..2]  ============================================ */
typedef enum {                                  /*!< SCG_SIRCDIV_SIRCDIV1                                                      */
  SCG_SIRCDIV_SIRCDIV1_000             = 0,     /*!< 000 : Output disabled                                                     */
  SCG_SIRCDIV_SIRCDIV1_001             = 1,     /*!< 001 : Divide by 1                                                         */
  SCG_SIRCDIV_SIRCDIV1_010             = 2,     /*!< 010 : Divide by 2                                                         */
  SCG_SIRCDIV_SIRCDIV1_011             = 3,     /*!< 011 : Divide by 4                                                         */
  SCG_SIRCDIV_SIRCDIV1_100             = 4,     /*!< 100 : Divide by 8                                                         */
  SCG_SIRCDIV_SIRCDIV1_101             = 5,     /*!< 101 : Divide by 16                                                        */
  SCG_SIRCDIV_SIRCDIV1_110             = 6,     /*!< 110 : Divide by 32                                                        */
  SCG_SIRCDIV_SIRCDIV1_111             = 7,     /*!< 111 : Divide by 64                                                        */
} SCG_SIRCDIV_SIRCDIV1_Enum;

/* ===========================================  SCG SCG_SIRCDIV SIRCDIV2 [8..10]  ============================================ */
typedef enum {                                  /*!< SCG_SIRCDIV_SIRCDIV2                                                      */
  SCG_SIRCDIV_SIRCDIV2_000             = 0,     /*!< 000 : Output disabled                                                     */
  SCG_SIRCDIV_SIRCDIV2_001             = 1,     /*!< 001 : Divide by 1                                                         */
  SCG_SIRCDIV_SIRCDIV2_010             = 2,     /*!< 010 : Divide by 2                                                         */
  SCG_SIRCDIV_SIRCDIV2_011             = 3,     /*!< 011 : Divide by 4                                                         */
  SCG_SIRCDIV_SIRCDIV2_100             = 4,     /*!< 100 : Divide by 8                                                         */
  SCG_SIRCDIV_SIRCDIV2_101             = 5,     /*!< 101 : Divide by 16                                                        */
  SCG_SIRCDIV_SIRCDIV2_110             = 6,     /*!< 110 : Divide by 32                                                        */
  SCG_SIRCDIV_SIRCDIV2_111             = 7,     /*!< 111 : Divide by 64                                                        */
} SCG_SIRCDIV_SIRCDIV2_Enum;

/* ======================================================  SCG_SIRCCFG  ====================================================== */
/* =============================================  SCG SCG_SIRCCFG RANGE [0..0]  ============================================== */
typedef enum {                                  /*!< SCG_SIRCCFG_RANGE                                                         */
  SCG_SIRCCFG_RANGE_0                  = 0,     /*!< 0 : Slow IRC low range clock (2 MHz)                                      */
  SCG_SIRCCFG_RANGE_1                  = 1,     /*!< 1 : Slow IRC high range clock (8 MHz )                                    */
} SCG_SIRCCFG_RANGE_Enum;

/* ======================================================  SCG_FIRCCSR  ====================================================== */
/* =============================================  SCG SCG_FIRCCSR FIRCEN [0..0]  ============================================= */
typedef enum {                                  /*!< SCG_FIRCCSR_FIRCEN                                                        */
  SCG_FIRCCSR_FIRCEN_0                 = 0,     /*!< 0 : Fast IRC is disabled                                                  */
  SCG_FIRCCSR_FIRCEN_1                 = 1,     /*!< 1 : Fast IRC is enabled                                                   */
} SCG_FIRCCSR_FIRCEN_Enum;

/* ===========================================  SCG SCG_FIRCCSR FIRCREGOFF [3..3]  =========================================== */
typedef enum {                                  /*!< SCG_FIRCCSR_FIRCREGOFF                                                    */
  SCG_FIRCCSR_FIRCREGOFF_0             = 0,     /*!< 0 : Fast IRC Regulator is enabled.                                        */
  SCG_FIRCCSR_FIRCREGOFF_1             = 1,     /*!< 1 : Fast IRC Regulator is disabled.                                       */
} SCG_FIRCCSR_FIRCREGOFF_Enum;

/* ==============================================  SCG SCG_FIRCCSR LK [23..23]  ============================================== */
typedef enum {                                  /*!< SCG_FIRCCSR_LK                                                            */
  SCG_FIRCCSR_LK_0                     = 0,     /*!< 0 : Control Status Register can be written.                               */
  SCG_FIRCCSR_LK_1                     = 1,     /*!< 1 : Control Status Register cannot be written.                            */
} SCG_FIRCCSR_LK_Enum;

/* ===========================================  SCG SCG_FIRCCSR FIRCVLD [24..24]  ============================================ */
typedef enum {                                  /*!< SCG_FIRCCSR_FIRCVLD                                                       */
  SCG_FIRCCSR_FIRCVLD_0                = 0,     /*!< 0 : Fast IRC is not enabled or clock is not valid.                        */
  SCG_FIRCCSR_FIRCVLD_1                = 1,     /*!< 1 : Fast IRC is enabled and output clock is valid. The clock
                                                     is valid once there is an output clock from the FIRC analog.              */
} SCG_FIRCCSR_FIRCVLD_Enum;

/* ===========================================  SCG SCG_FIRCCSR FIRCSEL [25..25]  ============================================ */
typedef enum {                                  /*!< SCG_FIRCCSR_FIRCSEL                                                       */
  SCG_FIRCCSR_FIRCSEL_0                = 0,     /*!< 0 : Fast IRC is not the system clock source                               */
  SCG_FIRCCSR_FIRCSEL_1                = 1,     /*!< 1 : Fast IRC is the system clock source                                   */
} SCG_FIRCCSR_FIRCSEL_Enum;

