nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===========================================  SCG SCG_FIRCCSR FIRCERR [26..26]  ============================================ */
typedef enum {                                  /*!< SCG_FIRCCSR_FIRCERR                                                       */
  SCG_FIRCCSR_FIRCERR_0                = 0,     /*!< 0 : Error not detected with the Fast IRC trimming.                        */
  SCG_FIRCCSR_FIRCERR_1                = 1,     /*!< 1 : Error detected with the Fast IRC trimming.                            */
} SCG_FIRCCSR_FIRCERR_Enum;

/* ======================================================  SCG_FIRCDIV  ====================================================== */
/* ============================================  SCG SCG_FIRCDIV FIRCDIV1 [0..2]  ============================================ */
typedef enum {                                  /*!< SCG_FIRCDIV_FIRCDIV1                                                      */
  SCG_FIRCDIV_FIRCDIV1_000             = 0,     /*!< 000 : Output disabled                                                     */
  SCG_FIRCDIV_FIRCDIV1_001             = 1,     /*!< 001 : Divide by 1                                                         */
  SCG_FIRCDIV_FIRCDIV1_010             = 2,     /*!< 010 : Divide by 2                                                         */
  SCG_FIRCDIV_FIRCDIV1_011             = 3,     /*!< 011 : Divide by 4                                                         */
  SCG_FIRCDIV_FIRCDIV1_100             = 4,     /*!< 100 : Divide by 8                                                         */
  SCG_FIRCDIV_FIRCDIV1_101             = 5,     /*!< 101 : Divide by 16                                                        */
  SCG_FIRCDIV_FIRCDIV1_110             = 6,     /*!< 110 : Divide by 32                                                        */
  SCG_FIRCDIV_FIRCDIV1_111             = 7,     /*!< 111 : Divide by 64                                                        */
} SCG_FIRCDIV_FIRCDIV1_Enum;

/* ===========================================  SCG SCG_FIRCDIV FIRCDIV2 [8..10]  ============================================ */
typedef enum {                                  /*!< SCG_FIRCDIV_FIRCDIV2                                                      */
  SCG_FIRCDIV_FIRCDIV2_000             = 0,     /*!< 000 : Output disabled                                                     */
  SCG_FIRCDIV_FIRCDIV2_001             = 1,     /*!< 001 : Divide by 1                                                         */
  SCG_FIRCDIV_FIRCDIV2_010             = 2,     /*!< 010 : Divide by 2                                                         */
  SCG_FIRCDIV_FIRCDIV2_011             = 3,     /*!< 011 : Divide by 4                                                         */
  SCG_FIRCDIV_FIRCDIV2_100             = 4,     /*!< 100 : Divide by 8                                                         */
  SCG_FIRCDIV_FIRCDIV2_101             = 5,     /*!< 101 : Divide by 16                                                        */
  SCG_FIRCDIV_FIRCDIV2_110             = 6,     /*!< 110 : Divide by 32                                                        */
  SCG_FIRCDIV_FIRCDIV2_111             = 7,     /*!< 111 : Divide by 64                                                        */
} SCG_FIRCDIV_FIRCDIV2_Enum;

/* ======================================================  SCG_FIRCCFG  ====================================================== */
/* =============================================  SCG SCG_FIRCCFG RANGE [0..1]  ============================================== */
typedef enum {                                  /*!< SCG_FIRCCFG_RANGE                                                         */
  SCG_FIRCCFG_RANGE_00                 = 0,     /*!< 00 : Fast IRC is trimmed to 48 MHz                                        */
} SCG_FIRCCFG_RANGE_Enum;



/* =========================================================================================================================== */
/* ================                                            PCC                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  PCC_FTFC  ======================================================== */
/* ===============================================  PCC PCC_FTFC CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_FTFC_CGC                                                          */
  PCC_PCC_FTFC_CGC_0                   = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_FTFC_CGC_1                   = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_FTFC_CGC_Enum;

/* ===============================================  PCC PCC_FTFC PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_FTFC_PR                                                           */
  PCC_PCC_FTFC_PR_0                    = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_FTFC_PR_1                    = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_FTFC_PR_Enum;

/* ======================================================  PCC_DMAMUX  ======================================================= */
/* ==============================================  PCC PCC_DMAMUX CGC [30..30]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_DMAMUX_CGC                                                        */
  PCC_PCC_DMAMUX_CGC_0                 = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_DMAMUX_CGC_1                 = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_DMAMUX_CGC_Enum;

/* ==============================================  PCC PCC_DMAMUX PR [31..31]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_DMAMUX_PR                                                         */
  PCC_PCC_DMAMUX_PR_0                  = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_DMAMUX_PR_1                  = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_DMAMUX_PR_Enum;

