nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===============================================  PCC PCC_ADC0 PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_ADC0_PR                                                           */
  PCC_PCC_ADC0_PR_0                    = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_ADC0_PR_1                    = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_ADC0_PR_Enum;

/* ========================================================  PCC_RTC  ======================================================== */
/* ===============================================  PCC PCC_RTC CGC [30..30]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_RTC_CGC                                                           */
  PCC_PCC_RTC_CGC_0                    = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_RTC_CGC_1                    = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_RTC_CGC_Enum;

/* ================================================  PCC PCC_RTC PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_RTC_PR                                                            */
  PCC_PCC_RTC_PR_0                     = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_RTC_PR_1                     = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_RTC_PR_Enum;

/* =======================================================  PCC_CMU0  ======================================================== */
/* ===============================================  PCC PCC_CMU0 CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_CMU0_CGC                                                          */
  PCC_PCC_CMU0_CGC_0                   = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_CMU0_CGC_1                   = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_CMU0_CGC_Enum;

/* ===============================================  PCC PCC_CMU0 PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_CMU0_PR                                                           */
  PCC_PCC_CMU0_PR_0                    = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_CMU0_PR_1                    = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_CMU0_PR_Enum;

/* =======================================================  PCC_CMU1  ======================================================== */
/* ===============================================  PCC PCC_CMU1 CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_CMU1_CGC                                                          */
  PCC_PCC_CMU1_CGC_0                   = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_CMU1_CGC_1                   = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_CMU1_CGC_Enum;

/* ===============================================  PCC PCC_CMU1 PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_CMU1_PR                                                           */
  PCC_PCC_CMU1_PR_0                    = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_CMU1_PR_1                    = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_CMU1_PR_Enum;

/* ======================================================  PCC_LPTMR0  ======================================================= */
/* ===============================================  PCC PCC_LPTMR0 PCD [0..3]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_LPTMR0_PCD                                                        */
  PCC_PCC_LPTMR0_PCD_0000              = 0,     /*!< 0000 : Divide by 1.                                                       */
  PCC_PCC_LPTMR0_PCD_0001              = 1,     /*!< 0001 : Divide by 2.                                                       */
  PCC_PCC_LPTMR0_PCD_0010              = 2,     /*!< 0010 : Divide by 3.                                                       */
  PCC_PCC_LPTMR0_PCD_0011              = 3,     /*!< 0011 : Divide by 4.                                                       */
  PCC_PCC_LPTMR0_PCD_0100              = 4,     /*!< 0100 : Divide by 5.                                                       */
  PCC_PCC_LPTMR0_PCD_0101              = 5,     /*!< 0101 : Divide by 6.                                                       */
  PCC_PCC_LPTMR0_PCD_0110              = 6,     /*!< 0110 : Divide by 7.                                                       */
  PCC_PCC_LPTMR0_PCD_0111              = 7,     /*!< 0111 : Divide by 8.                                                       */
} PCC_PCC_LPTMR0_PCD_Enum;

