nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  PCC_LPUART0  ====================================================== */
/* =============================================  PCC PCC_LPUART0 PCS [24..26]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPUART0_PCS                                                       */
  PCC_PCC_LPUART0_PCS_000              = 0,     /*!< 000 : Clock is off.                                                       */
  PCC_PCC_LPUART0_PCS_001              = 1,     /*!< 001 : Clock option 1                                                      */
  PCC_PCC_LPUART0_PCS_010              = 2,     /*!< 010 : Clock option 2                                                      */
  PCC_PCC_LPUART0_PCS_011              = 3,     /*!< 011 : Clock option 3                                                      */
  PCC_PCC_LPUART0_PCS_100              = 4,     /*!< 100 : Clock option 4                                                      */
  PCC_PCC_LPUART0_PCS_101              = 5,     /*!< 101 : Clock option 5                                                      */
  PCC_PCC_LPUART0_PCS_110              = 6,     /*!< 110 : Clock option 6                                                      */
  PCC_PCC_LPUART0_PCS_111              = 7,     /*!< 111 : Clock option 7                                                      */
} PCC_PCC_LPUART0_PCS_Enum;

/* =============================================  PCC PCC_LPUART0 CGC [30..30]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPUART0_CGC                                                       */
  PCC_PCC_LPUART0_CGC_0                = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_LPUART0_CGC_1                = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_LPUART0_CGC_Enum;

/* ==============================================  PCC PCC_LPUART0 PR [31..31]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPUART0_PR                                                        */
  PCC_PCC_LPUART0_PR_0                 = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_LPUART0_PR_1                 = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_LPUART0_PR_Enum;

/* ======================================================  PCC_LPUART1  ====================================================== */
/* =============================================  PCC PCC_LPUART1 PCS [24..26]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPUART1_PCS                                                       */
  PCC_PCC_LPUART1_PCS_000              = 0,     /*!< 000 : Clock is off.                                                       */
  PCC_PCC_LPUART1_PCS_001              = 1,     /*!< 001 : Clock option 1                                                      */
  PCC_PCC_LPUART1_PCS_010              = 2,     /*!< 010 : Clock option 2                                                      */
  PCC_PCC_LPUART1_PCS_011              = 3,     /*!< 011 : Clock option 3                                                      */
  PCC_PCC_LPUART1_PCS_100              = 4,     /*!< 100 : Clock option 4                                                      */
  PCC_PCC_LPUART1_PCS_101              = 5,     /*!< 101 : Clock option 5                                                      */
  PCC_PCC_LPUART1_PCS_110              = 6,     /*!< 110 : Clock option 6                                                      */
  PCC_PCC_LPUART1_PCS_111              = 7,     /*!< 111 : Clock option 7                                                      */
} PCC_PCC_LPUART1_PCS_Enum;

/* =============================================  PCC PCC_LPUART1 CGC [30..30]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPUART1_CGC                                                       */
  PCC_PCC_LPUART1_CGC_0                = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_LPUART1_CGC_1                = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_LPUART1_CGC_Enum;

/* ==============================================  PCC PCC_LPUART1 PR [31..31]  ============================================== */
typedef enum {                                  /*!< PCC_PCC_LPUART1_PR                                                        */
  PCC_PCC_LPUART1_PR_0                 = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_LPUART1_PR_1                 = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_LPUART1_PR_Enum;

/* =======================================================  PCC_CMP0  ======================================================== */
/* ===============================================  PCC PCC_CMP0 CGC [30..30]  =============================================== */
typedef enum {                                  /*!< PCC_PCC_CMP0_CGC                                                          */
  PCC_PCC_CMP0_CGC_0                   = 0,     /*!< 0 : Clock disabled                                                        */
  PCC_PCC_CMP0_CGC_1                   = 1,     /*!< 1 : Clock enabled. The current clock selection and divider options
                                                     are locked.                                                               */
} PCC_PCC_CMP0_CGC_Enum;

/* ===============================================  PCC PCC_CMP0 PR [31..31]  ================================================ */
typedef enum {                                  /*!< PCC_PCC_CMP0_PR                                                           */
  PCC_PCC_CMP0_PR_0                    = 0,     /*!< 0 : Peripheral is not present.                                            */
  PCC_PCC_CMP0_PR_1                    = 1,     /*!< 1 : Peripheral is present.                                                */
} PCC_PCC_CMP0_PR_Enum;



/* =========================================================================================================================== */
/* ================                                          LPI2C0                                           ================ */
/* =========================================================================================================================== */

