nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =====================================================  LPI2C0_VERID  ====================================================== */
/* ==========================================  LPI2C0 LPI2C0_VERID FEATURE [0..15]  ========================================== */
typedef enum {                                  /*!< LPI2C0_VERID_FEATURE                                                      */
  LPI2C0_VERID_FEATURE_0000000000000010 = 2,    /*!< 0000000000000010 : Master only with standard feature set.                 */
  LPI2C0_VERID_FEATURE_0000000000000011 = 3,    /*!< 0000000000000011 : Master and slave with standard feature set.            */
} LPI2C0_VERID_FEATURE_Enum;

/* =====================================================  LPI2C0_PARAM  ====================================================== */
/* ======================================================  LPI2C0_MCR  ======================================================= */
/* =============================================  LPI2C0 LPI2C0_MCR MEN [0..0]  ============================================== */
typedef enum {                                  /*!< LPI2C0_MCR_MEN                                                            */
  LPI2C0_MCR_MEN_0                     = 0,     /*!< 0 : Master logic is disabled.                                             */
  LPI2C0_MCR_MEN_1                     = 1,     /*!< 1 : Master logic is enabled.                                              */
} LPI2C0_MCR_MEN_Enum;

/* =============================================  LPI2C0 LPI2C0_MCR RST [1..1]  ============================================== */
typedef enum {                                  /*!< LPI2C0_MCR_RST                                                            */
  LPI2C0_MCR_RST_0                     = 0,     /*!< 0 : Master logic is not reset.                                            */
  LPI2C0_MCR_RST_1                     = 1,     /*!< 1 : Master logic is reset.                                                */
} LPI2C0_MCR_RST_Enum;

/* ============================================  LPI2C0 LPI2C0_MCR DOZEN [2..2]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MCR_DOZEN                                                          */
  LPI2C0_MCR_DOZEN_0                   = 0,     /*!< 0 : Master is enabled in Doze mode.                                       */
  LPI2C0_MCR_DOZEN_1                   = 1,     /*!< 1 : Master is disabled in Doze mode.                                      */
} LPI2C0_MCR_DOZEN_Enum;

/* ============================================  LPI2C0 LPI2C0_MCR DBGEN [3..3]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MCR_DBGEN                                                          */
  LPI2C0_MCR_DBGEN_0                   = 0,     /*!< 0 : Master is disabled in debug mode.                                     */
  LPI2C0_MCR_DBGEN_1                   = 1,     /*!< 1 : Master is enabled in debug mode.                                      */
} LPI2C0_MCR_DBGEN_Enum;

/* =============================================  LPI2C0 LPI2C0_MCR RTF [8..8]  ============================================== */
typedef enum {                                  /*!< LPI2C0_MCR_RTF                                                            */
  LPI2C0_MCR_RTF_0                     = 0,     /*!< 0 : No effect.                                                            */
  LPI2C0_MCR_RTF_1                     = 1,     /*!< 1 : Transmit FIFO is reset.                                               */
} LPI2C0_MCR_RTF_Enum;

/* =============================================  LPI2C0 LPI2C0_MCR RRF [9..9]  ============================================== */
typedef enum {                                  /*!< LPI2C0_MCR_RRF                                                            */
  LPI2C0_MCR_RRF_0                     = 0,     /*!< 0 : No effect.                                                            */
  LPI2C0_MCR_RRF_1                     = 1,     /*!< 1 : Receive FIFO is reset.                                                */
} LPI2C0_MCR_RRF_Enum;

/* ======================================================  LPI2C0_MSR  ======================================================= */
/* =============================================  LPI2C0 LPI2C0_MSR TDF [0..0]  ============================================== */
typedef enum {                                  /*!< LPI2C0_MSR_TDF                                                            */
  LPI2C0_MSR_TDF_0                     = 0,     /*!< 0 : Transmit data not requested.                                          */
  LPI2C0_MSR_TDF_1                     = 1,     /*!< 1 : Transmit data is requested.                                           */
} LPI2C0_MSR_TDF_Enum;

/* =============================================  LPI2C0 LPI2C0_MSR RDF [1..1]  ============================================== */
typedef enum {                                  /*!< LPI2C0_MSR_RDF                                                            */
  LPI2C0_MSR_RDF_0                     = 0,     /*!< 0 : Receive Data is not ready.                                            */
  LPI2C0_MSR_RDF_1                     = 1,     /*!< 1 : Receive data is ready.                                                */
} LPI2C0_MSR_RDF_Enum;

/* =============================================  LPI2C0 LPI2C0_MSR EPF [8..8]  ============================================== */
typedef enum {                                  /*!< LPI2C0_MSR_EPF                                                            */
  LPI2C0_MSR_EPF_0                     = 0,     /*!< 0 : Master has not generated a STOP or Repeated START condition.          */
  LPI2C0_MSR_EPF_1                     = 1,     /*!< 1 : Master has generated a STOP or Repeated START condition.              */
} LPI2C0_MSR_EPF_Enum;

/* =============================================  LPI2C0 LPI2C0_MSR SDF [9..9]  ============================================== */
typedef enum {                                  /*!< LPI2C0_MSR_SDF                                                            */
  LPI2C0_MSR_SDF_0                     = 0,     /*!< 0 : Master has not generated a STOP condition.                            */
  LPI2C0_MSR_SDF_1                     = 1,     /*!< 1 : Master has generated a STOP condition.                                */
} LPI2C0_MSR_SDF_Enum;

