nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ============================================  LPI2C0 LPI2C0_MSR NDF [10..10]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MSR_NDF                                                            */
  LPI2C0_MSR_NDF_0                     = 0,     /*!< 0 : Unexpected NACK not detected.                                         */
  LPI2C0_MSR_NDF_1                     = 1,     /*!< 1 : Unexpected NACK was detected.                                         */
} LPI2C0_MSR_NDF_Enum;

/* ============================================  LPI2C0 LPI2C0_MSR ALF [11..11]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MSR_ALF                                                            */
  LPI2C0_MSR_ALF_0                     = 0,     /*!< 0 : Master has not lost arbitration.                                      */
  LPI2C0_MSR_ALF_1                     = 1,     /*!< 1 : Master has lost arbitration.                                          */
} LPI2C0_MSR_ALF_Enum;

/* ============================================  LPI2C0 LPI2C0_MSR FEF [12..12]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MSR_FEF                                                            */
  LPI2C0_MSR_FEF_0                     = 0,     /*!< 0 : No error.                                                             */
  LPI2C0_MSR_FEF_1                     = 1,     /*!< 1 : Master sending or receiving data without START condition.             */
} LPI2C0_MSR_FEF_Enum;

/* ============================================  LPI2C0 LPI2C0_MSR PLTF [13..13]  ============================================ */
typedef enum {                                  /*!< LPI2C0_MSR_PLTF                                                           */
  LPI2C0_MSR_PLTF_0                    = 0,     /*!< 0 : Pin low timeout has not occurred or is disabled.                      */
  LPI2C0_MSR_PLTF_1                    = 1,     /*!< 1 : Pin low timeout has occurred.                                         */
} LPI2C0_MSR_PLTF_Enum;

/* ============================================  LPI2C0 LPI2C0_MSR DMF [14..14]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MSR_DMF                                                            */
  LPI2C0_MSR_DMF_0                     = 0,     /*!< 0 : Have not received matching data.                                      */
  LPI2C0_MSR_DMF_1                     = 1,     /*!< 1 : Have received matching data.                                          */
} LPI2C0_MSR_DMF_Enum;

/* ============================================  LPI2C0 LPI2C0_MSR MBF [24..24]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MSR_MBF                                                            */
  LPI2C0_MSR_MBF_0                     = 0,     /*!< 0 : I2C Master is idle.                                                   */
  LPI2C0_MSR_MBF_1                     = 1,     /*!< 1 : I2C Master is busy.                                                   */
} LPI2C0_MSR_MBF_Enum;

/* ============================================  LPI2C0 LPI2C0_MSR BBF [25..25]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MSR_BBF                                                            */
  LPI2C0_MSR_BBF_0                     = 0,     /*!< 0 : I2C Bus is idle.                                                      */
  LPI2C0_MSR_BBF_1                     = 1,     /*!< 1 : I2C Bus is busy.                                                      */
} LPI2C0_MSR_BBF_Enum;

/* ======================================================  LPI2C0_MIER  ====================================================== */
/* ============================================  LPI2C0 LPI2C0_MIER TDIE [0..0]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MIER_TDIE                                                          */
  LPI2C0_MIER_TDIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_MIER_TDIE_1                   = 1,     /*!< 1 : Interrupt enabled                                                     */
} LPI2C0_MIER_TDIE_Enum;

/* ============================================  LPI2C0 LPI2C0_MIER RDIE [1..1]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MIER_RDIE                                                          */
  LPI2C0_MIER_RDIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_MIER_RDIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_MIER_RDIE_Enum;

/* ============================================  LPI2C0 LPI2C0_MIER EPIE [8..8]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MIER_EPIE                                                          */
  LPI2C0_MIER_EPIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_MIER_EPIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_MIER_EPIE_Enum;

/* ============================================  LPI2C0 LPI2C0_MIER SDIE [9..9]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MIER_SDIE                                                          */
  LPI2C0_MIER_SDIE_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  LPI2C0_MIER_SDIE_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} LPI2C0_MIER_SDIE_Enum;

