nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPI2C0 LPI2C0_MCFGR1 IGNACK [9..9]  =========================================== */
typedef enum {                                  /*!< LPI2C0_MCFGR1_IGNACK                                                      */
  LPI2C0_MCFGR1_IGNACK_0               = 0,     /*!< 0 : LPI2C Master will receive ACK and NACK normally.                      */
  LPI2C0_MCFGR1_IGNACK_1               = 1,     /*!< 1 : LPI2C Master will treat a received NACK as if it was an
                                                     ACK.                                                                      */
} LPI2C0_MCFGR1_IGNACK_Enum;

/* =========================================  LPI2C0 LPI2C0_MCFGR1 TIMECFG [10..10]  ========================================= */
typedef enum {                                  /*!< LPI2C0_MCFGR1_TIMECFG                                                     */
  LPI2C0_MCFGR1_TIMECFG_0              = 0,     /*!< 0 : Pin Low Timeout Flag will set if SCL is low for longer than
                                                     the configured timeout.                                                   */
  LPI2C0_MCFGR1_TIMECFG_1              = 1,     /*!< 1 : Pin Low Timeout Flag will set if either SCL or SDA is low
                                                     for longer than the configured timeout.                                   */
} LPI2C0_MCFGR1_TIMECFG_Enum;

/* =========================================  LPI2C0 LPI2C0_MCFGR1 MATCFG [16..18]  ========================================== */
typedef enum {                                  /*!< LPI2C0_MCFGR1_MATCFG                                                      */
  LPI2C0_MCFGR1_MATCFG_000             = 0,     /*!< 000 : Match disabled.                                                     */
  LPI2C0_MCFGR1_MATCFG_010             = 2,     /*!< 010 : Match enabled (1st data word equals MATCH0 OR MATCH1).              */
  LPI2C0_MCFGR1_MATCFG_011             = 3,     /*!< 011 : Match enabled (any data word equals MATCH0 OR MATCH1).              */
  LPI2C0_MCFGR1_MATCFG_100             = 4,     /*!< 100 : Match enabled (1st data word equals MATCH0 AND 2nd data
                                                     word equals MATCH1).                                                      */
  LPI2C0_MCFGR1_MATCFG_101             = 5,     /*!< 101 : Match enabled (any data word equals MATCH0 AND next data
                                                     word equals MATCH1).                                                      */
  LPI2C0_MCFGR1_MATCFG_110             = 6,     /*!< 110 : Match enabled (1st data word AND MATCH1 equals MATCH0
                                                     AND MATCH1).                                                              */
  LPI2C0_MCFGR1_MATCFG_111             = 7,     /*!< 111 : Match enabled (any data word AND MATCH1 equals MATCH0
                                                     AND MATCH1).                                                              */
} LPI2C0_MCFGR1_MATCFG_Enum;

/* =========================================  LPI2C0 LPI2C0_MCFGR1 PINCFG [24..26]  ========================================== */
typedef enum {                                  /*!< LPI2C0_MCFGR1_PINCFG                                                      */
  LPI2C0_MCFGR1_PINCFG_000             = 0,     /*!< 000 : LPI2C configured for 2-pin open drain mode.                         */
  LPI2C0_MCFGR1_PINCFG_001             = 1,     /*!< 001 : LPI2C configured for 2-pin output only mode (ultra-fast
                                                     mode).                                                                    */
  LPI2C0_MCFGR1_PINCFG_010             = 2,     /*!< 010 : LPI2C configured for 2-pin push-pull mode.                          */
  LPI2C0_MCFGR1_PINCFG_011             = 3,     /*!< 011 : LPI2C configured for 4-pin push-pull mode.                          */
  LPI2C0_MCFGR1_PINCFG_100             = 4,     /*!< 100 : LPI2C configured for 2-pin open drain mode with separate
                                                     LPI2C slave.                                                              */
  LPI2C0_MCFGR1_PINCFG_101             = 5,     /*!< 101 : LPI2C configured for 2-pin output only mode (ultra-fast
                                                     mode) with separate LPI2C slave.                                          */
  LPI2C0_MCFGR1_PINCFG_110             = 6,     /*!< 110 : LPI2C configured for 2-pin push-pull mode with separate
                                                     LPI2C slave.                                                              */
  LPI2C0_MCFGR1_PINCFG_111             = 7,     /*!< 111 : LPI2C configured for 4-pin push-pull mode (inverted outputs).       */
} LPI2C0_MCFGR1_PINCFG_Enum;

/* =====================================================  LPI2C0_MCFGR2  ===================================================== */
/* =====================================================  LPI2C0_MCFGR3  ===================================================== */
/* ======================================================  LPI2C0_MDMR  ====================================================== */
/* =====================================================  LPI2C0_MCCR0  ====================================================== */
/* =====================================================  LPI2C0_MCCR1  ====================================================== */
/* ======================================================  LPI2C0_MFCR  ====================================================== */
/* ======================================================  LPI2C0_MFSR  ====================================================== */
/* ======================================================  LPI2C0_MTDR  ====================================================== */
/* ============================================  LPI2C0 LPI2C0_MTDR CMD [8..10]  ============================================= */
typedef enum {                                  /*!< LPI2C0_MTDR_CMD                                                           */
  LPI2C0_MTDR_CMD_000                  = 0,     /*!< 000 : Transmit DATA[7:0].                                                 */
  LPI2C0_MTDR_CMD_001                  = 1,     /*!< 001 : Receive (DATA[7:0] + 1) bytes.                                      */
  LPI2C0_MTDR_CMD_010                  = 2,     /*!< 010 : Generate STOP condition.                                            */
  LPI2C0_MTDR_CMD_011                  = 3,     /*!< 011 : Receive and discard (DATA[7:0] + 1) bytes.                          */
  LPI2C0_MTDR_CMD_100                  = 4,     /*!< 100 : Generate (repeated) START and transmit address in DATA[7:0].        */
  LPI2C0_MTDR_CMD_101                  = 5,     /*!< 101 : Generate (repeated) START and transmit address in DATA[7:0].
                                                     This transfer expects a NACK to be returned.                              */
  LPI2C0_MTDR_CMD_110                  = 6,     /*!< 110 : Generate (repeated) START and transmit address in DATA[7:0]
                                                     using high speed mode.                                                    */
  LPI2C0_MTDR_CMD_111                  = 7,     /*!< 111 : Generate (repeated) START and transmit address in DATA[7:0]
                                                     using high speed mode. This transfer expects a NACK to
                                                     be returned.                                                              */
} LPI2C0_MTDR_CMD_Enum;

/* ======================================================  LPI2C0_MRDR  ====================================================== */
/* ==========================================  LPI2C0 LPI2C0_MRDR RXEMPTY [14..14]  ========================================== */
typedef enum {                                  /*!< LPI2C0_MRDR_RXEMPTY                                                       */
  LPI2C0_MRDR_RXEMPTY_0                = 0,     /*!< 0 : Receive FIFO is not empty.                                            */
  LPI2C0_MRDR_RXEMPTY_1                = 1,     /*!< 1 : Receive FIFO is empty.                                                */
} LPI2C0_MRDR_RXEMPTY_Enum;

/* ======================================================  LPI2C0_SCR  ======================================================= */
/* =============================================  LPI2C0 LPI2C0_SCR SEN [0..0]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SCR_SEN                                                            */
  LPI2C0_SCR_SEN_0                     = 0,     /*!< 0 : Slave mode is disabled.                                               */
  LPI2C0_SCR_SEN_1                     = 1,     /*!< 1 : Slave mode is enabled.                                                */
} LPI2C0_SCR_SEN_Enum;

/* =============================================  LPI2C0 LPI2C0_SCR RST [1..1]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SCR_RST                                                            */
  LPI2C0_SCR_RST_0                     = 0,     /*!< 0 : Slave logic is not reset.                                             */
  LPI2C0_SCR_RST_1                     = 1,     /*!< 1 : Slave logic is reset.                                                 */
} LPI2C0_SCR_RST_Enum;

/* ============================================  LPI2C0 LPI2C0_SCR FILTEN [4..4]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SCR_FILTEN                                                         */
  LPI2C0_SCR_FILTEN_0                  = 0,     /*!< 0 : Disable digital filter and output delay counter for slave
                                                     mode.                                                                     */
  LPI2C0_SCR_FILTEN_1                  = 1,     /*!< 1 : Enable digital filter and output delay counter for slave
                                                     mode.                                                                     */
} LPI2C0_SCR_FILTEN_Enum;

/* ============================================  LPI2C0 LPI2C0_SCR FILTDZ [5..5]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SCR_FILTDZ                                                         */
  LPI2C0_SCR_FILTDZ_0                  = 0,     /*!< 0 : Filter remains enabled in Doze mode.                                  */
  LPI2C0_SCR_FILTDZ_1                  = 1,     /*!< 1 : Filter is disabled in Doze mode.                                      */
} LPI2C0_SCR_FILTDZ_Enum;

/* =============================================  LPI2C0 LPI2C0_SCR RTF [8..8]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SCR_RTF                                                            */
  LPI2C0_SCR_RTF_0                     = 0,     /*!< 0 : No effect                                                             */
  LPI2C0_SCR_RTF_1                     = 1,     /*!< 1 : Transmit Data Register is now empty                                   */
} LPI2C0_SCR_RTF_Enum;

