nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  LPI2C0 LPI2C0_SCR RRF [9..9]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SCR_RRF                                                            */
  LPI2C0_SCR_RRF_0                     = 0,     /*!< 0 : No effect                                                             */
  LPI2C0_SCR_RRF_1                     = 1,     /*!< 1 : Receive Data Register is now empty                                    */
} LPI2C0_SCR_RRF_Enum;

/* ======================================================  LPI2C0_SSR  ======================================================= */
/* =============================================  LPI2C0 LPI2C0_SSR TDF [0..0]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SSR_TDF                                                            */
  LPI2C0_SSR_TDF_0                     = 0,     /*!< 0 : Transmit data not requested.                                          */
  LPI2C0_SSR_TDF_1                     = 1,     /*!< 1 : Transmit data is requested.                                           */
} LPI2C0_SSR_TDF_Enum;

/* =============================================  LPI2C0 LPI2C0_SSR RDF [1..1]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SSR_RDF                                                            */
  LPI2C0_SSR_RDF_0                     = 0,     /*!< 0 : Receive Data is not ready.                                            */
  LPI2C0_SSR_RDF_1                     = 1,     /*!< 1 : Receive data is ready.                                                */
} LPI2C0_SSR_RDF_Enum;

/* =============================================  LPI2C0 LPI2C0_SSR AVF [2..2]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SSR_AVF                                                            */
  LPI2C0_SSR_AVF_0                     = 0,     /*!< 0 : Address Status Register is not valid.                                 */
  LPI2C0_SSR_AVF_1                     = 1,     /*!< 1 : Address Status Register is valid.                                     */
} LPI2C0_SSR_AVF_Enum;

/* =============================================  LPI2C0 LPI2C0_SSR TAF [3..3]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SSR_TAF                                                            */
  LPI2C0_SSR_TAF_0                     = 0,     /*!< 0 : Transmit ACK/NACK is not required.                                    */
  LPI2C0_SSR_TAF_1                     = 1,     /*!< 1 : Transmit ACK/NACK is required.                                        */
} LPI2C0_SSR_TAF_Enum;

/* =============================================  LPI2C0 LPI2C0_SSR RSF [8..8]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SSR_RSF                                                            */
  LPI2C0_SSR_RSF_0                     = 0,     /*!< 0 : Slave has not detected a Repeated START condition.                    */
  LPI2C0_SSR_RSF_1                     = 1,     /*!< 1 : Slave has detected a Repeated START condition.                        */
} LPI2C0_SSR_RSF_Enum;

/* =============================================  LPI2C0 LPI2C0_SSR SDF [9..9]  ============================================== */
typedef enum {                                  /*!< LPI2C0_SSR_SDF                                                            */
  LPI2C0_SSR_SDF_0                     = 0,     /*!< 0 : Slave has not detected a STOP condition.                              */
  LPI2C0_SSR_SDF_1                     = 1,     /*!< 1 : Slave has detected a STOP condition.                                  */
} LPI2C0_SSR_SDF_Enum;

/* ============================================  LPI2C0 LPI2C0_SSR BEF [10..10]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SSR_BEF                                                            */
  LPI2C0_SSR_BEF_0                     = 0,     /*!< 0 : Slave has not detected a bit error.                                   */
  LPI2C0_SSR_BEF_1                     = 1,     /*!< 1 : Slave has detected a bit error.                                       */
} LPI2C0_SSR_BEF_Enum;

/* ============================================  LPI2C0 LPI2C0_SSR FEF [11..11]  ============================================= */
typedef enum {                                  /*!< LPI2C0_SSR_FEF                                                            */
  LPI2C0_SSR_FEF_0                     = 0,     /*!< 0 : FIFO underflow or overflow not detected.                              */
  LPI2C0_SSR_FEF_1                     = 1,     /*!< 1 : FIFO underflow or overflow detected.                                  */
} LPI2C0_SSR_FEF_Enum;

/* ============================================  LPI2C0 LPI2C0_SSR AM0F [12..12]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SSR_AM0F                                                           */
  LPI2C0_SSR_AM0F_0                    = 0,     /*!< 0 : Have not received ADDR0 matching address.                             */
  LPI2C0_SSR_AM0F_1                    = 1,     /*!< 1 : Have received ADDR0 matching address.                                 */
} LPI2C0_SSR_AM0F_Enum;

/* ============================================  LPI2C0 LPI2C0_SSR AM1F [13..13]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SSR_AM1F                                                           */
  LPI2C0_SSR_AM1F_0                    = 0,     /*!< 0 : Have not received ADDR1 or ADDR0/ADDR1 range matching address.        */
  LPI2C0_SSR_AM1F_1                    = 1,     /*!< 1 : Have received ADDR1 or ADDR0/ADDR1 range matching address.            */
} LPI2C0_SSR_AM1F_Enum;

