nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =========================================  LPI2C0 LPI2C0_SCFGR1 IGNACK [12..12]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SCFGR1_IGNACK                                                      */
  LPI2C0_SCFGR1_IGNACK_0               = 0,     /*!< 0 : Slave will end transfer when NACK detected.                           */
  LPI2C0_SCFGR1_IGNACK_1               = 1,     /*!< 1 : Slave will not end transfer when NACK detected.                       */
} LPI2C0_SCFGR1_IGNACK_Enum;

/* ==========================================  LPI2C0 LPI2C0_SCFGR1 HSMEN [13..13]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SCFGR1_HSMEN                                                       */
  LPI2C0_SCFGR1_HSMEN_0                = 0,     /*!< 0 : Disables detection of Hs-mode master code.                            */
  LPI2C0_SCFGR1_HSMEN_1                = 1,     /*!< 1 : Enables detection of Hs-mode master code.                             */
} LPI2C0_SCFGR1_HSMEN_Enum;

/* =========================================  LPI2C0 LPI2C0_SCFGR1 ADDRCFG [16..18]  ========================================= */
typedef enum {                                  /*!< LPI2C0_SCFGR1_ADDRCFG                                                     */
  LPI2C0_SCFGR1_ADDRCFG_000            = 0,     /*!< 000 : Address match 0 (7-bit).                                            */
  LPI2C0_SCFGR1_ADDRCFG_001            = 1,     /*!< 001 : Address match 0 (10-bit).                                           */
  LPI2C0_SCFGR1_ADDRCFG_010            = 2,     /*!< 010 : Address match 0 (7-bit) or Address match 1 (7-bit).                 */
  LPI2C0_SCFGR1_ADDRCFG_011            = 3,     /*!< 011 : Address match 0 (10-bit) or Address match 1 (10-bit).               */
  LPI2C0_SCFGR1_ADDRCFG_100            = 4,     /*!< 100 : Address match 0 (7-bit) or Address match 1 (10-bit).                */
  LPI2C0_SCFGR1_ADDRCFG_101            = 5,     /*!< 101 : Address match 0 (10-bit) or Address match 1 (7-bit).                */
  LPI2C0_SCFGR1_ADDRCFG_110            = 6,     /*!< 110 : From Address match 0 (7-bit) to Address match 1 (7-bit).            */
  LPI2C0_SCFGR1_ADDRCFG_111            = 7,     /*!< 111 : From Address match 0 (10-bit) to Address match 1 (10-bit).          */
} LPI2C0_SCFGR1_ADDRCFG_Enum;

/* =====================================================  LPI2C0_SCFGR2  ===================================================== */
/* ======================================================  LPI2C0_SAMR  ====================================================== */
/* ======================================================  LPI2C0_SASR  ====================================================== */
/* ============================================  LPI2C0 LPI2C0_SASR ANV [14..14]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SASR_ANV                                                           */
  LPI2C0_SASR_ANV_0                    = 0,     /*!< 0 : RADDR is valid.                                                       */
  LPI2C0_SASR_ANV_1                    = 1,     /*!< 1 : RADDR is not valid.                                                   */
} LPI2C0_SASR_ANV_Enum;

/* ======================================================  LPI2C0_STAR  ====================================================== */
/* ===========================================  LPI2C0 LPI2C0_STAR TXNACK [0..0]  ============================================ */
typedef enum {                                  /*!< LPI2C0_STAR_TXNACK                                                        */
  LPI2C0_STAR_TXNACK_0                 = 0,     /*!< 0 : Transmit ACK for received word.                                       */
  LPI2C0_STAR_TXNACK_1                 = 1,     /*!< 1 : Transmit NACK for received word.                                      */
} LPI2C0_STAR_TXNACK_Enum;

/* ======================================================  LPI2C0_STDR  ====================================================== */
/* ======================================================  LPI2C0_SRDR  ====================================================== */
/* ==========================================  LPI2C0 LPI2C0_SRDR RXEMPTY [14..14]  ========================================== */
typedef enum {                                  /*!< LPI2C0_SRDR_RXEMPTY                                                       */
  LPI2C0_SRDR_RXEMPTY_0                = 0,     /*!< 0 : The Receive Data Register is not empty.                               */
  LPI2C0_SRDR_RXEMPTY_1                = 1,     /*!< 1 : The Receive Data Register is empty.                                   */
} LPI2C0_SRDR_RXEMPTY_Enum;

/* ============================================  LPI2C0 LPI2C0_SRDR SOF [15..15]  ============================================ */
typedef enum {                                  /*!< LPI2C0_SRDR_SOF                                                           */
  LPI2C0_SRDR_SOF_0                    = 0,     /*!< 0 : Indicates this is not the first data word since a (repeated)
                                                     START or STOP condition.                                                  */
  LPI2C0_SRDR_SOF_1                    = 1,     /*!< 1 : Indicates this is the first data word since a (repeated)
                                                     START or STOP condition.                                                  */
} LPI2C0_SRDR_SOF_Enum;



/* =========================================================================================================================== */
/* ================                                          LPUART0                                          ================ */
/* =========================================================================================================================== */

/* =====================================================  LPUART0_VERID  ===================================================== */
/* =========================================  LPUART0 LPUART0_VERID FEATURE [0..15]  ========================================= */
typedef enum {                                  /*!< LPUART0_VERID_FEATURE                                                     */
  LPUART0_VERID_FEATURE_0000000000000001 = 1,   /*!< 0000000000000001 : Standard feature set.                                  */
  LPUART0_VERID_FEATURE_0000000000000011 = 3,   /*!< 0000000000000011 : Standard feature set with MODEM/IrDA support.          */
} LPUART0_VERID_FEATURE_Enum;

/* =====================================================  LPUART0_PARAM  ===================================================== */
/* ====================================================  LPUART0_GLOBAL  ===================================================== */
/* ===========================================  LPUART0 LPUART0_GLOBAL RST [1..1]  =========================================== */
typedef enum {                                  /*!< LPUART0_GLOBAL_RST                                                        */
  LPUART0_GLOBAL_RST_0                 = 0,     /*!< 0 : Module is not reset.                                                  */
  LPUART0_GLOBAL_RST_1                 = 1,     /*!< 1 : Module is reset.                                                      */
} LPUART0_GLOBAL_RST_Enum;

/* ====================================================  LPUART0_PINCFG  ===================================================== */
/* =========================================  LPUART0 LPUART0_PINCFG TRGSEL [0..1]  ========================================== */
typedef enum {                                  /*!< LPUART0_PINCFG_TRGSEL                                                     */
  LPUART0_PINCFG_TRGSEL_00             = 0,     /*!< 00 : Input trigger is disabled.                                           */
  LPUART0_PINCFG_TRGSEL_01             = 1,     /*!< 01 : Input trigger is used instead of RXD pin input.                      */
  LPUART0_PINCFG_TRGSEL_10             = 2,     /*!< 10 : Input trigger is used instead of CTS_B pin input.                    */
  LPUART0_PINCFG_TRGSEL_11             = 3,     /*!< 11 : Input trigger is used to modulate the TXD pin output. The
                                                     TXD pin output (after TXINV configuration) is ANDed with
                                                     the input trigger.                                                        */
} LPUART0_PINCFG_TRGSEL_Enum;

