nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPUART0 LPUART0_CTRL ILIE [20..20]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_ILIE                                                         */
  LPUART0_CTRL_ILIE_0                  = 0,     /*!< 0 : Hardware interrupts from IDLE disabled; use polling.                  */
  LPUART0_CTRL_ILIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when IDLE flag is 1.                     */
} LPUART0_CTRL_ILIE_Enum;

/* ===========================================  LPUART0 LPUART0_CTRL RIE [21..21]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_RIE                                                          */
  LPUART0_CTRL_RIE_0                   = 0,     /*!< 0 : Hardware interrupts from RDRF disabled; use polling.                  */
  LPUART0_CTRL_RIE_1                   = 1,     /*!< 1 : Hardware interrupt requested when RDRF flag is 1.                     */
} LPUART0_CTRL_RIE_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL TCIE [22..22]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_TCIE                                                         */
  LPUART0_CTRL_TCIE_0                  = 0,     /*!< 0 : Hardware interrupts from TC disabled; use polling.                    */
  LPUART0_CTRL_TCIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when TC flag is 1.                       */
} LPUART0_CTRL_TCIE_Enum;

/* ===========================================  LPUART0 LPUART0_CTRL TIE [23..23]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_TIE                                                          */
  LPUART0_CTRL_TIE_0                   = 0,     /*!< 0 : Hardware interrupts from TDRE disabled; use polling.                  */
  LPUART0_CTRL_TIE_1                   = 1,     /*!< 1 : Hardware interrupt requested when TDRE flag is 1.                     */
} LPUART0_CTRL_TIE_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL PEIE [24..24]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_PEIE                                                         */
  LPUART0_CTRL_PEIE_0                  = 0,     /*!< 0 : PF interrupts disabled; use polling).                                 */
  LPUART0_CTRL_PEIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when PF is set.                          */
} LPUART0_CTRL_PEIE_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL FEIE [25..25]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_FEIE                                                         */
  LPUART0_CTRL_FEIE_0                  = 0,     /*!< 0 : FE interrupts disabled; use polling.                                  */
  LPUART0_CTRL_FEIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when FE is set.                          */
} LPUART0_CTRL_FEIE_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL NEIE [26..26]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_NEIE                                                         */
  LPUART0_CTRL_NEIE_0                  = 0,     /*!< 0 : NF interrupts disabled; use polling.                                  */
  LPUART0_CTRL_NEIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when NF is set.                          */
} LPUART0_CTRL_NEIE_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL ORIE [27..27]  =========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_ORIE                                                         */
  LPUART0_CTRL_ORIE_0                  = 0,     /*!< 0 : OR interrupts disabled; use polling.                                  */
  LPUART0_CTRL_ORIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when OR is set.                          */
} LPUART0_CTRL_ORIE_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL TXINV [28..28]  ========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_TXINV                                                        */
  LPUART0_CTRL_TXINV_0                 = 0,     /*!< 0 : Transmit data not inverted.                                           */
  LPUART0_CTRL_TXINV_1                 = 1,     /*!< 1 : Transmit data inverted.                                               */
} LPUART0_CTRL_TXINV_Enum;

/* ==========================================  LPUART0 LPUART0_CTRL TXDIR [29..29]  ========================================== */
typedef enum {                                  /*!< LPUART0_CTRL_TXDIR                                                        */
  LPUART0_CTRL_TXDIR_0                 = 0,     /*!< 0 : TXD pin is an input in single-wire mode.                              */
  LPUART0_CTRL_TXDIR_1                 = 1,     /*!< 1 : TXD pin is an output in single-wire mode.                             */
} LPUART0_CTRL_TXDIR_Enum;

/* =====================================================  LPUART0_DATA  ====================================================== */
/* =========================================  LPUART0 LPUART0_DATA IDLINE [11..11]  ========================================== */
typedef enum {                                  /*!< LPUART0_DATA_IDLINE                                                       */
  LPUART0_DATA_IDLINE_0                = 0,     /*!< 0 : Receiver was not idle before receiving this character.                */
  LPUART0_DATA_IDLINE_1                = 1,     /*!< 1 : Receiver was idle before receiving this character.                    */
} LPUART0_DATA_IDLINE_Enum;

/* =========================================  LPUART0 LPUART0_DATA RXEMPT [12..12]  ========================================== */
typedef enum {                                  /*!< LPUART0_DATA_RXEMPT                                                       */
  LPUART0_DATA_RXEMPT_0                = 0,     /*!< 0 : Receive buffer contains valid data.                                   */
  LPUART0_DATA_RXEMPT_1                = 1,     /*!< 1 : Receive buffer is empty, data returned on read is not valid.          */
} LPUART0_DATA_RXEMPT_Enum;

/* =========================================  LPUART0 LPUART0_DATA FRETSC [13..13]  ========================================== */
typedef enum {                                  /*!< LPUART0_DATA_FRETSC                                                       */
  LPUART0_DATA_FRETSC_0                = 0,     /*!< 0 : The dataword was received without a frame error on read,
                                                     or transmit a normal character on write.                                  */
  LPUART0_DATA_FRETSC_1                = 1,     /*!< 1 : The dataword was received with a frame error, or transmit
                                                     an idle or break character on transmit.                                   */
} LPUART0_DATA_FRETSC_Enum;

