nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =========================================  LPUART0 LPUART0_DATA PARITYE [14..14]  ========================================= */
typedef enum {                                  /*!< LPUART0_DATA_PARITYE                                                      */
  LPUART0_DATA_PARITYE_0               = 0,     /*!< 0 : The dataword was received without a parity error.                     */
  LPUART0_DATA_PARITYE_1               = 1,     /*!< 1 : The dataword was received with a parity error.                        */
} LPUART0_DATA_PARITYE_Enum;

/* ==========================================  LPUART0 LPUART0_DATA NOISY [15..15]  ========================================== */
typedef enum {                                  /*!< LPUART0_DATA_NOISY                                                        */
  LPUART0_DATA_NOISY_0                 = 0,     /*!< 0 : The dataword was received without noise.                              */
  LPUART0_DATA_NOISY_1                 = 1,     /*!< 1 : The data was received with noise.                                     */
} LPUART0_DATA_NOISY_Enum;

/* =====================================================  LPUART0_MATCH  ===================================================== */
/* =====================================================  LPUART0_MODIR  ===================================================== */
/* ==========================================  LPUART0 LPUART0_MODIR TXCTSE [0..0]  ========================================== */
typedef enum {                                  /*!< LPUART0_MODIR_TXCTSE                                                      */
  LPUART0_MODIR_TXCTSE_0               = 0,     /*!< 0 : CTS has no effect on the transmitter.                                 */
  LPUART0_MODIR_TXCTSE_1               = 1,     /*!< 1 : Enables clear-to-send operation. The transmitter checks
                                                     the state of CTS each time it is ready to send a character.
                                                     If CTS is asserted, the character is sent. If CTS is deasserted,
                                                     the signal TXD remains in the mark state and transmission
                                                     is delayed until CTS is asserted. Changes in CTS as a character
                                                     is being sent do not affect its transmission.                             */
} LPUART0_MODIR_TXCTSE_Enum;

/* ==========================================  LPUART0 LPUART0_MODIR TXRTSE [1..1]  ========================================== */
typedef enum {                                  /*!< LPUART0_MODIR_TXRTSE                                                      */
  LPUART0_MODIR_TXRTSE_0               = 0,     /*!< 0 : The transmitter has no effect on RTS.                                 */
  LPUART0_MODIR_TXRTSE_1               = 1,     /*!< 1 : When a character is placed into an empty transmitter data
                                                     buffer , RTS asserts one bit time before the start bit
                                                     is transmitted. RTS deasserts one bit time after all characters
                                                     in the transmitter data buffer and shift register are completely
                                                     sent, including the last stop bit.                                        */
} LPUART0_MODIR_TXRTSE_Enum;

/* =========================================  LPUART0 LPUART0_MODIR TXRTSPOL [2..2]  ========================================= */
typedef enum {                                  /*!< LPUART0_MODIR_TXRTSPOL                                                    */
  LPUART0_MODIR_TXRTSPOL_0             = 0,     /*!< 0 : Transmitter RTS is active low.                                        */
  LPUART0_MODIR_TXRTSPOL_1             = 1,     /*!< 1 : Transmitter RTS is active high.                                       */
} LPUART0_MODIR_TXRTSPOL_Enum;

/* ==========================================  LPUART0 LPUART0_MODIR RXRTSE [3..3]  ========================================== */
typedef enum {                                  /*!< LPUART0_MODIR_RXRTSE                                                      */
  LPUART0_MODIR_RXRTSE_0               = 0,     /*!< 0 : The receiver has no effect on RTS.                                    */
} LPUART0_MODIR_RXRTSE_Enum;

/* ==========================================  LPUART0 LPUART0_MODIR TXCTSC [4..4]  ========================================== */
typedef enum {                                  /*!< LPUART0_MODIR_TXCTSC                                                      */
  LPUART0_MODIR_TXCTSC_0               = 0,     /*!< 0 : CTS input is sampled at the start of each character.                  */
  LPUART0_MODIR_TXCTSC_1               = 1,     /*!< 1 : CTS input is sampled when the transmitter is idle.                    */
} LPUART0_MODIR_TXCTSC_Enum;

/* =========================================  LPUART0 LPUART0_MODIR TXCTSSRC [5..5]  ========================================= */
typedef enum {                                  /*!< LPUART0_MODIR_TXCTSSRC                                                    */
  LPUART0_MODIR_TXCTSSRC_0             = 0,     /*!< 0 : CTS input is the CTS_B pin.                                           */
  LPUART0_MODIR_TXCTSSRC_1             = 1,     /*!< 1 : CTS input is the inverted Receiver Match result.                      */
} LPUART0_MODIR_TXCTSSRC_Enum;

/* ==========================================  LPUART0 LPUART0_MODIR TNP [16..17]  =========================================== */
typedef enum {                                  /*!< LPUART0_MODIR_TNP                                                         */
  LPUART0_MODIR_TNP_00                 = 0,     /*!< 00 : 1/OSR.                                                               */
  LPUART0_MODIR_TNP_01                 = 1,     /*!< 01 : 2/OSR.                                                               */
  LPUART0_MODIR_TNP_10                 = 2,     /*!< 10 : 3/OSR.                                                               */
  LPUART0_MODIR_TNP_11                 = 3,     /*!< 11 : 4/OSR.                                                               */
} LPUART0_MODIR_TNP_Enum;

/* ==========================================  LPUART0 LPUART0_MODIR IREN [18..18]  ========================================== */
typedef enum {                                  /*!< LPUART0_MODIR_IREN                                                        */
  LPUART0_MODIR_IREN_0                 = 0,     /*!< 0 : IR disabled.                                                          */
  LPUART0_MODIR_IREN_1                 = 1,     /*!< 1 : IR enabled.                                                           */
} LPUART0_MODIR_IREN_Enum;

/* =====================================================  LPUART0_FIFO  ====================================================== */
/* ========================================  LPUART0 LPUART0_FIFO RXFIFOSIZE [0..2]  ========================================= */
typedef enum {                                  /*!< LPUART0_FIFO_RXFIFOSIZE                                                   */
  LPUART0_FIFO_RXFIFOSIZE_000          = 0,     /*!< 000 : Receive FIFO/Buffer depth = 1 dataword.                             */
  LPUART0_FIFO_RXFIFOSIZE_001          = 1,     /*!< 001 : Receive FIFO/Buffer depth = 4 datawords.                            */
  LPUART0_FIFO_RXFIFOSIZE_010          = 2,     /*!< 010 : Receive FIFO/Buffer depth = 8 datawords.                            */
  LPUART0_FIFO_RXFIFOSIZE_011          = 3,     /*!< 011 : Receive FIFO/Buffer depth = 16 datawords.                           */
  LPUART0_FIFO_RXFIFOSIZE_100          = 4,     /*!< 100 : Receive FIFO/Buffer depth = 32 datawords.                           */
  LPUART0_FIFO_RXFIFOSIZE_101          = 5,     /*!< 101 : Receive FIFO/Buffer depth = 64 datawords.                           */
  LPUART0_FIFO_RXFIFOSIZE_110          = 6,     /*!< 110 : Receive FIFO/Buffer depth = 128 datawords.                          */
  LPUART0_FIFO_RXFIFOSIZE_111          = 7,     /*!< 111 : Receive FIFO/Buffer depth = 256 datawords.                          */
} LPUART0_FIFO_RXFIFOSIZE_Enum;

/* ===========================================  LPUART0 LPUART0_FIFO RXFE [3..3]  ============================================ */
typedef enum {                                  /*!< LPUART0_FIFO_RXFE                                                         */
  LPUART0_FIFO_RXFE_0                  = 0,     /*!< 0 : Receive FIFO is not enabled. Buffer is depth 1. (Legacy
                                                     support)                                                                  */
  LPUART0_FIFO_RXFE_1                  = 1,     /*!< 1 : Receive FIFO is enabled. Buffer is depth indicted by RXFIFOSIZE.      */
} LPUART0_FIFO_RXFE_Enum;

/* ========================================  LPUART0 LPUART0_FIFO TXFIFOSIZE [4..6]  ========================================= */
typedef enum {                                  /*!< LPUART0_FIFO_TXFIFOSIZE                                                   */
  LPUART0_FIFO_TXFIFOSIZE_000          = 0,     /*!< 000 : Transmit FIFO/Buffer depth = 1 dataword.                            */
  LPUART0_FIFO_TXFIFOSIZE_001          = 1,     /*!< 001 : Transmit FIFO/Buffer depth = 4 datawords.                           */
  LPUART0_FIFO_TXFIFOSIZE_010          = 2,     /*!< 010 : Transmit FIFO/Buffer depth = 8 datawords.                           */
  LPUART0_FIFO_TXFIFOSIZE_011          = 3,     /*!< 011 : Transmit FIFO/Buffer depth = 16 datawords.                          */
  LPUART0_FIFO_TXFIFOSIZE_100          = 4,     /*!< 100 : Transmit FIFO/Buffer depth = 32 datawords.                          */
  LPUART0_FIFO_TXFIFOSIZE_101          = 5,     /*!< 101 : Transmit FIFO/Buffer depth = 64 datawords.                          */
  LPUART0_FIFO_TXFIFOSIZE_110          = 6,     /*!< 110 : Transmit FIFO/Buffer depth = 128 datawords.                         */
  LPUART0_FIFO_TXFIFOSIZE_111          = 7,     /*!< 111 : Transmit FIFO/Buffer depth = 256 datawords                          */
} LPUART0_FIFO_TXFIFOSIZE_Enum;

/* ===========================================  LPUART0 LPUART0_FIFO TXFE [7..7]  ============================================ */
typedef enum {                                  /*!< LPUART0_FIFO_TXFE                                                         */
  LPUART0_FIFO_TXFE_0                  = 0,     /*!< 0 : Transmit FIFO is not enabled. Buffer is depth 1. (Legacy
                                                     support).                                                                 */
  LPUART0_FIFO_TXFE_1                  = 1,     /*!< 1 : Transmit FIFO is enabled. Buffer is depth indicated by TXFIFOSIZE.    */
} LPUART0_FIFO_TXFE_Enum;

/* ===========================================  LPUART0 LPUART0_FIFO RXUFE [8..8]  =========================================== */
typedef enum {                                  /*!< LPUART0_FIFO_RXUFE                                                        */
  LPUART0_FIFO_RXUFE_0                 = 0,     /*!< 0 : RXUF flag does not generate an interrupt to the host.                 */
  LPUART0_FIFO_RXUFE_1                 = 1,     /*!< 1 : RXUF flag generates an interrupt to the host.                         */
} LPUART0_FIFO_RXUFE_Enum;

/* ===========================================  LPUART0 LPUART0_FIFO TXOFE [9..9]  =========================================== */
typedef enum {                                  /*!< LPUART0_FIFO_TXOFE                                                        */
  LPUART0_FIFO_TXOFE_0                 = 0,     /*!< 0 : TXOF flag does not generate an interrupt to the host.                 */
  LPUART0_FIFO_TXOFE_1                 = 1,     /*!< 1 : TXOF flag generates an interrupt to the host.                         */
} LPUART0_FIFO_TXOFE_Enum;

/* =========================================  LPUART0 LPUART0_FIFO RXIDEN [10..12]  ========================================== */
typedef enum {                                  /*!< LPUART0_FIFO_RXIDEN                                                       */
  LPUART0_FIFO_RXIDEN_000              = 0,     /*!< 000 : Disable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle.                                                         */
  LPUART0_FIFO_RXIDEN_001              = 1,     /*!< 001 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 1 character.                                         */
  LPUART0_FIFO_RXIDEN_010              = 2,     /*!< 010 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 2 characters.                                        */
  LPUART0_FIFO_RXIDEN_011              = 3,     /*!< 011 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 4 characters.                                        */
  LPUART0_FIFO_RXIDEN_100              = 4,     /*!< 100 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 8 characters.                                        */
  LPUART0_FIFO_RXIDEN_101              = 5,     /*!< 101 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 16 characters.                                       */
  LPUART0_FIFO_RXIDEN_110              = 6,     /*!< 110 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 32 characters.                                       */
  LPUART0_FIFO_RXIDEN_111              = 7,     /*!< 111 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 64 characters.                                       */
} LPUART0_FIFO_RXIDEN_Enum;

/* =========================================  LPUART0 LPUART0_FIFO RXFLUSH [14..14]  ========================================= */
typedef enum {                                  /*!< LPUART0_FIFO_RXFLUSH                                                      */
  LPUART0_FIFO_RXFLUSH_0               = 0,     /*!< 0 : No flush operation occurs.                                            */
  LPUART0_FIFO_RXFLUSH_1               = 1,     /*!< 1 : All data in the receive FIFO/buffer is cleared out.                   */
} LPUART0_FIFO_RXFLUSH_Enum;

/* =========================================  LPUART0 LPUART0_FIFO TXFLUSH [15..15]  ========================================= */
typedef enum {                                  /*!< LPUART0_FIFO_TXFLUSH                                                      */
  LPUART0_FIFO_TXFLUSH_0               = 0,     /*!< 0 : No flush operation occurs.                                            */
  LPUART0_FIFO_TXFLUSH_1               = 1,     /*!< 1 : All data in the transmit FIFO/Buffer is cleared out.                  */
} LPUART0_FIFO_TXFLUSH_Enum;

/* ==========================================  LPUART0 LPUART0_FIFO RXUF [16..16]  =========================================== */
typedef enum {                                  /*!< LPUART0_FIFO_RXUF                                                         */
  LPUART0_FIFO_RXUF_0                  = 0,     /*!< 0 : No receive buffer underflow has occurred since the last
                                                     time the flag was cleared.                                                */
  LPUART0_FIFO_RXUF_1                  = 1,     /*!< 1 : At least one receive buffer underflow has occurred since
                                                     the last time the flag was cleared.                                       */
} LPUART0_FIFO_RXUF_Enum;

/* ==========================================  LPUART0 LPUART0_FIFO TXOF [17..17]  =========================================== */
typedef enum {                                  /*!< LPUART0_FIFO_TXOF                                                         */
  LPUART0_FIFO_TXOF_0                  = 0,     /*!< 0 : No transmit buffer overflow has occurred since the last
                                                     time the flag was cleared.                                                */
  LPUART0_FIFO_TXOF_1                  = 1,     /*!< 1 : At least one transmit buffer overflow has occurred since
                                                     the last time the flag was cleared.                                       */
} LPUART0_FIFO_TXOF_Enum;

/* =========================================  LPUART0 LPUART0_FIFO RXEMPT [22..22]  ========================================== */
typedef enum {                                  /*!< LPUART0_FIFO_RXEMPT                                                       */
  LPUART0_FIFO_RXEMPT_0                = 0,     /*!< 0 : Receive buffer is not empty.                                          */
  LPUART0_FIFO_RXEMPT_1                = 1,     /*!< 1 : Receive buffer is empty.                                              */
} LPUART0_FIFO_RXEMPT_Enum;

/* =========================================  LPUART0 LPUART0_FIFO TXEMPT [23..23]  ========================================== */
typedef enum {                                  /*!< LPUART0_FIFO_TXEMPT                                                       */
  LPUART0_FIFO_TXEMPT_0                = 0,     /*!< 0 : Transmit buffer is not empty.                                         */
  LPUART0_FIFO_TXEMPT_1                = 1,     /*!< 1 : Transmit buffer is empty.                                             */
} LPUART0_FIFO_TXEMPT_Enum;

/* =====================================================  LPUART0_WATER  ===================================================== */


/* =========================================================================================================================== */
/* ================                                          LPUART1                                          ================ */
/* =========================================================================================================================== */

/* =====================================================  LPUART1_VERID  ===================================================== */
/* =========================================  LPUART1 LPUART1_VERID FEATURE [0..15]  ========================================= */
typedef enum {                                  /*!< LPUART1_VERID_FEATURE                                                     */
  LPUART1_VERID_FEATURE_0000000000000001 = 1,   /*!< 0000000000000001 : Standard feature set.                                  */
  LPUART1_VERID_FEATURE_0000000000000011 = 3,   /*!< 0000000000000011 : Standard feature set with MODEM/IrDA support.          */
} LPUART1_VERID_FEATURE_Enum;

/* =====================================================  LPUART1_PARAM  ===================================================== */
/* ====================================================  LPUART1_GLOBAL  ===================================================== */
/* ===========================================  LPUART1 LPUART1_GLOBAL RST [1..1]  =========================================== */
typedef enum {                                  /*!< LPUART1_GLOBAL_RST                                                        */
  LPUART1_GLOBAL_RST_0                 = 0,     /*!< 0 : Module is not reset.                                                  */
  LPUART1_GLOBAL_RST_1                 = 1,     /*!< 1 : Module is reset.                                                      */
} LPUART1_GLOBAL_RST_Enum;

/* ====================================================  LPUART1_PINCFG  ===================================================== */
/* =========================================  LPUART1 LPUART1_PINCFG TRGSEL [0..1]  ========================================== */
typedef enum {                                  /*!< LPUART1_PINCFG_TRGSEL                                                     */
  LPUART1_PINCFG_TRGSEL_00             = 0,     /*!< 00 : Input trigger is disabled.                                           */
  LPUART1_PINCFG_TRGSEL_01             = 1,     /*!< 01 : Input trigger is used instead of RXD pin input.                      */
  LPUART1_PINCFG_TRGSEL_10             = 2,     /*!< 10 : Input trigger is used instead of CTS_B pin input.                    */
  LPUART1_PINCFG_TRGSEL_11             = 3,     /*!< 11 : Input trigger is used to modulate the TXD pin output. The
                                                     TXD pin output (after TXINV configuration) is ANDed with
                                                     the input trigger.                                                        */
} LPUART1_PINCFG_TRGSEL_Enum;

/* =====================================================  LPUART1_BAUD  ====================================================== */
/* ==========================================  LPUART1 LPUART1_BAUD SBNS [13..13]  =========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_SBNS                                                         */
  LPUART1_BAUD_SBNS_0                  = 0,     /*!< 0 : One stop bit.                                                         */
  LPUART1_BAUD_SBNS_1                  = 1,     /*!< 1 : Two stop bits.                                                        */
} LPUART1_BAUD_SBNS_Enum;

/* =========================================  LPUART1 LPUART1_BAUD RXEDGIE [14..14]  ========================================= */
typedef enum {                                  /*!< LPUART1_BAUD_RXEDGIE                                                      */
  LPUART1_BAUD_RXEDGIE_0               = 0,     /*!< 0 : Hardware interrupts from LPUART_STAT[RXEDGIF] disabled.               */
  LPUART1_BAUD_RXEDGIE_1               = 1,     /*!< 1 : Hardware interrupt requested when LPUART_STAT[RXEDGIF] flag
                                                     is 1.                                                                     */
} LPUART1_BAUD_RXEDGIE_Enum;

/* =========================================  LPUART1 LPUART1_BAUD LBKDIE [15..15]  ========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_LBKDIE                                                       */
  LPUART1_BAUD_LBKDIE_0                = 0,     /*!< 0 : Hardware interrupts from LPUART_STAT[LBKDIF] disabled (use
                                                     polling).                                                                 */
  LPUART1_BAUD_LBKDIE_1                = 1,     /*!< 1 : Hardware interrupt requested when LPUART_STAT[LBKDIF] flag
                                                     is 1.                                                                     */
} LPUART1_BAUD_LBKDIE_Enum;

/* ========================================  LPUART1 LPUART1_BAUD RESYNCDIS [16..16]  ======================================== */
typedef enum {                                  /*!< LPUART1_BAUD_RESYNCDIS                                                    */
  LPUART1_BAUD_RESYNCDIS_0             = 0,     /*!< 0 : Resynchronization during received data word is supported              */
  LPUART1_BAUD_RESYNCDIS_1             = 1,     /*!< 1 : Resynchronization during received data word is disabled               */
} LPUART1_BAUD_RESYNCDIS_Enum;

