nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ========================================  LPUART1 LPUART1_BAUD BOTHEDGE [17..17]  ========================================= */
typedef enum {                                  /*!< LPUART1_BAUD_BOTHEDGE                                                     */
  LPUART1_BAUD_BOTHEDGE_0              = 0,     /*!< 0 : Receiver samples input data using the rising edge of the
                                                     baud rate clock.                                                          */
  LPUART1_BAUD_BOTHEDGE_1              = 1,     /*!< 1 : Receiver samples input data using the rising and falling
                                                     edge of the baud rate clock.                                              */
} LPUART1_BAUD_BOTHEDGE_Enum;

/* =========================================  LPUART1 LPUART1_BAUD MATCFG [18..19]  ========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_MATCFG                                                       */
  LPUART1_BAUD_MATCFG_00               = 0,     /*!< 00 : Address Match Wakeup                                                 */
  LPUART1_BAUD_MATCFG_01               = 1,     /*!< 01 : Idle Match Wakeup                                                    */
  LPUART1_BAUD_MATCFG_10               = 2,     /*!< 10 : Match On and Match Off                                               */
} LPUART1_BAUD_MATCFG_Enum;

/* =========================================  LPUART1 LPUART1_BAUD RIDMAE [20..20]  ========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_RIDMAE                                                       */
  LPUART1_BAUD_RIDMAE_0                = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPUART1_BAUD_RIDMAE_1                = 1,     /*!< 1 : DMA request enabled.                                                  */
} LPUART1_BAUD_RIDMAE_Enum;

/* ==========================================  LPUART1 LPUART1_BAUD RDMAE [21..21]  ========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_RDMAE                                                        */
  LPUART1_BAUD_RDMAE_0                 = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPUART1_BAUD_RDMAE_1                 = 1,     /*!< 1 : DMA request enabled.                                                  */
} LPUART1_BAUD_RDMAE_Enum;

/* ==========================================  LPUART1 LPUART1_BAUD TDMAE [23..23]  ========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_TDMAE                                                        */
  LPUART1_BAUD_TDMAE_0                 = 0,     /*!< 0 : DMA request disabled.                                                 */
  LPUART1_BAUD_TDMAE_1                 = 1,     /*!< 1 : DMA request enabled.                                                  */
} LPUART1_BAUD_TDMAE_Enum;

/* ===========================================  LPUART1 LPUART1_BAUD OSR [24..28]  =========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_OSR                                                          */
  LPUART1_BAUD_OSR_00000               = 0,     /*!< 00000 : Writing 0 to this field will result in an oversampling
                                                     ratio of 16                                                               */
  LPUART1_BAUD_OSR_00011               = 3,     /*!< 00011 : Oversampling ratio of 4, requires BOTHEDGE to be set.             */
  LPUART1_BAUD_OSR_00100               = 4,     /*!< 00100 : Oversampling ratio of 5, requires BOTHEDGE to be set.             */
  LPUART1_BAUD_OSR_00101               = 5,     /*!< 00101 : Oversampling ratio of 6, requires BOTHEDGE to be set.             */
  LPUART1_BAUD_OSR_00110               = 6,     /*!< 00110 : Oversampling ratio of 7, requires BOTHEDGE to be set.             */
  LPUART1_BAUD_OSR_00111               = 7,     /*!< 00111 : Oversampling ratio of 8.                                          */
  LPUART1_BAUD_OSR_01000               = 8,     /*!< 01000 : Oversampling ratio of 9.                                          */
  LPUART1_BAUD_OSR_01001               = 9,     /*!< 01001 : Oversampling ratio of 10.                                         */
  LPUART1_BAUD_OSR_01010               = 10,    /*!< 01010 : Oversampling ratio of 11.                                         */
  LPUART1_BAUD_OSR_01011               = 11,    /*!< 01011 : Oversampling ratio of 12.                                         */
  LPUART1_BAUD_OSR_01100               = 12,    /*!< 01100 : Oversampling ratio of 13.                                         */
  LPUART1_BAUD_OSR_01101               = 13,    /*!< 01101 : Oversampling ratio of 14.                                         */
  LPUART1_BAUD_OSR_01110               = 14,    /*!< 01110 : Oversampling ratio of 15.                                         */
  LPUART1_BAUD_OSR_01111               = 15,    /*!< 01111 : Oversampling ratio of 16.                                         */
  LPUART1_BAUD_OSR_10000               = 16,    /*!< 10000 : Oversampling ratio of 17.                                         */
  LPUART1_BAUD_OSR_10001               = 17,    /*!< 10001 : Oversampling ratio of 18.                                         */
  LPUART1_BAUD_OSR_10010               = 18,    /*!< 10010 : Oversampling ratio of 19.                                         */
  LPUART1_BAUD_OSR_10011               = 19,    /*!< 10011 : Oversampling ratio of 20.                                         */
  LPUART1_BAUD_OSR_10100               = 20,    /*!< 10100 : Oversampling ratio of 21.                                         */
  LPUART1_BAUD_OSR_10101               = 21,    /*!< 10101 : Oversampling ratio of 22.                                         */
  LPUART1_BAUD_OSR_10110               = 22,    /*!< 10110 : Oversampling ratio of 23.                                         */
  LPUART1_BAUD_OSR_10111               = 23,    /*!< 10111 : Oversampling ratio of 24.                                         */
  LPUART1_BAUD_OSR_11000               = 24,    /*!< 11000 : Oversampling ratio of 25.                                         */
  LPUART1_BAUD_OSR_11001               = 25,    /*!< 11001 : Oversampling ratio of 26.                                         */
  LPUART1_BAUD_OSR_11010               = 26,    /*!< 11010 : Oversampling ratio of 27.                                         */
  LPUART1_BAUD_OSR_11011               = 27,    /*!< 11011 : Oversampling ratio of 28.                                         */
  LPUART1_BAUD_OSR_11100               = 28,    /*!< 11100 : Oversampling ratio of 29.                                         */
  LPUART1_BAUD_OSR_11101               = 29,    /*!< 11101 : Oversampling ratio of 30.                                         */
  LPUART1_BAUD_OSR_11110               = 30,    /*!< 11110 : Oversampling ratio of 31.                                         */
  LPUART1_BAUD_OSR_11111               = 31,    /*!< 11111 : Oversampling ratio of 32.                                         */
} LPUART1_BAUD_OSR_Enum;

/* ===========================================  LPUART1 LPUART1_BAUD M10 [29..29]  =========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_M10                                                          */
  LPUART1_BAUD_M10_0                   = 0,     /*!< 0 : Receiver and transmitter use 7-bit to 9-bit data characters.          */
  LPUART1_BAUD_M10_1                   = 1,     /*!< 1 : Receiver and transmitter use 10-bit data characters.                  */
} LPUART1_BAUD_M10_Enum;

/* ==========================================  LPUART1 LPUART1_BAUD MAEN2 [30..30]  ========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_MAEN2                                                        */
  LPUART1_BAUD_MAEN2_0                 = 0,     /*!< 0 : Normal operation.                                                     */
  LPUART1_BAUD_MAEN2_1                 = 1,     /*!< 1 : Enables automatic address matching or data matching mode
                                                     for MATCH[MA2].                                                           */
} LPUART1_BAUD_MAEN2_Enum;

/* ==========================================  LPUART1 LPUART1_BAUD MAEN1 [31..31]  ========================================== */
typedef enum {                                  /*!< LPUART1_BAUD_MAEN1                                                        */
  LPUART1_BAUD_MAEN1_0                 = 0,     /*!< 0 : Normal operation.                                                     */
  LPUART1_BAUD_MAEN1_1                 = 1,     /*!< 1 : Enables automatic address matching or data matching mode
                                                     for MATCH[MA1].                                                           */
} LPUART1_BAUD_MAEN1_Enum;

/* =====================================================  LPUART1_STAT  ====================================================== */
/* ==========================================  LPUART1 LPUART1_STAT MA2F [14..14]  =========================================== */
typedef enum {                                  /*!< LPUART1_STAT_MA2F                                                         */
  LPUART1_STAT_MA2F_0                  = 0,     /*!< 0 : Received data is not equal to MA2                                     */
  LPUART1_STAT_MA2F_1                  = 1,     /*!< 1 : Received data is equal to MA2                                         */
} LPUART1_STAT_MA2F_Enum;

