nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPUART1 LPUART1_STAT MA1F [15..15]  =========================================== */
typedef enum {                                  /*!< LPUART1_STAT_MA1F                                                         */
  LPUART1_STAT_MA1F_0                  = 0,     /*!< 0 : Received data is not equal to MA1                                     */
  LPUART1_STAT_MA1F_1                  = 1,     /*!< 1 : Received data is equal to MA1                                         */
} LPUART1_STAT_MA1F_Enum;

/* ===========================================  LPUART1 LPUART1_STAT PF [16..16]  ============================================ */
typedef enum {                                  /*!< LPUART1_STAT_PF                                                           */
  LPUART1_STAT_PF_0                    = 0,     /*!< 0 : No parity error.                                                      */
  LPUART1_STAT_PF_1                    = 1,     /*!< 1 : Parity error.                                                         */
} LPUART1_STAT_PF_Enum;

/* ===========================================  LPUART1 LPUART1_STAT FE [17..17]  ============================================ */
typedef enum {                                  /*!< LPUART1_STAT_FE                                                           */
  LPUART1_STAT_FE_0                    = 0,     /*!< 0 : No framing error detected. This does not guarantee the framing
                                                     is correct.                                                               */
  LPUART1_STAT_FE_1                    = 1,     /*!< 1 : Framing error.                                                        */
} LPUART1_STAT_FE_Enum;

/* ===========================================  LPUART1 LPUART1_STAT NF [18..18]  ============================================ */
typedef enum {                                  /*!< LPUART1_STAT_NF                                                           */
  LPUART1_STAT_NF_0                    = 0,     /*!< 0 : No noise detected.                                                    */
  LPUART1_STAT_NF_1                    = 1,     /*!< 1 : Noise detected in the received character in LPUART_DATA.              */
} LPUART1_STAT_NF_Enum;

/* ===========================================  LPUART1 LPUART1_STAT OR [19..19]  ============================================ */
typedef enum {                                  /*!< LPUART1_STAT_OR                                                           */
  LPUART1_STAT_OR_0                    = 0,     /*!< 0 : No overrun.                                                           */
  LPUART1_STAT_OR_1                    = 1,     /*!< 1 : Receive overrun (new LPUART data lost).                               */
} LPUART1_STAT_OR_Enum;

/* ==========================================  LPUART1 LPUART1_STAT IDLE [20..20]  =========================================== */
typedef enum {                                  /*!< LPUART1_STAT_IDLE                                                         */
  LPUART1_STAT_IDLE_0                  = 0,     /*!< 0 : No idle line detected.                                                */
  LPUART1_STAT_IDLE_1                  = 1,     /*!< 1 : Idle line was detected.                                               */
} LPUART1_STAT_IDLE_Enum;

/* ==========================================  LPUART1 LPUART1_STAT RDRF [21..21]  =========================================== */
typedef enum {                                  /*!< LPUART1_STAT_RDRF                                                         */
  LPUART1_STAT_RDRF_0                  = 0,     /*!< 0 : Receive data buffer empty.                                            */
  LPUART1_STAT_RDRF_1                  = 1,     /*!< 1 : Receive data buffer full.                                             */
} LPUART1_STAT_RDRF_Enum;

/* ===========================================  LPUART1 LPUART1_STAT TC [22..22]  ============================================ */
typedef enum {                                  /*!< LPUART1_STAT_TC                                                           */
  LPUART1_STAT_TC_0                    = 0,     /*!< 0 : Transmitter active (sending data, a preamble, or a break).            */
  LPUART1_STAT_TC_1                    = 1,     /*!< 1 : Transmitter idle (transmission activity complete).                    */
} LPUART1_STAT_TC_Enum;

/* ==========================================  LPUART1 LPUART1_STAT TDRE [23..23]  =========================================== */
typedef enum {                                  /*!< LPUART1_STAT_TDRE                                                         */
  LPUART1_STAT_TDRE_0                  = 0,     /*!< 0 : Transmit data buffer full.                                            */
  LPUART1_STAT_TDRE_1                  = 1,     /*!< 1 : Transmit data buffer empty.                                           */
} LPUART1_STAT_TDRE_Enum;

/* ===========================================  LPUART1 LPUART1_STAT RAF [24..24]  =========================================== */
typedef enum {                                  /*!< LPUART1_STAT_RAF                                                          */
  LPUART1_STAT_RAF_0                   = 0,     /*!< 0 : LPUART receiver idle waiting for a start bit.                         */
  LPUART1_STAT_RAF_1                   = 1,     /*!< 1 : LPUART receiver active (RXD input not idle).                          */
} LPUART1_STAT_RAF_Enum;

/* ==========================================  LPUART1 LPUART1_STAT LBKDE [25..25]  ========================================== */
typedef enum {                                  /*!< LPUART1_STAT_LBKDE                                                        */
  LPUART1_STAT_LBKDE_0                 = 0,     /*!< 0 : LIN break detect is disabled, normal break character can
                                                     be detected.                                                              */
  LPUART1_STAT_LBKDE_1                 = 1,     /*!< 1 : LIN break detect is enabled. LIN break character is detected
                                                     at length of 11 bit times (if M = 0) or 12 (if M = 1) or
                                                     13 (M10 = 1).                                                             */
} LPUART1_STAT_LBKDE_Enum;

/* ==========================================  LPUART1 LPUART1_STAT BRK13 [26..26]  ========================================== */
typedef enum {                                  /*!< LPUART1_STAT_BRK13                                                        */
  LPUART1_STAT_BRK13_0                 = 0,     /*!< 0 : Break character is transmitted with length of 9 to 13 bit
                                                     times.                                                                    */
  LPUART1_STAT_BRK13_1                 = 1,     /*!< 1 : Break character is transmitted with length of 12 to 15 bit
                                                     times.                                                                    */
} LPUART1_STAT_BRK13_Enum;

