nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPUART1 LPUART1_CTRL ILIE [20..20]  =========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_ILIE                                                         */
  LPUART1_CTRL_ILIE_0                  = 0,     /*!< 0 : Hardware interrupts from IDLE disabled; use polling.                  */
  LPUART1_CTRL_ILIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when IDLE flag is 1.                     */
} LPUART1_CTRL_ILIE_Enum;

/* ===========================================  LPUART1 LPUART1_CTRL RIE [21..21]  =========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_RIE                                                          */
  LPUART1_CTRL_RIE_0                   = 0,     /*!< 0 : Hardware interrupts from RDRF disabled; use polling.                  */
  LPUART1_CTRL_RIE_1                   = 1,     /*!< 1 : Hardware interrupt requested when RDRF flag is 1.                     */
} LPUART1_CTRL_RIE_Enum;

/* ==========================================  LPUART1 LPUART1_CTRL TCIE [22..22]  =========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_TCIE                                                         */
  LPUART1_CTRL_TCIE_0                  = 0,     /*!< 0 : Hardware interrupts from TC disabled; use polling.                    */
  LPUART1_CTRL_TCIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when TC flag is 1.                       */
} LPUART1_CTRL_TCIE_Enum;

/* ===========================================  LPUART1 LPUART1_CTRL TIE [23..23]  =========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_TIE                                                          */
  LPUART1_CTRL_TIE_0                   = 0,     /*!< 0 : Hardware interrupts from TDRE disabled; use polling.                  */
  LPUART1_CTRL_TIE_1                   = 1,     /*!< 1 : Hardware interrupt requested when TDRE flag is 1.                     */
} LPUART1_CTRL_TIE_Enum;

/* ==========================================  LPUART1 LPUART1_CTRL PEIE [24..24]  =========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_PEIE                                                         */
  LPUART1_CTRL_PEIE_0                  = 0,     /*!< 0 : PF interrupts disabled; use polling).                                 */
  LPUART1_CTRL_PEIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when PF is set.                          */
} LPUART1_CTRL_PEIE_Enum;

/* ==========================================  LPUART1 LPUART1_CTRL FEIE [25..25]  =========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_FEIE                                                         */
  LPUART1_CTRL_FEIE_0                  = 0,     /*!< 0 : FE interrupts disabled; use polling.                                  */
  LPUART1_CTRL_FEIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when FE is set.                          */
} LPUART1_CTRL_FEIE_Enum;

/* ==========================================  LPUART1 LPUART1_CTRL NEIE [26..26]  =========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_NEIE                                                         */
  LPUART1_CTRL_NEIE_0                  = 0,     /*!< 0 : NF interrupts disabled; use polling.                                  */
  LPUART1_CTRL_NEIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when NF is set.                          */
} LPUART1_CTRL_NEIE_Enum;

/* ==========================================  LPUART1 LPUART1_CTRL ORIE [27..27]  =========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_ORIE                                                         */
  LPUART1_CTRL_ORIE_0                  = 0,     /*!< 0 : OR interrupts disabled; use polling.                                  */
  LPUART1_CTRL_ORIE_1                  = 1,     /*!< 1 : Hardware interrupt requested when OR is set.                          */
} LPUART1_CTRL_ORIE_Enum;

/* ==========================================  LPUART1 LPUART1_CTRL TXINV [28..28]  ========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_TXINV                                                        */
  LPUART1_CTRL_TXINV_0                 = 0,     /*!< 0 : Transmit data not inverted.                                           */
  LPUART1_CTRL_TXINV_1                 = 1,     /*!< 1 : Transmit data inverted.                                               */
} LPUART1_CTRL_TXINV_Enum;

/* ==========================================  LPUART1 LPUART1_CTRL TXDIR [29..29]  ========================================== */
typedef enum {                                  /*!< LPUART1_CTRL_TXDIR                                                        */
  LPUART1_CTRL_TXDIR_0                 = 0,     /*!< 0 : TXD pin is an input in single-wire mode.                              */
  LPUART1_CTRL_TXDIR_1                 = 1,     /*!< 1 : TXD pin is an output in single-wire mode.                             */
} LPUART1_CTRL_TXDIR_Enum;

/* =====================================================  LPUART1_DATA  ====================================================== */
/* =========================================  LPUART1 LPUART1_DATA IDLINE [11..11]  ========================================== */
typedef enum {                                  /*!< LPUART1_DATA_IDLINE                                                       */
  LPUART1_DATA_IDLINE_0                = 0,     /*!< 0 : Receiver was not idle before receiving this character.                */
  LPUART1_DATA_IDLINE_1                = 1,     /*!< 1 : Receiver was idle before receiving this character.                    */
} LPUART1_DATA_IDLINE_Enum;

