nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =========================================  LPUART1 LPUART1_DATA RXEMPT [12..12]  ========================================== */
typedef enum {                                  /*!< LPUART1_DATA_RXEMPT                                                       */
  LPUART1_DATA_RXEMPT_0                = 0,     /*!< 0 : Receive buffer contains valid data.                                   */
  LPUART1_DATA_RXEMPT_1                = 1,     /*!< 1 : Receive buffer is empty, data returned on read is not valid.          */
} LPUART1_DATA_RXEMPT_Enum;

/* =========================================  LPUART1 LPUART1_DATA FRETSC [13..13]  ========================================== */
typedef enum {                                  /*!< LPUART1_DATA_FRETSC                                                       */
  LPUART1_DATA_FRETSC_0                = 0,     /*!< 0 : The dataword was received without a frame error on read,
                                                     or transmit a normal character on write.                                  */
  LPUART1_DATA_FRETSC_1                = 1,     /*!< 1 : The dataword was received with a frame error, or transmit
                                                     an idle or break character on transmit.                                   */
} LPUART1_DATA_FRETSC_Enum;

/* =========================================  LPUART1 LPUART1_DATA PARITYE [14..14]  ========================================= */
typedef enum {                                  /*!< LPUART1_DATA_PARITYE                                                      */
  LPUART1_DATA_PARITYE_0               = 0,     /*!< 0 : The dataword was received without a parity error.                     */
  LPUART1_DATA_PARITYE_1               = 1,     /*!< 1 : The dataword was received with a parity error.                        */
} LPUART1_DATA_PARITYE_Enum;

/* ==========================================  LPUART1 LPUART1_DATA NOISY [15..15]  ========================================== */
typedef enum {                                  /*!< LPUART1_DATA_NOISY                                                        */
  LPUART1_DATA_NOISY_0                 = 0,     /*!< 0 : The dataword was received without noise.                              */
  LPUART1_DATA_NOISY_1                 = 1,     /*!< 1 : The data was received with noise.                                     */
} LPUART1_DATA_NOISY_Enum;

/* =====================================================  LPUART1_MATCH  ===================================================== */
/* =====================================================  LPUART1_MODIR  ===================================================== */
/* ==========================================  LPUART1 LPUART1_MODIR TXCTSE [0..0]  ========================================== */
typedef enum {                                  /*!< LPUART1_MODIR_TXCTSE                                                      */
  LPUART1_MODIR_TXCTSE_0               = 0,     /*!< 0 : CTS has no effect on the transmitter.                                 */
  LPUART1_MODIR_TXCTSE_1               = 1,     /*!< 1 : Enables clear-to-send operation. The transmitter checks
                                                     the state of CTS each time it is ready to send a character.
                                                     If CTS is asserted, the character is sent. If CTS is deasserted,
                                                     the signal TXD remains in the mark state and transmission
                                                     is delayed until CTS is asserted. Changes in CTS as a character
                                                     is being sent do not affect its transmission.                             */
} LPUART1_MODIR_TXCTSE_Enum;

/* ==========================================  LPUART1 LPUART1_MODIR TXRTSE [1..1]  ========================================== */
typedef enum {                                  /*!< LPUART1_MODIR_TXRTSE                                                      */
  LPUART1_MODIR_TXRTSE_0               = 0,     /*!< 0 : The transmitter has no effect on RTS.                                 */
  LPUART1_MODIR_TXRTSE_1               = 1,     /*!< 1 : When a character is placed into an empty transmitter data
                                                     buffer , RTS asserts one bit time before the start bit
                                                     is transmitted. RTS deasserts one bit time after all characters
                                                     in the transmitter data buffer and shift register are completely
                                                     sent, including the last stop bit.                                        */
} LPUART1_MODIR_TXRTSE_Enum;

/* =========================================  LPUART1 LPUART1_MODIR TXRTSPOL [2..2]  ========================================= */
typedef enum {                                  /*!< LPUART1_MODIR_TXRTSPOL                                                    */
  LPUART1_MODIR_TXRTSPOL_0             = 0,     /*!< 0 : Transmitter RTS is active low.                                        */
  LPUART1_MODIR_TXRTSPOL_1             = 1,     /*!< 1 : Transmitter RTS is active high.                                       */
} LPUART1_MODIR_TXRTSPOL_Enum;

/* ==========================================  LPUART1 LPUART1_MODIR RXRTSE [3..3]  ========================================== */
typedef enum {                                  /*!< LPUART1_MODIR_RXRTSE                                                      */
  LPUART1_MODIR_RXRTSE_0               = 0,     /*!< 0 : The receiver has no effect on RTS.                                    */
} LPUART1_MODIR_RXRTSE_Enum;

/* ==========================================  LPUART1 LPUART1_MODIR TXCTSC [4..4]  ========================================== */
typedef enum {                                  /*!< LPUART1_MODIR_TXCTSC                                                      */
  LPUART1_MODIR_TXCTSC_0               = 0,     /*!< 0 : CTS input is sampled at the start of each character.                  */
  LPUART1_MODIR_TXCTSC_1               = 1,     /*!< 1 : CTS input is sampled when the transmitter is idle.                    */
} LPUART1_MODIR_TXCTSC_Enum;

/* =========================================  LPUART1 LPUART1_MODIR TXCTSSRC [5..5]  ========================================= */
typedef enum {                                  /*!< LPUART1_MODIR_TXCTSSRC                                                    */
  LPUART1_MODIR_TXCTSSRC_0             = 0,     /*!< 0 : CTS input is the CTS_B pin.                                           */
  LPUART1_MODIR_TXCTSSRC_1             = 1,     /*!< 1 : CTS input is the inverted Receiver Match result.                      */
} LPUART1_MODIR_TXCTSSRC_Enum;

