nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  LPUART1 LPUART1_MODIR TNP [16..17]  =========================================== */
typedef enum {                                  /*!< LPUART1_MODIR_TNP                                                         */
  LPUART1_MODIR_TNP_00                 = 0,     /*!< 00 : 1/OSR.                                                               */
  LPUART1_MODIR_TNP_01                 = 1,     /*!< 01 : 2/OSR.                                                               */
  LPUART1_MODIR_TNP_10                 = 2,     /*!< 10 : 3/OSR.                                                               */
  LPUART1_MODIR_TNP_11                 = 3,     /*!< 11 : 4/OSR.                                                               */
} LPUART1_MODIR_TNP_Enum;

/* ==========================================  LPUART1 LPUART1_MODIR IREN [18..18]  ========================================== */
typedef enum {                                  /*!< LPUART1_MODIR_IREN                                                        */
  LPUART1_MODIR_IREN_0                 = 0,     /*!< 0 : IR disabled.                                                          */
  LPUART1_MODIR_IREN_1                 = 1,     /*!< 1 : IR enabled.                                                           */
} LPUART1_MODIR_IREN_Enum;

/* =====================================================  LPUART1_FIFO  ====================================================== */
/* ========================================  LPUART1 LPUART1_FIFO RXFIFOSIZE [0..2]  ========================================= */
typedef enum {                                  /*!< LPUART1_FIFO_RXFIFOSIZE                                                   */
  LPUART1_FIFO_RXFIFOSIZE_000          = 0,     /*!< 000 : Receive FIFO/Buffer depth = 1 dataword.                             */
  LPUART1_FIFO_RXFIFOSIZE_001          = 1,     /*!< 001 : Receive FIFO/Buffer depth = 4 datawords.                            */
  LPUART1_FIFO_RXFIFOSIZE_010          = 2,     /*!< 010 : Receive FIFO/Buffer depth = 8 datawords.                            */
  LPUART1_FIFO_RXFIFOSIZE_011          = 3,     /*!< 011 : Receive FIFO/Buffer depth = 16 datawords.                           */
  LPUART1_FIFO_RXFIFOSIZE_100          = 4,     /*!< 100 : Receive FIFO/Buffer depth = 32 datawords.                           */
  LPUART1_FIFO_RXFIFOSIZE_101          = 5,     /*!< 101 : Receive FIFO/Buffer depth = 64 datawords.                           */
  LPUART1_FIFO_RXFIFOSIZE_110          = 6,     /*!< 110 : Receive FIFO/Buffer depth = 128 datawords.                          */
  LPUART1_FIFO_RXFIFOSIZE_111          = 7,     /*!< 111 : Receive FIFO/Buffer depth = 256 datawords.                          */
} LPUART1_FIFO_RXFIFOSIZE_Enum;

/* ===========================================  LPUART1 LPUART1_FIFO RXFE [3..3]  ============================================ */
typedef enum {                                  /*!< LPUART1_FIFO_RXFE                                                         */
  LPUART1_FIFO_RXFE_0                  = 0,     /*!< 0 : Receive FIFO is not enabled. Buffer is depth 1. (Legacy
                                                     support)                                                                  */
  LPUART1_FIFO_RXFE_1                  = 1,     /*!< 1 : Receive FIFO is enabled. Buffer is depth indicted by RXFIFOSIZE.      */
} LPUART1_FIFO_RXFE_Enum;

/* ========================================  LPUART1 LPUART1_FIFO TXFIFOSIZE [4..6]  ========================================= */
typedef enum {                                  /*!< LPUART1_FIFO_TXFIFOSIZE                                                   */
  LPUART1_FIFO_TXFIFOSIZE_000          = 0,     /*!< 000 : Transmit FIFO/Buffer depth = 1 dataword.                            */
  LPUART1_FIFO_TXFIFOSIZE_001          = 1,     /*!< 001 : Transmit FIFO/Buffer depth = 4 datawords.                           */
  LPUART1_FIFO_TXFIFOSIZE_010          = 2,     /*!< 010 : Transmit FIFO/Buffer depth = 8 datawords.                           */
  LPUART1_FIFO_TXFIFOSIZE_011          = 3,     /*!< 011 : Transmit FIFO/Buffer depth = 16 datawords.                          */
  LPUART1_FIFO_TXFIFOSIZE_100          = 4,     /*!< 100 : Transmit FIFO/Buffer depth = 32 datawords.                          */
  LPUART1_FIFO_TXFIFOSIZE_101          = 5,     /*!< 101 : Transmit FIFO/Buffer depth = 64 datawords.                          */
  LPUART1_FIFO_TXFIFOSIZE_110          = 6,     /*!< 110 : Transmit FIFO/Buffer depth = 128 datawords.                         */
  LPUART1_FIFO_TXFIFOSIZE_111          = 7,     /*!< 111 : Transmit FIFO/Buffer depth = 256 datawords                          */
} LPUART1_FIFO_TXFIFOSIZE_Enum;

/* ===========================================  LPUART1 LPUART1_FIFO TXFE [7..7]  ============================================ */
typedef enum {                                  /*!< LPUART1_FIFO_TXFE                                                         */
  LPUART1_FIFO_TXFE_0                  = 0,     /*!< 0 : Transmit FIFO is not enabled. Buffer is depth 1. (Legacy
                                                     support).                                                                 */
  LPUART1_FIFO_TXFE_1                  = 1,     /*!< 1 : Transmit FIFO is enabled. Buffer is depth indicated by TXFIFOSIZE.    */
} LPUART1_FIFO_TXFE_Enum;

/* ===========================================  LPUART1 LPUART1_FIFO RXUFE [8..8]  =========================================== */
typedef enum {                                  /*!< LPUART1_FIFO_RXUFE                                                        */
  LPUART1_FIFO_RXUFE_0                 = 0,     /*!< 0 : RXUF flag does not generate an interrupt to the host.                 */
  LPUART1_FIFO_RXUFE_1                 = 1,     /*!< 1 : RXUF flag generates an interrupt to the host.                         */
} LPUART1_FIFO_RXUFE_Enum;

/* ===========================================  LPUART1 LPUART1_FIFO TXOFE [9..9]  =========================================== */
typedef enum {                                  /*!< LPUART1_FIFO_TXOFE                                                        */
  LPUART1_FIFO_TXOFE_0                 = 0,     /*!< 0 : TXOF flag does not generate an interrupt to the host.                 */
  LPUART1_FIFO_TXOFE_1                 = 1,     /*!< 1 : TXOF flag generates an interrupt to the host.                         */
} LPUART1_FIFO_TXOFE_Enum;

/* =========================================  LPUART1 LPUART1_FIFO RXIDEN [10..12]  ========================================== */
typedef enum {                                  /*!< LPUART1_FIFO_RXIDEN                                                       */
  LPUART1_FIFO_RXIDEN_000              = 0,     /*!< 000 : Disable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle.                                                         */
  LPUART1_FIFO_RXIDEN_001              = 1,     /*!< 001 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 1 character.                                         */
  LPUART1_FIFO_RXIDEN_010              = 2,     /*!< 010 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 2 characters.                                        */
  LPUART1_FIFO_RXIDEN_011              = 3,     /*!< 011 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 4 characters.                                        */
  LPUART1_FIFO_RXIDEN_100              = 4,     /*!< 100 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 8 characters.                                        */
  LPUART1_FIFO_RXIDEN_101              = 5,     /*!< 101 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 16 characters.                                       */
  LPUART1_FIFO_RXIDEN_110              = 6,     /*!< 110 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 32 characters.                                       */
  LPUART1_FIFO_RXIDEN_111              = 7,     /*!< 111 : Enable RDRF assertion due to partially filled FIFO when
                                                     receiver is idle for 64 characters.                                       */
} LPUART1_FIFO_RXIDEN_Enum;

/* =========================================  LPUART1 LPUART1_FIFO RXFLUSH [14..14]  ========================================= */
typedef enum {                                  /*!< LPUART1_FIFO_RXFLUSH                                                      */
  LPUART1_FIFO_RXFLUSH_0               = 0,     /*!< 0 : No flush operation occurs.                                            */
  LPUART1_FIFO_RXFLUSH_1               = 1,     /*!< 1 : All data in the receive FIFO/buffer is cleared out.                   */
} LPUART1_FIFO_RXFLUSH_Enum;

