nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =========================================  LPUART1 LPUART1_FIFO TXFLUSH [15..15]  ========================================= */
typedef enum {                                  /*!< LPUART1_FIFO_TXFLUSH                                                      */
  LPUART1_FIFO_TXFLUSH_0               = 0,     /*!< 0 : No flush operation occurs.                                            */
  LPUART1_FIFO_TXFLUSH_1               = 1,     /*!< 1 : All data in the transmit FIFO/Buffer is cleared out.                  */
} LPUART1_FIFO_TXFLUSH_Enum;

/* ==========================================  LPUART1 LPUART1_FIFO RXUF [16..16]  =========================================== */
typedef enum {                                  /*!< LPUART1_FIFO_RXUF                                                         */
  LPUART1_FIFO_RXUF_0                  = 0,     /*!< 0 : No receive buffer underflow has occurred since the last
                                                     time the flag was cleared.                                                */
  LPUART1_FIFO_RXUF_1                  = 1,     /*!< 1 : At least one receive buffer underflow has occurred since
                                                     the last time the flag was cleared.                                       */
} LPUART1_FIFO_RXUF_Enum;

/* ==========================================  LPUART1 LPUART1_FIFO TXOF [17..17]  =========================================== */
typedef enum {                                  /*!< LPUART1_FIFO_TXOF                                                         */
  LPUART1_FIFO_TXOF_0                  = 0,     /*!< 0 : No transmit buffer overflow has occurred since the last
                                                     time the flag was cleared.                                                */
  LPUART1_FIFO_TXOF_1                  = 1,     /*!< 1 : At least one transmit buffer overflow has occurred since
                                                     the last time the flag was cleared.                                       */
} LPUART1_FIFO_TXOF_Enum;

/* =========================================  LPUART1 LPUART1_FIFO RXEMPT [22..22]  ========================================== */
typedef enum {                                  /*!< LPUART1_FIFO_RXEMPT                                                       */
  LPUART1_FIFO_RXEMPT_0                = 0,     /*!< 0 : Receive buffer is not empty.                                          */
  LPUART1_FIFO_RXEMPT_1                = 1,     /*!< 1 : Receive buffer is empty.                                              */
} LPUART1_FIFO_RXEMPT_Enum;

/* =========================================  LPUART1 LPUART1_FIFO TXEMPT [23..23]  ========================================== */
typedef enum {                                  /*!< LPUART1_FIFO_TXEMPT                                                       */
  LPUART1_FIFO_TXEMPT_0                = 0,     /*!< 0 : Transmit buffer is not empty.                                         */
  LPUART1_FIFO_TXEMPT_1                = 1,     /*!< 1 : Transmit buffer is empty.                                             */
} LPUART1_FIFO_TXEMPT_Enum;

/* =====================================================  LPUART1_WATER  ===================================================== */


/* =========================================================================================================================== */
/* ================                                           CMP0                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CMP0_C0  ======================================================== */
/* ==============================================  CMP0 CMP0_C0 HYSTCTR [0..1]  ============================================== */
typedef enum {                                  /*!< CMP0_C0_HYSTCTR                                                           */
  CMP0_C0_HYSTCTR_00                   = 0,     /*!< 00 : The hard block output has level 0 hysteresis internally.             */
  CMP0_C0_HYSTCTR_01                   = 1,     /*!< 01 : The hard block output has level 1 hysteresis internally.             */
  CMP0_C0_HYSTCTR_10                   = 2,     /*!< 10 : The hard block output has level 2 hysteresis internally.             */
  CMP0_C0_HYSTCTR_11                   = 3,     /*!< 11 : The hard block output has level 3 hysteresis internally.             */
} CMP0_C0_HYSTCTR_Enum;

/* ==============================================  CMP0 CMP0_C0 OFFSET [2..2]  =============================================== */
typedef enum {                                  /*!< CMP0_C0_OFFSET                                                            */
  CMP0_C0_OFFSET_0                     = 0,     /*!< 0 : The comparator hard block output has level 0 offset internally.       */
  CMP0_C0_OFFSET_1                     = 1,     /*!< 1 : The comparator hard block output has level 1 offset internally.       */
} CMP0_C0_OFFSET_Enum;

/* ============================================  CMP0 CMP0_C0 FILTER_CNT [4..6]  ============================================= */
typedef enum {                                  /*!< CMP0_C0_FILTER_CNT                                                        */
  CMP0_C0_FILTER_CNT_000               = 0,     /*!< 000 : Filter is disabled. If SE = 1, then COUT is a logic zero
                                                     (this is not a legal state, and is not recommended). If
                                                     SE = 0, COUT = COUTA.                                                     */
  CMP0_C0_FILTER_CNT_001               = 1,     /*!< 001 : 1 consecutive sample must agree (comparator output is
                                                     simply sampled).                                                          */
  CMP0_C0_FILTER_CNT_010               = 2,     /*!< 010 : 2 consecutive samples must agree.                                   */
  CMP0_C0_FILTER_CNT_011               = 3,     /*!< 011 : 3 consecutive samples must agree.                                   */
  CMP0_C0_FILTER_CNT_100               = 4,     /*!< 100 : 4 consecutive samples must agree.                                   */
  CMP0_C0_FILTER_CNT_101               = 5,     /*!< 101 : 5 consecutive samples must agree.                                   */
  CMP0_C0_FILTER_CNT_110               = 6,     /*!< 110 : 6 consecutive samples must agree.                                   */
  CMP0_C0_FILTER_CNT_111               = 7,     /*!< 111 : 7 consecutive samples must agree.                                   */
} CMP0_C0_FILTER_CNT_Enum;

