nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ================================================  CMP0 CMP0_C0 EN [8..8]  ================================================= */
typedef enum {                                  /*!< CMP0_C0_EN                                                                */
  CMP0_C0_EN_0                         = 0,     /*!< 0 : Analog Comparator is disabled.                                        */
  CMP0_C0_EN_1                         = 1,     /*!< 1 : Analog Comparator is enabled.                                         */
} CMP0_C0_EN_Enum;

/* ================================================  CMP0 CMP0_C0 OPE [9..9]  ================================================ */
typedef enum {                                  /*!< CMP0_C0_OPE                                                               */
  CMP0_C0_OPE_0                        = 0,     /*!< 0 : When OPE is 0, the comparator output (after window/filter
                                                     settings dependent on software configuration) is not available
                                                     to a packaged pin.                                                        */
  CMP0_C0_OPE_1                        = 1,     /*!< 1 : When OPE is 1, and if the software has configured the comparator
                                                     to own a packaged pin, the comparator is available in a
                                                     packaged pin.                                                             */
} CMP0_C0_OPE_Enum;

/* ===============================================  CMP0 CMP0_C0 COS [10..10]  =============================================== */
typedef enum {                                  /*!< CMP0_C0_COS                                                               */
  CMP0_C0_COS_0                        = 0,     /*!< 0 : Set CMPO to equal COUT (filtered comparator output).                  */
  CMP0_C0_COS_1                        = 1,     /*!< 1 : Set CMPO to equal COUTA (unfiltered comparator output).               */
} CMP0_C0_COS_Enum;

/* ==============================================  CMP0 CMP0_C0 INVT [11..11]  =============================================== */
typedef enum {                                  /*!< CMP0_C0_INVT                                                              */
  CMP0_C0_INVT_0                       = 0,     /*!< 0 : Does not invert the comparator output.                                */
  CMP0_C0_INVT_1                       = 1,     /*!< 1 : Inverts the comparator output.                                        */
} CMP0_C0_INVT_Enum;

/* ==============================================  CMP0 CMP0_C0 PMODE [12..12]  ============================================== */
typedef enum {                                  /*!< CMP0_C0_PMODE                                                             */
  CMP0_C0_PMODE_0                      = 0,     /*!< 0 : Low Speed (LS) comparison mode is selected.                           */
  CMP0_C0_PMODE_1                      = 1,     /*!< 1 : High Speed (HS) comparison mode is selected, in VLPx mode,
                                                     or Stop mode switched to Low Speed (LS) mode.                             */
} CMP0_C0_PMODE_Enum;

/* ===============================================  CMP0 CMP0_C0 WE [14..14]  ================================================ */
typedef enum {                                  /*!< CMP0_C0_WE                                                                */
  CMP0_C0_WE_0                         = 0,     /*!< 0 : Windowing mode is not selected.                                       */
  CMP0_C0_WE_1                         = 1,     /*!< 1 : Windowing mode is selected.                                           */
} CMP0_C0_WE_Enum;

/* ===============================================  CMP0 CMP0_C0 SE [15..15]  ================================================ */
typedef enum {                                  /*!< CMP0_C0_SE                                                                */
  CMP0_C0_SE_0                         = 0,     /*!< 0 : Sampling mode is not selected.                                        */
  CMP0_C0_SE_1                         = 1,     /*!< 1 : Sampling mode is selected.                                            */
} CMP0_C0_SE_Enum;

/* ===============================================  CMP0 CMP0_C0 CFF [25..25]  =============================================== */
typedef enum {                                  /*!< CMP0_C0_CFF                                                               */
  CMP0_C0_CFF_0                        = 0,     /*!< 0 : A falling edge has not been detected on COUT.                         */
  CMP0_C0_CFF_1                        = 1,     /*!< 1 : A falling edge on COUT has occurred.                                  */
} CMP0_C0_CFF_Enum;

/* ===============================================  CMP0 CMP0_C0 CFR [26..26]  =============================================== */
typedef enum {                                  /*!< CMP0_C0_CFR                                                               */
  CMP0_C0_CFR_0                        = 0,     /*!< 0 : A rising edge has not been detected on COUT.                          */
  CMP0_C0_CFR_1                        = 1,     /*!< 1 : A rising edge on COUT has occurred.                                   */
} CMP0_C0_CFR_Enum;

/* ===============================================  CMP0 CMP0_C0 IEF [27..27]  =============================================== */
typedef enum {                                  /*!< CMP0_C0_IEF                                                               */
  CMP0_C0_IEF_0                        = 0,     /*!< 0 : Interrupt is disabled.                                                */
  CMP0_C0_IEF_1                        = 1,     /*!< 1 : Interrupt is enabled.                                                 */
} CMP0_C0_IEF_Enum;

/* ===============================================  CMP0 CMP0_C0 IER [28..28]  =============================================== */
typedef enum {                                  /*!< CMP0_C0_IER                                                               */
  CMP0_C0_IER_0                        = 0,     /*!< 0 : Interrupt is disabled.                                                */
  CMP0_C0_IER_1                        = 1,     /*!< 1 : Interrupt is enabled.                                                 */
} CMP0_C0_IER_Enum;

