nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  CMP0 CMP0_C2 NSAM [14..15]  =============================================== */
typedef enum {                                  /*!< CMP0_C2_NSAM                                                              */
  CMP0_C2_NSAM_00                      = 0,     /*!< 00 : The comparison result is sampled as soon as the active
                                                     channel is scanned in one round-robin clock.                              */
  CMP0_C2_NSAM_01                      = 1,     /*!< 01 : The sampling takes place 1 round-robin clock cycle after
                                                     the next cycle of the round-robin clock.                                  */
  CMP0_C2_NSAM_10                      = 2,     /*!< 10 : The sampling takes place 2 round-robin clock cycles after
                                                     the next cycle of the round-robin clock.                                  */
  CMP0_C2_NSAM_11                      = 3,     /*!< 11 : The sampling takes place 3 round-robin clock cycles after
                                                     the next cycle of the round-robin clock.                                  */
} CMP0_C2_NSAM_Enum;

/* =============================================  CMP0 CMP0_C2 FXMXCH [25..27]  ============================================== */
typedef enum {                                  /*!< CMP0_C2_FXMXCH                                                            */
  CMP0_C2_FXMXCH_000                   = 0,     /*!< 000 : Channel 0 is selected as the fixed reference input for
                                                     the fixed mux port.                                                       */
  CMP0_C2_FXMXCH_001                   = 1,     /*!< 001 : Channel 1 is selected as the fixed reference input for
                                                     the fixed mux port.                                                       */
  CMP0_C2_FXMXCH_010                   = 2,     /*!< 010 : Channel 2 is selected as the fixed reference input for
                                                     the fixed mux port.                                                       */
  CMP0_C2_FXMXCH_011                   = 3,     /*!< 011 : Channel 3 is selected as the fixed reference input for
                                                     the fixed mux port.                                                       */
  CMP0_C2_FXMXCH_100                   = 4,     /*!< 100 : Channel 4 is selected as the fixed reference input for
                                                     the fixed mux port.                                                       */
  CMP0_C2_FXMXCH_101                   = 5,     /*!< 101 : Channel 5 is selected as the fixed reference input for
                                                     the fixed mux port.                                                       */
  CMP0_C2_FXMXCH_110                   = 6,     /*!< 110 : Channel 6 is selected as the fixed reference input for
                                                     the fixed mux port.                                                       */
  CMP0_C2_FXMXCH_111                   = 7,     /*!< 111 : Channel 7 is selected as the fixed reference input for
                                                     the fixed mux port.                                                       */
} CMP0_C2_FXMXCH_Enum;

/* ==============================================  CMP0 CMP0_C2 FXMP [29..29]  =============================================== */
typedef enum {                                  /*!< CMP0_C2_FXMP                                                              */
  CMP0_C2_FXMP_0                       = 0,     /*!< 0 : The Plus port is fixed. Only the inputs to the Minus port
                                                     are swept in each round.                                                  */
  CMP0_C2_FXMP_1                       = 1,     /*!< 1 : The Minus port is fixed. Only the inputs to the Plus port
                                                     are swept in each round.                                                  */
} CMP0_C2_FXMP_Enum;

/* ==============================================  CMP0 CMP0_C2 RRIE [30..30]  =============================================== */
typedef enum {                                  /*!< CMP0_C2_RRIE                                                              */
  CMP0_C2_RRIE_0                       = 0,     /*!< 0 : The round-robin interrupt is disabled.                                */
  CMP0_C2_RRIE_1                       = 1,     /*!< 1 : The round-robin interrupt is enabled when a comparison result
                                                     changes from the last sample.                                             */
} CMP0_C2_RRIE_Enum;

/* ===============================================  CMP0 CMP0_C2 RRE [31..31]  =============================================== */
typedef enum {                                  /*!< CMP0_C2_RRE                                                               */
  CMP0_C2_RRE_0                        = 0,     /*!< 0 : Round-robin operation is disabled.                                    */
  CMP0_C2_RRE_1                        = 1,     /*!< 1 : Round-robin operation is enabled.                                     */
} CMP0_C2_RRE_Enum;



/* =========================================================================================================================== */
/* ================                                            PMC                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  PMC_LVDSC1  ======================================================= */
/* ==============================================  PMC PMC_LVDSC1 LVDRE [4..4]  ============================================== */
typedef enum {                                  /*!< PMC_LVDSC1_LVDRE                                                          */
  PMC_LVDSC1_LVDRE_0                   = 0,     /*!< 0 : No system resets on low voltage detect events.                        */
} PMC_LVDSC1_LVDRE_Enum;

/* ==============================================  PMC PMC_LVDSC1 LVDIE [5..5]  ============================================== */
typedef enum {                                  /*!< PMC_LVDSC1_LVDIE                                                          */
  PMC_LVDSC1_LVDIE_0                   = 0,     /*!< 0 : Hardware interrupt disabled (use polling)                             */
  PMC_LVDSC1_LVDIE_1                   = 1,     /*!< 1 : Request a hardware interrupt when LVDF = 1                            */
} PMC_LVDSC1_LVDIE_Enum;

