nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  PMC PMC_LVDSC1 LVDF [7..7]  =============================================== */
typedef enum {                                  /*!< PMC_LVDSC1_LVDF                                                           */
  PMC_LVDSC1_LVDF_0                    = 0,     /*!< 0 : Low-voltage event not detected                                        */
  PMC_LVDSC1_LVDF_1                    = 1,     /*!< 1 : Low-voltage event detected                                            */
} PMC_LVDSC1_LVDF_Enum;

/* ======================================================  PMC_LVDSC2  ======================================================= */
/* ==============================================  PMC PMC_LVDSC2 LVWIE [5..5]  ============================================== */
typedef enum {                                  /*!< PMC_LVDSC2_LVWIE                                                          */
  PMC_LVDSC2_LVWIE_0                   = 0,     /*!< 0 : Hardware interrupt disabled (use polling)                             */
  PMC_LVDSC2_LVWIE_1                   = 1,     /*!< 1 : Request a hardware interrupt when LVWF=1                              */
} PMC_LVDSC2_LVWIE_Enum;

/* ==============================================  PMC PMC_LVDSC2 LVWF [7..7]  =============================================== */
typedef enum {                                  /*!< PMC_LVDSC2_LVWF                                                           */
  PMC_LVDSC2_LVWF_0                    = 0,     /*!< 0 : Low-voltage warning event not detected                                */
  PMC_LVDSC2_LVWF_1                    = 1,     /*!< 1 : Low-voltage warning event detected                                    */
} PMC_LVDSC2_LVWF_Enum;

/* =======================================================  PMC_REGSC  ======================================================= */
/* ==============================================  PMC PMC_REGSC BIASEN [0..0]  ============================================== */
typedef enum {                                  /*!< PMC_REGSC_BIASEN                                                          */
  PMC_REGSC_BIASEN_0                   = 0,     /*!< 0 : Biasing disabled, core logic can run in full performance              */
  PMC_REGSC_BIASEN_1                   = 1,     /*!< 1 : Biasing enabled, core logic is slower and there are restrictions
                                                     in allowed system clock speed (see Data Sheet for details)                */
} PMC_REGSC_BIASEN_Enum;

/* ============================================  PMC PMC_REGSC CLKBIASDIS [1..1]  ============================================ */
typedef enum {                                  /*!< PMC_REGSC_CLKBIASDIS                                                      */
  PMC_REGSC_CLKBIASDIS_0               = 0,     /*!< 0 : No effect                                                             */
  PMC_REGSC_CLKBIASDIS_1               = 1,     /*!< 1 : In VLPS mode, the bias currents and reference voltages for
                                                     the following clock modules are disabled: SIRC, FIRC, PLL.
                                                     (if available on device)                                                  */
} PMC_REGSC_CLKBIASDIS_Enum;

/* ==============================================  PMC PMC_REGSC REGFPM [2..2]  ============================================== */
typedef enum {                                  /*!< PMC_REGSC_REGFPM                                                          */
  PMC_REGSC_REGFPM_0                   = 0,     /*!< 0 : Regulator is in low power mode or transition to/from                  */
  PMC_REGSC_REGFPM_1                   = 1,     /*!< 1 : Regulator is in full performance mode                                 */
} PMC_REGSC_REGFPM_Enum;

/* =============================================  PMC PMC_REGSC LPOSTAT [6..6]  ============================================== */
typedef enum {                                  /*!< PMC_REGSC_LPOSTAT                                                         */
  PMC_REGSC_LPOSTAT_0                  = 0,     /*!< 0 : Low power oscillator in low phase                                     */
  PMC_REGSC_LPOSTAT_1                  = 1,     /*!< 1 : Low power oscillator in high phase                                    */
} PMC_REGSC_LPOSTAT_Enum;

/* ==============================================  PMC PMC_REGSC LPODIS [7..7]  ============================================== */
typedef enum {                                  /*!< PMC_REGSC_LPODIS                                                          */
  PMC_REGSC_LPODIS_0                   = 0,     /*!< 0 : Low power oscillator enabled                                          */
  PMC_REGSC_LPODIS_1                   = 1,     /*!< 1 : Low power oscillator disabled                                         */
} PMC_REGSC_LPODIS_Enum;

/* ======================================================  PMC_LPOTRIM  ====================================================== */


/* =========================================================================================================================== */
/* ================                                            SMC                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  SMC_VERID  ======================================================= */
/* =============================================  SMC SMC_VERID FEATURE [0..15]  ============================================= */
typedef enum {                                  /*!< SMC_VERID_FEATURE                                                         */
  SMC_VERID_FEATURE_0                  = 0,     /*!< 0 : Standard features implemented                                         */
} SMC_VERID_FEATURE_Enum;

/* =======================================================  SMC_PARAM  ======================================================= */
/* ==============================================  SMC SMC_PARAM EHSRUN [0..0]  ============================================== */
typedef enum {                                  /*!< SMC_PARAM_EHSRUN                                                          */
  SMC_PARAM_EHSRUN_0                   = 0,     /*!< 0 : The feature is not available.                                         */
  SMC_PARAM_EHSRUN_1                   = 1,     /*!< 1 : The feature is available.                                             */
} SMC_PARAM_EHSRUN_Enum;

/* ===============================================  SMC SMC_PARAM ELLS [3..3]  =============================================== */
typedef enum {                                  /*!< SMC_PARAM_ELLS                                                            */
  SMC_PARAM_ELLS_0                     = 0,     /*!< 0 : The feature is not available.                                         */
  SMC_PARAM_ELLS_1                     = 1,     /*!< 1 : The feature is available.                                             */
} SMC_PARAM_ELLS_Enum;

/* ==============================================  SMC SMC_PARAM ELLS2 [5..5]  =============================================== */
typedef enum {                                  /*!< SMC_PARAM_ELLS2                                                           */
  SMC_PARAM_ELLS2_0                    = 0,     /*!< 0 : The feature is not available.                                         */
  SMC_PARAM_ELLS2_1                    = 1,     /*!< 1 : The feature is available.                                             */
} SMC_PARAM_ELLS2_Enum;

/* ==============================================  SMC SMC_PARAM EVLLS0 [6..6]  ============================================== */
typedef enum {                                  /*!< SMC_PARAM_EVLLS0                                                          */
  SMC_PARAM_EVLLS0_0                   = 0,     /*!< 0 : The feature is not available.                                         */
  SMC_PARAM_EVLLS0_1                   = 1,     /*!< 1 : The feature is available.                                             */
} SMC_PARAM_EVLLS0_Enum;

/* ======================================================  SMC_PMPROT  ======================================================= */
/* ==============================================  SMC SMC_PMPROT AVLP [5..5]  =============================================== */
typedef enum {                                  /*!< SMC_PMPROT_AVLP                                                           */
  SMC_PMPROT_AVLP_0                    = 0,     /*!< 0 : VLPR and VLPS are not allowed.                                        */
  SMC_PMPROT_AVLP_1                    = 1,     /*!< 1 : VLPR and VLPS are allowed.                                            */
} SMC_PMPROT_AVLP_Enum;

