nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ======================================================  SMC_PMCTRL  ======================================================= */
/* ==============================================  SMC SMC_PMCTRL STOPM [0..2]  ============================================== */
typedef enum {                                  /*!< SMC_PMCTRL_STOPM                                                          */
  SMC_PMCTRL_STOPM_000                 = 0,     /*!< 000 : Normal Stop (STOP)                                                  */
  SMC_PMCTRL_STOPM_010                 = 2,     /*!< 010 : Very-Low-Power Stop (VLPS)                                          */
  SMC_PMCTRL_STOPM_110                 = 6,     /*!< 110 : Reseved                                                             */
} SMC_PMCTRL_STOPM_Enum;

/* ==============================================  SMC SMC_PMCTRL VLPSA [3..3]  ============================================== */
typedef enum {                                  /*!< SMC_PMCTRL_VLPSA                                                          */
  SMC_PMCTRL_VLPSA_0                   = 0,     /*!< 0 : The previous stop mode entry was successful.                          */
  SMC_PMCTRL_VLPSA_1                   = 1,     /*!< 1 : The previous stop mode entry was aborted.                             */
} SMC_PMCTRL_VLPSA_Enum;

/* ==============================================  SMC SMC_PMCTRL RUNM [5..6]  =============================================== */
typedef enum {                                  /*!< SMC_PMCTRL_RUNM                                                           */
  SMC_PMCTRL_RUNM_00                   = 0,     /*!< 00 : Normal Run mode (RUN)                                                */
  SMC_PMCTRL_RUNM_10                   = 2,     /*!< 10 : Very-Low-Power Run mode (VLPR)                                       */
} SMC_PMCTRL_RUNM_Enum;

/* =====================================================  SMC_STOPCTRL  ====================================================== */
/* =============================================  SMC SMC_STOPCTRL STOPO [6..7]  ============================================= */
typedef enum {                                  /*!< SMC_STOPCTRL_STOPO                                                        */
  SMC_STOPCTRL_STOPO_01                = 1,     /*!< 01 : STOP1 - Stop with both system and bus clocks disabled                */
  SMC_STOPCTRL_STOPO_10                = 2,     /*!< 10 : STOP2 - Stop with system clock disabled and bus clock enabled        */
} SMC_STOPCTRL_STOPO_Enum;

/* ======================================================  SMC_PMSTAT  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            RCM                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  RCM_VERID  ======================================================= */
/* =============================================  RCM RCM_VERID FEATURE [0..15]  ============================================= */
typedef enum {                                  /*!< RCM_VERID_FEATURE                                                         */
  RCM_VERID_FEATURE_11                 = 3,     /*!< 11 : Standard feature set.                                                */
} RCM_VERID_FEATURE_Enum;

/* =======================================================  RCM_PARAM  ======================================================= */
/* =============================================  RCM RCM_PARAM EWAKEUP [0..0]  ============================================== */
typedef enum {                                  /*!< RCM_PARAM_EWAKEUP                                                         */
  RCM_PARAM_EWAKEUP_0                  = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_EWAKEUP_1                  = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_EWAKEUP_Enum;

/* ===============================================  RCM RCM_PARAM ELVD [1..1]  =============================================== */
typedef enum {                                  /*!< RCM_PARAM_ELVD                                                            */
  RCM_PARAM_ELVD_0                     = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ELVD_1                     = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ELVD_Enum;

/* ===============================================  RCM RCM_PARAM ELOC [2..2]  =============================================== */
typedef enum {                                  /*!< RCM_PARAM_ELOC                                                            */
  RCM_PARAM_ELOC_0                     = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ELOC_1                     = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ELOC_Enum;

/* ===============================================  RCM RCM_PARAM ELOL [3..3]  =============================================== */
typedef enum {                                  /*!< RCM_PARAM_ELOL                                                            */
  RCM_PARAM_ELOL_0                     = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ELOL_1                     = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ELOL_Enum;

/* =============================================  RCM RCM_PARAM ECMU_LOC [4..4]  ============================================= */
typedef enum {                                  /*!< RCM_PARAM_ECMU_LOC                                                        */
  RCM_PARAM_ECMU_LOC_0                 = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ECMU_LOC_1                 = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ECMU_LOC_Enum;

/* ==============================================  RCM RCM_PARAM EWDOG [5..5]  =============================================== */
typedef enum {                                  /*!< RCM_PARAM_EWDOG                                                           */
  RCM_PARAM_EWDOG_0                    = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_EWDOG_1                    = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_EWDOG_Enum;

/* ===============================================  RCM RCM_PARAM EPIN [6..6]  =============================================== */
typedef enum {                                  /*!< RCM_PARAM_EPIN                                                            */
  RCM_PARAM_EPIN_0                     = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_EPIN_1                     = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_EPIN_Enum;

