nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===============================================  RCM RCM_PARAM EPOR [7..7]  =============================================== */
typedef enum {                                  /*!< RCM_PARAM_EPOR                                                            */
  RCM_PARAM_EPOR_0                     = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_EPOR_1                     = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_EPOR_Enum;

/* ==============================================  RCM RCM_PARAM EJTAG [8..8]  =============================================== */
typedef enum {                                  /*!< RCM_PARAM_EJTAG                                                           */
  RCM_PARAM_EJTAG_0                    = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_EJTAG_1                    = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_EJTAG_Enum;

/* =============================================  RCM RCM_PARAM ELOCKUP [9..9]  ============================================== */
typedef enum {                                  /*!< RCM_PARAM_ELOCKUP                                                         */
  RCM_PARAM_ELOCKUP_0                  = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ELOCKUP_1                  = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ELOCKUP_Enum;

/* ==============================================  RCM RCM_PARAM ESW [10..10]  =============================================== */
typedef enum {                                  /*!< RCM_PARAM_ESW                                                             */
  RCM_PARAM_ESW_0                      = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ESW_1                      = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ESW_Enum;

/* ============================================  RCM RCM_PARAM EMDM_AP [11..11]  ============================================= */
typedef enum {                                  /*!< RCM_PARAM_EMDM_AP                                                         */
  RCM_PARAM_EMDM_AP_0                  = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_EMDM_AP_1                  = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_EMDM_AP_Enum;

/* ============================================  RCM RCM_PARAM ESACKERR [13..13]  ============================================ */
typedef enum {                                  /*!< RCM_PARAM_ESACKERR                                                        */
  RCM_PARAM_ESACKERR_0                 = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ESACKERR_1                 = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ESACKERR_Enum;

/* ============================================  RCM RCM_PARAM ETAMPER [15..15]  ============================================= */
typedef enum {                                  /*!< RCM_PARAM_ETAMPER                                                         */
  RCM_PARAM_ETAMPER_0                  = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ETAMPER_1                  = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ETAMPER_Enum;

/* =============================================  RCM RCM_PARAM ECORE1 [16..16]  ============================================= */
typedef enum {                                  /*!< RCM_PARAM_ECORE1                                                          */
  RCM_PARAM_ECORE1_0                   = 0,     /*!< 0 : The feature is not available.                                         */
  RCM_PARAM_ECORE1_1                   = 1,     /*!< 1 : The feature is available.                                             */
} RCM_PARAM_ECORE1_Enum;

/* ========================================================  RCM_SRS  ======================================================== */
/* ================================================  RCM RCM_SRS LVD [1..1]  ================================================= */
typedef enum {                                  /*!< RCM_SRS_LVD                                                               */
  RCM_SRS_LVD_0                        = 0,     /*!< 0 : Reset not caused by LVD trip, HVD trip or POR                         */
  RCM_SRS_LVD_1                        = 1,     /*!< 1 : Reset caused by LVD trip, HVD trip or POR                             */
} RCM_SRS_LVD_Enum;

/* ================================================  RCM RCM_SRS LOC [2..2]  ================================================= */
typedef enum {                                  /*!< RCM_SRS_LOC                                                               */
  RCM_SRS_LOC_0                        = 0,     /*!< 0 : Reset not caused by a loss of external clock.                         */
  RCM_SRS_LOC_1                        = 1,     /*!< 1 : Reset caused by a loss of external clock.                             */
} RCM_SRS_LOC_Enum;

/* ================================================  RCM RCM_SRS LOL [3..3]  ================================================= */
typedef enum {                                  /*!< RCM_SRS_LOL                                                               */
  RCM_SRS_LOL_0                        = 0,     /*!< 0 : Reset not caused by a loss of lock in the PLL/FLL                     */
  RCM_SRS_LOL_1                        = 1,     /*!< 1 : Reset caused by a loss of lock in the PLL/FLL                         */
} RCM_SRS_LOL_Enum;

/* ==============================================  RCM RCM_SRS CMU_LOC [4..4]  =============================================== */
typedef enum {                                  /*!< RCM_SRS_CMU_LOC                                                           */
  RCM_SRS_CMU_LOC_0                    = 0,     /*!< 0 : Reset not caused by the CMU loss-of-clock circuit.                    */
  RCM_SRS_CMU_LOC_1                    = 1,     /*!< 1 : Reset caused by the CMU loss-of-clock circuit.                        */
} RCM_SRS_CMU_LOC_Enum;

/* ================================================  RCM RCM_SRS WDOG [5..5]  ================================================ */
typedef enum {                                  /*!< RCM_SRS_WDOG                                                              */
  RCM_SRS_WDOG_0                       = 0,     /*!< 0 : Reset not caused by watchdog timeout                                  */
  RCM_SRS_WDOG_1                       = 1,     /*!< 1 : Reset caused by watchdog timeout                                      */
} RCM_SRS_WDOG_Enum;

/* ================================================  RCM RCM_SRS PIN [6..6]  ================================================= */
typedef enum {                                  /*!< RCM_SRS_PIN                                                               */
  RCM_SRS_PIN_0                        = 0,     /*!< 0 : Reset not caused by external reset pin                                */
  RCM_SRS_PIN_1                        = 1,     /*!< 1 : Reset caused by external reset pin                                    */
} RCM_SRS_PIN_Enum;

/* ================================================  RCM RCM_SRS POR [7..7]  ================================================= */
typedef enum {                                  /*!< RCM_SRS_POR                                                               */
  RCM_SRS_POR_0                        = 0,     /*!< 0 : Reset not caused by POR                                               */
  RCM_SRS_POR_1                        = 1,     /*!< 1 : Reset caused by POR                                                   */
} RCM_SRS_POR_Enum;

/* ================================================  RCM RCM_SRS JTAG [8..8]  ================================================ */
typedef enum {                                  /*!< RCM_SRS_JTAG                                                              */
  RCM_SRS_JTAG_0                       = 0,     /*!< 0 : Reset not caused by JTAG                                              */
  RCM_SRS_JTAG_1                       = 1,     /*!< 1 : Reset caused by JTAG                                                  */
} RCM_SRS_JTAG_Enum;

/* ===============================================  RCM RCM_SRS LOCKUP [9..9]  =============================================== */
typedef enum {                                  /*!< RCM_SRS_LOCKUP                                                            */
  RCM_SRS_LOCKUP_0                     = 0,     /*!< 0 : Reset not caused by core LOCKUP event                                 */
  RCM_SRS_LOCKUP_1                     = 1,     /*!< 1 : Reset caused by core LOCKUP event                                     */
} RCM_SRS_LOCKUP_Enum;

/* ================================================  RCM RCM_SRS SW [10..10]  ================================================ */
typedef enum {                                  /*!< RCM_SRS_SW                                                                */
  RCM_SRS_SW_0                         = 0,     /*!< 0 : Reset not caused by software setting of SYSRESETREQ bit               */
  RCM_SRS_SW_1                         = 1,     /*!< 1 : Reset caused by software setting of SYSRESETREQ bit                   */
} RCM_SRS_SW_Enum;

