nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  RCM RCM_SRS MDM_AP [11..11]  ============================================== */
typedef enum {                                  /*!< RCM_SRS_MDM_AP                                                            */
  RCM_SRS_MDM_AP_0                     = 0,     /*!< 0 : Reset was not caused by host debugger system setting of
                                                     the System Reset Request bit                                              */
  RCM_SRS_MDM_AP_1                     = 1,     /*!< 1 : Reset was caused by host debugger system setting of the
                                                     System Reset Request bit                                                  */
} RCM_SRS_MDM_AP_Enum;

/* =============================================  RCM RCM_SRS SACKERR [13..13]  ============================================== */
typedef enum {                                  /*!< RCM_SRS_SACKERR                                                           */
  RCM_SRS_SACKERR_0                    = 0,     /*!< 0 : Reset not caused by peripheral failure to acknowledge attempt
                                                     to enter stop mode                                                        */
  RCM_SRS_SACKERR_1                    = 1,     /*!< 1 : Reset caused by peripheral failure to acknowledge attempt
                                                     to enter stop mode                                                        */
} RCM_SRS_SACKERR_Enum;

/* ========================================================  RCM_RPC  ======================================================== */
/* =============================================  RCM RCM_RPC RSTFLTSRW [0..1]  ============================================== */
typedef enum {                                  /*!< RCM_RPC_RSTFLTSRW                                                         */
  RCM_RPC_RSTFLTSRW_00                 = 0,     /*!< 00 : All filtering disabled                                               */
  RCM_RPC_RSTFLTSRW_01                 = 1,     /*!< 01 : Bus clock filter enabled for normal operation                        */
  RCM_RPC_RSTFLTSRW_10                 = 2,     /*!< 10 : LPO clock filter enabled for normal operation                        */
} RCM_RPC_RSTFLTSRW_Enum;

/* ==============================================  RCM RCM_RPC RSTFLTSS [2..2]  ============================================== */
typedef enum {                                  /*!< RCM_RPC_RSTFLTSS                                                          */
  RCM_RPC_RSTFLTSS_0                   = 0,     /*!< 0 : All filtering disabled                                                */
  RCM_RPC_RSTFLTSS_1                   = 1,     /*!< 1 : LPO clock filter enabled                                              */
} RCM_RPC_RSTFLTSS_Enum;

/* =======================================================  RCM_SSRS  ======================================================== */
/* ===============================================  RCM RCM_SSRS SLVD [1..1]  ================================================ */
typedef enum {                                  /*!< RCM_SSRS_SLVD                                                             */
  RCM_SSRS_SLVD_0                      = 0,     /*!< 0 : Reset not caused by LVD trip or POR                                   */
  RCM_SSRS_SLVD_1                      = 1,     /*!< 1 : Reset caused by LVD trip or POR                                       */
} RCM_SSRS_SLVD_Enum;

/* ===============================================  RCM RCM_SSRS SLOC [2..2]  ================================================ */
typedef enum {                                  /*!< RCM_SSRS_SLOC                                                             */
  RCM_SSRS_SLOC_0                      = 0,     /*!< 0 : Reset not caused by a loss of external clock.                         */
  RCM_SSRS_SLOC_1                      = 1,     /*!< 1 : Reset caused by a loss of external clock.                             */
} RCM_SSRS_SLOC_Enum;

/* ===============================================  RCM RCM_SSRS SLOL [3..3]  ================================================ */
typedef enum {                                  /*!< RCM_SSRS_SLOL                                                             */
  RCM_SSRS_SLOL_0                      = 0,     /*!< 0 : Reset not caused by a loss of lock in the PLL/FLL                     */
  RCM_SSRS_SLOL_1                      = 1,     /*!< 1 : Reset caused by a loss of lock in the PLL/FLL                         */
} RCM_SSRS_SLOL_Enum;

/* =============================================  RCM RCM_SSRS SCMU_LOC [4..4]  ============================================== */
typedef enum {                                  /*!< RCM_SSRS_SCMU_LOC                                                         */
  RCM_SSRS_SCMU_LOC_0                  = 0,     /*!< 0 : Reset not caused by the CMU loss-of-clock circuit.                    */
  RCM_SSRS_SCMU_LOC_1                  = 1,     /*!< 1 : Reset caused by the CMU loss-of-clock circuit.                        */
} RCM_SSRS_SCMU_LOC_Enum;

/* ===============================================  RCM RCM_SSRS SWDOG [5..5]  =============================================== */
typedef enum {                                  /*!< RCM_SSRS_SWDOG                                                            */
  RCM_SSRS_SWDOG_0                     = 0,     /*!< 0 : Reset not caused by watchdog timeout                                  */
  RCM_SSRS_SWDOG_1                     = 1,     /*!< 1 : Reset caused by watchdog timeout                                      */
} RCM_SSRS_SWDOG_Enum;

/* ===============================================  RCM RCM_SSRS SPIN [6..6]  ================================================ */
typedef enum {                                  /*!< RCM_SSRS_SPIN                                                             */
  RCM_SSRS_SPIN_0                      = 0,     /*!< 0 : Reset not caused by external reset pin                                */
  RCM_SSRS_SPIN_1                      = 1,     /*!< 1 : Reset caused by external reset pin                                    */
} RCM_SSRS_SPIN_Enum;

