nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ===============================================  RCM RCM_SRIE WDOG [5..5]  ================================================ */
typedef enum {                                  /*!< RCM_SRIE_WDOG                                                             */
  RCM_SRIE_WDOG_0                      = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_WDOG_1                      = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_WDOG_Enum;

/* ================================================  RCM RCM_SRIE PIN [6..6]  ================================================ */
typedef enum {                                  /*!< RCM_SRIE_PIN                                                              */
  RCM_SRIE_PIN_0                       = 0,     /*!< 0 : Reset not caused by external reset pin                                */
  RCM_SRIE_PIN_1                       = 1,     /*!< 1 : Reset caused by external reset pin                                    */
} RCM_SRIE_PIN_Enum;

/* ================================================  RCM RCM_SRIE GIE [7..7]  ================================================ */
typedef enum {                                  /*!< RCM_SRIE_GIE                                                              */
  RCM_SRIE_GIE_0                       = 0,     /*!< 0 : All interrupt sources disabled.                                       */
  RCM_SRIE_GIE_1                       = 1,     /*!< 1 : All interrupt sources enabled. Note that the individual
                                                     interrupt-enable bits still need to be set to generate
                                                     interrupts.                                                               */
} RCM_SRIE_GIE_Enum;

/* ===============================================  RCM RCM_SRIE JTAG [8..8]  ================================================ */
typedef enum {                                  /*!< RCM_SRIE_JTAG                                                             */
  RCM_SRIE_JTAG_0                      = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_JTAG_1                      = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_JTAG_Enum;

/* ==============================================  RCM RCM_SRIE LOCKUP [9..9]  =============================================== */
typedef enum {                                  /*!< RCM_SRIE_LOCKUP                                                           */
  RCM_SRIE_LOCKUP_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_LOCKUP_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_LOCKUP_Enum;

/* ===============================================  RCM RCM_SRIE SW [10..10]  ================================================ */
typedef enum {                                  /*!< RCM_SRIE_SW                                                               */
  RCM_SRIE_SW_0                        = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_SW_1                        = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_SW_Enum;

/* =============================================  RCM RCM_SRIE MDM_AP [11..11]  ============================================== */
typedef enum {                                  /*!< RCM_SRIE_MDM_AP                                                           */
  RCM_SRIE_MDM_AP_0                    = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_MDM_AP_1                    = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_MDM_AP_Enum;

/* =============================================  RCM RCM_SRIE SACKERR [13..13]  ============================================= */
typedef enum {                                  /*!< RCM_SRIE_SACKERR                                                          */
  RCM_SRIE_SACKERR_0                   = 0,     /*!< 0 : Interrupt disabled.                                                   */
  RCM_SRIE_SACKERR_1                   = 1,     /*!< 1 : Interrupt enabled.                                                    */
} RCM_SRIE_SACKERR_Enum;



/* =========================================================================================================================== */
/* ================                                            PTA                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  GPIOA_PDOR  ======================================================= */
/* ======================================================  GPIOA_PSOR  ======================================================= */
/* ======================================================  GPIOA_PCOR  ======================================================= */
/* ======================================================  GPIOA_PTOR  ======================================================= */
/* ======================================================  GPIOA_PDIR  ======================================================= */
/* ======================================================  GPIOA_PDDR  ======================================================= */
/* ======================================================  GPIOA_PIDR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            PTB                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  GPIOB_PDOR  ======================================================= */
/* ======================================================  GPIOB_PSOR  ======================================================= */
/* ======================================================  GPIOB_PCOR  ======================================================= */
/* ======================================================  GPIOB_PTOR  ======================================================= */
/* ======================================================  GPIOB_PDIR  ======================================================= */
/* ======================================================  GPIOB_PDDR  ======================================================= */
/* ======================================================  GPIOB_PIDR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            PTC                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  GPIOC_PDOR  ======================================================= */
/* ======================================================  GPIOC_PSOR  ======================================================= */
/* ======================================================  GPIOC_PCOR  ======================================================= */
/* ======================================================  GPIOC_PTOR  ======================================================= */
/* ======================================================  GPIOC_PDIR  ======================================================= */
/* ======================================================  GPIOC_PDDR  ======================================================= */
/* ======================================================  GPIOC_PIDR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            PTD                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  GPIOD_PDOR  ======================================================= */
/* ======================================================  GPIOD_PSOR  ======================================================= */
/* ======================================================  GPIOD_PCOR  ======================================================= */
/* ======================================================  GPIOD_PTOR  ======================================================= */
/* ======================================================  GPIOD_PDIR  ======================================================= */
/* ======================================================  GPIOD_PDDR  ======================================================= */
/* ======================================================  GPIOD_PIDR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            PTE                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  GPIOE_PDOR  ======================================================= */
/* ======================================================  GPIOE_PSOR  ======================================================= */
/* ======================================================  GPIOE_PCOR  ======================================================= */
/* ======================================================  GPIOE_PTOR  ======================================================= */
/* ======================================================  GPIOE_PDIR  ======================================================= */
/* ======================================================  GPIOE_PDDR  ======================================================= */
/* ======================================================  GPIOE_PIDR  ======================================================= */


/* =========================================================================================================================== */
/* ================                                          S32_SCB                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  SCB_ACTLR  ======================================================= */
/* =======================================================  SCB_CPUID  ======================================================= */
/* =======================================================  SCB_ICSR  ======================================================== */
/* =========================================  S32_SCB SCB_ICSR ISRPENDING [22..22]  ========================================== */
typedef enum {                                  /*!< S32_SCB_ICSR_ISRPENDING                                                   */
  S32_SCB_ICSR_ISRPENDING_0            = 0,     /*!< 0 : interrupt not pending                                                 */
  S32_SCB_ICSR_ISRPENDING_1            = 1,     /*!< 1 : interrupt pending                                                     */
} S32_SCB_ICSR_ISRPENDING_Enum;

