nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==========================================  S32_SCB SCB_ICSR PENDSTCLR [25..25]  ========================================== */
typedef enum {                                  /*!< S32_SCB_ICSR_PENDSTCLR                                                    */
  S32_SCB_ICSR_PENDSTCLR_0             = 0,     /*!< 0 : no effect                                                             */
  S32_SCB_ICSR_PENDSTCLR_1             = 1,     /*!< 1 : removes the pending state from the SysTick exception                  */
} S32_SCB_ICSR_PENDSTCLR_Enum;

/* ==========================================  S32_SCB SCB_ICSR PENDSTSET [26..26]  ========================================== */
typedef enum {                                  /*!< S32_SCB_ICSR_PENDSTSET                                                    */
  S32_SCB_ICSR_PENDSTSET_0             = 0,     /*!< 0 : write: no effect; read: SysTick exception is not pending              */
  S32_SCB_ICSR_PENDSTSET_1             = 1,     /*!< 1 : write: changes SysTick exception state to pending; read:
                                                     SysTick exception is pending                                              */
} S32_SCB_ICSR_PENDSTSET_Enum;

/* ==========================================  S32_SCB SCB_ICSR PENDSVCLR [27..27]  ========================================== */
typedef enum {                                  /*!< S32_SCB_ICSR_PENDSVCLR                                                    */
  S32_SCB_ICSR_PENDSVCLR_0             = 0,     /*!< 0 : no effect                                                             */
  S32_SCB_ICSR_PENDSVCLR_1             = 1,     /*!< 1 : removes the pending state from the PendSV exception                   */
} S32_SCB_ICSR_PENDSVCLR_Enum;

/* ==========================================  S32_SCB SCB_ICSR PENDSVSET [28..28]  ========================================== */
typedef enum {                                  /*!< S32_SCB_ICSR_PENDSVSET                                                    */
  S32_SCB_ICSR_PENDSVSET_0             = 0,     /*!< 0 : write: no effect; read: PendSV exception is not pending               */
  S32_SCB_ICSR_PENDSVSET_1             = 1,     /*!< 1 : write: changes PendSV exception state to pending; read:
                                                     PendSV exception is pending                                               */
} S32_SCB_ICSR_PENDSVSET_Enum;

/* =========================================  S32_SCB SCB_ICSR NMIPENDSET [31..31]  ========================================== */
typedef enum {                                  /*!< S32_SCB_ICSR_NMIPENDSET                                                   */
  S32_SCB_ICSR_NMIPENDSET_0            = 0,     /*!< 0 : write: no effect; read: NMI exception is not pending                  */
  S32_SCB_ICSR_NMIPENDSET_1            = 1,     /*!< 1 : write: changes NMI exception state to pending; read: NMI
                                                     exception is pending                                                      */
} S32_SCB_ICSR_NMIPENDSET_Enum;

/* =======================================================  SCB_VTOR  ======================================================== */
/* =======================================================  SCB_AIRCR  ======================================================= */
/* =========================================  S32_SCB SCB_AIRCR SYSRESETREQ [2..2]  ========================================== */
typedef enum {                                  /*!< S32_SCB_AIRCR_SYSRESETREQ                                                 */
  S32_SCB_AIRCR_SYSRESETREQ_0          = 0,     /*!< 0 : no system reset request                                               */
  S32_SCB_AIRCR_SYSRESETREQ_1          = 1,     /*!< 1 : asserts a signal to the outer system that requests a reset            */
} S32_SCB_AIRCR_SYSRESETREQ_Enum;

/* =========================================  S32_SCB SCB_AIRCR ENDIANNESS [15..15]  ========================================= */
typedef enum {                                  /*!< S32_SCB_AIRCR_ENDIANNESS                                                  */
  S32_SCB_AIRCR_ENDIANNESS_0           = 0,     /*!< 0 : Little-endian                                                         */
  S32_SCB_AIRCR_ENDIANNESS_1           = 1,     /*!< 1 : Big-endian                                                            */
} S32_SCB_AIRCR_ENDIANNESS_Enum;

/* ========================================================  SCB_SCR  ======================================================== */
/* ==========================================  S32_SCB SCB_SCR SLEEPONEXIT [1..1]  =========================================== */
typedef enum {                                  /*!< S32_SCB_SCR_SLEEPONEXIT                                                   */
  S32_SCB_SCR_SLEEPONEXIT_0            = 0,     /*!< 0 : o not sleep when returning to Thread mode                             */
  S32_SCB_SCR_SLEEPONEXIT_1            = 1,     /*!< 1 : enter sleep, or deep sleep, on return from an ISR                     */
} S32_SCB_SCR_SLEEPONEXIT_Enum;

/* ===========================================  S32_SCB SCB_SCR SLEEPDEEP [2..2]  ============================================ */
typedef enum {                                  /*!< S32_SCB_SCR_SLEEPDEEP                                                     */
  S32_SCB_SCR_SLEEPDEEP_0              = 0,     /*!< 0 : sleep                                                                 */
  S32_SCB_SCR_SLEEPDEEP_1              = 1,     /*!< 1 : deep sleep                                                            */
} S32_SCB_SCR_SLEEPDEEP_Enum;

/* ===========================================  S32_SCB SCB_SCR SEVONPEND [4..4]  ============================================ */
typedef enum {                                  /*!< S32_SCB_SCR_SEVONPEND                                                     */
  S32_SCB_SCR_SEVONPEND_0              = 0,     /*!< 0 : only enabled interrupts or events can wakeup the processor,
                                                     disabled interrupts are excluded                                          */
  S32_SCB_SCR_SEVONPEND_1              = 1,     /*!< 1 : enabled events and all interrupts, including disabled interrupts,
                                                     can wakeup the processor                                                  */
} S32_SCB_SCR_SEVONPEND_Enum;

/* ========================================================  SCB_CCR  ======================================================== */
/* =======================================================  SCB_SHPR2  ======================================================= */
/* =======================================================  SCB_SHPR3  ======================================================= */
/* =======================================================  SCB_SHCSR  ======================================================= */
/* ========================================  S32_SCB SCB_SHCSR SVCALLPENDED [15..15]  ======================================== */
typedef enum {                                  /*!< S32_SCB_SHCSR_SVCALLPENDED                                                */
  S32_SCB_SHCSR_SVCALLPENDED_0         = 0,     /*!< 0 : exception is not pending                                              */
  S32_SCB_SHCSR_SVCALLPENDED_1         = 1,     /*!< 1 : exception is pending                                                  */
} S32_SCB_SHCSR_SVCALLPENDED_Enum;

/* =======================================================  SCB_DFSR  ======================================================== */
/* ============================================  S32_SCB SCB_DFSR HALTED [0..0]  ============================================= */
typedef enum {                                  /*!< S32_SCB_DFSR_HALTED                                                       */
  S32_SCB_DFSR_HALTED_0                = 0,     /*!< 0 : No active halt request debug event                                    */
  S32_SCB_DFSR_HALTED_1                = 1,     /*!< 1 : Halt request debug event active                                       */
} S32_SCB_DFSR_HALTED_Enum;

/* =============================================  S32_SCB SCB_DFSR BKPT [1..1]  ============================================== */
typedef enum {                                  /*!< S32_SCB_DFSR_BKPT                                                         */
  S32_SCB_DFSR_BKPT_0                  = 0,     /*!< 0 : No current breakpoint debug event                                     */
  S32_SCB_DFSR_BKPT_1                  = 1,     /*!< 1 : At least one current breakpoint debug event                           */
} S32_SCB_DFSR_BKPT_Enum;

/* ============================================  S32_SCB SCB_DFSR DWTTRAP [2..2]  ============================================ */
typedef enum {                                  /*!< S32_SCB_DFSR_DWTTRAP                                                      */
  S32_SCB_DFSR_DWTTRAP_0               = 0,     /*!< 0 : No current debug events generated by the DWT                          */
  S32_SCB_DFSR_DWTTRAP_1               = 1,     /*!< 1 : At least one current debug event generated by the DWT                 */
} S32_SCB_DFSR_DWTTRAP_Enum;

