nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  LMEM LMEM_PCCRMR R6 [18..19]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R6                                                            */
  LMEM_PCCRMR_R6_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R6_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R6_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R6_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R6_Enum;

/* =============================================  LMEM LMEM_PCCRMR R5 [20..21]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R5                                                            */
  LMEM_PCCRMR_R5_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R5_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R5_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R5_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R5_Enum;

/* =============================================  LMEM LMEM_PCCRMR R4 [22..23]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R4                                                            */
  LMEM_PCCRMR_R4_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R4_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R4_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R4_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R4_Enum;

/* =============================================  LMEM LMEM_PCCRMR R3 [24..25]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R3                                                            */
  LMEM_PCCRMR_R3_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R3_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R3_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R3_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R3_Enum;

/* =============================================  LMEM LMEM_PCCRMR R2 [26..27]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R2                                                            */
  LMEM_PCCRMR_R2_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R2_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R2_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R2_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R2_Enum;

/* =============================================  LMEM LMEM_PCCRMR R1 [28..29]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R1                                                            */
  LMEM_PCCRMR_R1_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R1_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R1_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R1_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R1_Enum;

/* =============================================  LMEM LMEM_PCCRMR R0 [30..31]  ============================================== */
typedef enum {                                  /*!< LMEM_PCCRMR_R0                                                            */
  LMEM_PCCRMR_R0_00                    = 0,     /*!< 00 : Non-cacheable                                                        */
  LMEM_PCCRMR_R0_01                    = 1,     /*!< 01 : Non-cacheable                                                        */
  LMEM_PCCRMR_R0_10                    = 2,     /*!< 10 : Write-through                                                        */
  LMEM_PCCRMR_R0_11                    = 3,     /*!< 11 : Write-back                                                           */
} LMEM_PCCRMR_R0_Enum;



/* =========================================================================================================================== */
/* ================                                          MTB_DWT                                          ================ */
/* =========================================================================================================================== */

/* =====================================================  MTB_DWT_CTRL  ====================================================== */
/* =====================================================  MTB_DWT_COMP0  ===================================================== */
/* =====================================================  MTB_DWT_COMP1  ===================================================== */
/* =====================================================  MTB_DWT_MASK0  ===================================================== */
/* =====================================================  MTB_DWT_MASK1  ===================================================== */
/* =====================================================  MTB_DWT_FCT0  ====================================================== */
/* =========================================  MTB_DWT MTB_DWT_FCT0 FUNCTION [0..3]  ========================================== */
typedef enum {                                  /*!< MTB_DWT_FCT0_FUNCTION                                                     */
  MTB_DWT_FCT0_FUNCTION_0000           = 0,     /*!< 0000 : Disabled.                                                          */
  MTB_DWT_FCT0_FUNCTION_0100           = 4,     /*!< 0100 : Instruction fetch.                                                 */
  MTB_DWT_FCT0_FUNCTION_0101           = 5,     /*!< 0101 : Data operand read.                                                 */
  MTB_DWT_FCT0_FUNCTION_0110           = 6,     /*!< 0110 : Data operand write.                                                */
  MTB_DWT_FCT0_FUNCTION_0111           = 7,     /*!< 0111 : Data operand (read + write).                                       */
} MTB_DWT_FCT0_FUNCTION_Enum;

/* ========================================  MTB_DWT MTB_DWT_FCT0 DATAVMATCH [8..8]  ========================================= */
typedef enum {                                  /*!< MTB_DWT_FCT0_DATAVMATCH                                                   */
  MTB_DWT_FCT0_DATAVMATCH_0            = 0,     /*!< 0 : Perform address comparison.                                           */
  MTB_DWT_FCT0_DATAVMATCH_1            = 1,     /*!< 1 : Perform data value comparison.                                        */
} MTB_DWT_FCT0_DATAVMATCH_Enum;

/* ========================================  MTB_DWT MTB_DWT_FCT0 DATAVSIZE [10..11]  ======================================== */
typedef enum {                                  /*!< MTB_DWT_FCT0_DATAVSIZE                                                    */
  MTB_DWT_FCT0_DATAVSIZE_00            = 0,     /*!< 00 : Byte.                                                                */
  MTB_DWT_FCT0_DATAVSIZE_01            = 1,     /*!< 01 : Halfword.                                                            */
  MTB_DWT_FCT0_DATAVSIZE_10            = 2,     /*!< 10 : Word.                                                                */
  MTB_DWT_FCT0_DATAVSIZE_11            = 3,     /*!< 11 : Reserved. Any attempts to use this value results in UNPREDICTABLE
                                                     behavior.                                                                 */
} MTB_DWT_FCT0_DATAVSIZE_Enum;

/* =========================================  MTB_DWT MTB_DWT_FCT0 MATCHED [24..24]  ========================================= */
typedef enum {                                  /*!< MTB_DWT_FCT0_MATCHED                                                      */
  MTB_DWT_FCT0_MATCHED_0               = 0,     /*!< 0 : No match.                                                             */
  MTB_DWT_FCT0_MATCHED_1               = 1,     /*!< 1 : Match occurred.                                                       */
} MTB_DWT_FCT0_MATCHED_Enum;

/* =====================================================  MTB_DWT_FCT1  ====================================================== */
/* =========================================  MTB_DWT MTB_DWT_FCT1 FUNCTION [0..3]  ========================================== */
typedef enum {                                  /*!< MTB_DWT_FCT1_FUNCTION                                                     */
  MTB_DWT_FCT1_FUNCTION_0000           = 0,     /*!< 0000 : Disabled.                                                          */
  MTB_DWT_FCT1_FUNCTION_0100           = 4,     /*!< 0100 : Instruction fetch.                                                 */
  MTB_DWT_FCT1_FUNCTION_0101           = 5,     /*!< 0101 : Data operand read.                                                 */
  MTB_DWT_FCT1_FUNCTION_0110           = 6,     /*!< 0110 : Data operand write.                                                */
  MTB_DWT_FCT1_FUNCTION_0111           = 7,     /*!< 0111 : Data operand (read + write).                                       */
} MTB_DWT_FCT1_FUNCTION_Enum;

