nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =========================================  MTB_DWT MTB_DWT_FCT1 MATCHED [24..24]  ========================================= */
typedef enum {                                  /*!< MTB_DWT_FCT1_MATCHED                                                      */
  MTB_DWT_FCT1_MATCHED_0               = 0,     /*!< 0 : No match.                                                             */
  MTB_DWT_FCT1_MATCHED_1               = 1,     /*!< 1 : Match occurred.                                                       */
} MTB_DWT_FCT1_MATCHED_Enum;

/* ====================================================  MTB_DWT_TBCTRL  ===================================================== */
/* =========================================  MTB_DWT MTB_DWT_TBCTRL ACOMP0 [0..0]  ========================================== */
typedef enum {                                  /*!< MTB_DWT_TBCTRL_ACOMP0                                                     */
  MTB_DWT_TBCTRL_ACOMP0_0              = 0,     /*!< 0 : Trigger TSTOP based on the assertion of MTBDWT_FCT0[MATCHED].         */
  MTB_DWT_TBCTRL_ACOMP0_1              = 1,     /*!< 1 : Trigger TSTART based on the assertion of MTBDWT_FCT0[MATCHED].        */
} MTB_DWT_TBCTRL_ACOMP0_Enum;

/* =========================================  MTB_DWT MTB_DWT_TBCTRL ACOMP1 [1..1]  ========================================== */
typedef enum {                                  /*!< MTB_DWT_TBCTRL_ACOMP1                                                     */
  MTB_DWT_TBCTRL_ACOMP1_0              = 0,     /*!< 0 : Trigger TSTOP based on the assertion of MTBDWT_FCT1[MATCHED].         */
  MTB_DWT_TBCTRL_ACOMP1_1              = 1,     /*!< 1 : Trigger TSTART based on the assertion of MTBDWT_FCT1[MATCHED].        */
} MTB_DWT_TBCTRL_ACOMP1_Enum;

/* ===================================================  MTB_DWT_DEVICECFG  =================================================== */
/* ==================================================  MTB_DWT_DEVICETYPID  ================================================== */
/* ===================================================  MTB_DWT_PERIPHID4  =================================================== */
/* ===================================================  MTB_DWT_PERIPHID5  =================================================== */
/* ===================================================  MTB_DWT_PERIPHID6  =================================================== */
/* ===================================================  MTB_DWT_PERIPHID7  =================================================== */
/* ===================================================  MTB_DWT_PERIPHID0  =================================================== */
/* ===================================================  MTB_DWT_PERIPHID1  =================================================== */
/* ===================================================  MTB_DWT_PERIPHID2  =================================================== */
/* ===================================================  MTB_DWT_PERIPHID3  =================================================== */
/* ====================================================  MTB_DWT_COMPID0  ==================================================== */
/* ====================================================  MTB_DWT_COMPID1  ==================================================== */
/* ====================================================  MTB_DWT_COMPID2  ==================================================== */
/* ====================================================  MTB_DWT_COMPID3  ==================================================== */


/* =========================================================================================================================== */
/* ================                                            MCM                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  MCM_PLASC  ======================================================= */
/* ===============================================  MCM MCM_PLASC ASC [0..7]  ================================================ */
typedef enum {                                  /*!< MCM_PLASC_ASC                                                             */
  MCM_PLASC_ASC_0                      = 0,     /*!< 0 : A bus slave connection to AXBS input port n is absent                 */
  MCM_PLASC_ASC_1                      = 1,     /*!< 1 : A bus slave connection to AXBS input port n is present                */
} MCM_PLASC_ASC_Enum;

/* =======================================================  MCM_PLAMC  ======================================================= */
/* ===============================================  MCM MCM_PLAMC AMC [0..7]  ================================================ */
typedef enum {                                  /*!< MCM_PLAMC_AMC                                                             */
  MCM_PLAMC_AMC_0                      = 0,     /*!< 0 : A bus master connection to AXBS input port n is absent                */
  MCM_PLAMC_AMC_1                      = 1,     /*!< 1 : A bus master connection to AXBS input port n is present               */
} MCM_PLAMC_AMC_Enum;

/* =======================================================  MCM_CPCR  ======================================================== */
/* ============================================  MCM MCM_CPCR HLT_FSM_ST [0..1]  ============================================= */
typedef enum {                                  /*!< MCM_CPCR_HLT_FSM_ST                                                       */
  MCM_CPCR_HLT_FSM_ST_00               = 0,     /*!< 00 : Waiting for request                                                  */
  MCM_CPCR_HLT_FSM_ST_01               = 1,     /*!< 01 : Waiting for platform idle                                            */
  MCM_CPCR_HLT_FSM_ST_11               = 3,     /*!< 11 : Platform stalled                                                     */
  MCM_CPCR_HLT_FSM_ST_10               = 2,     /*!< 10 : Unused state                                                         */
} MCM_CPCR_HLT_FSM_ST_Enum;

/* ===========================================  MCM MCM_CPCR AXBS_HLT_REQ [2..2]  ============================================ */
typedef enum {                                  /*!< MCM_CPCR_AXBS_HLT_REQ                                                     */
  MCM_CPCR_AXBS_HLT_REQ_0              = 0,     /*!< 0 : AXBS is not receiving halt request                                    */
  MCM_CPCR_AXBS_HLT_REQ_1              = 1,     /*!< 1 : AXBS is receiving halt request                                        */
} MCM_CPCR_AXBS_HLT_REQ_Enum;

