nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* =============================================  MCM MCM_CPCR AXBS_HLTD [3..3]  ============================================= */
typedef enum {                                  /*!< MCM_CPCR_AXBS_HLTD                                                        */
  MCM_CPCR_AXBS_HLTD_0                 = 0,     /*!< 0 : AXBS is not currently halted                                          */
  MCM_CPCR_AXBS_HLTD_1                 = 1,     /*!< 1 : AXBS is currently halted                                              */
} MCM_CPCR_AXBS_HLTD_Enum;

/* ============================================  MCM MCM_CPCR FMC_PF_IDLE [4..4]  ============================================ */
typedef enum {                                  /*!< MCM_CPCR_FMC_PF_IDLE                                                      */
  MCM_CPCR_FMC_PF_IDLE_0               = 0,     /*!< 0 : FMC program flash is not idle                                         */
  MCM_CPCR_FMC_PF_IDLE_1               = 1,     /*!< 1 : FMC program flash is currently idle                                   */
} MCM_CPCR_FMC_PF_IDLE_Enum;

/* ===========================================  MCM MCM_CPCR PBRIDGE_IDLE [6..6]  ============================================ */
typedef enum {                                  /*!< MCM_CPCR_PBRIDGE_IDLE                                                     */
  MCM_CPCR_PBRIDGE_IDLE_0              = 0,     /*!< 0 : PBRIDGE is not idle                                                   */
  MCM_CPCR_PBRIDGE_IDLE_1              = 1,     /*!< 1 : PBRIDGE is currently idle                                             */
} MCM_CPCR_PBRIDGE_IDLE_Enum;

/* ===============================================  MCM MCM_CPCR CBRR [9..9]  ================================================ */
typedef enum {                                  /*!< MCM_CPCR_CBRR                                                             */
  MCM_CPCR_CBRR_0                      = 0,     /*!< 0 : Fixed-priority arbitration                                            */
  MCM_CPCR_CBRR_1                      = 1,     /*!< 1 : Round-robin arbitration                                               */
} MCM_CPCR_CBRR_Enum;

/* ========================================================  MCM_PID  ======================================================== */
/* ========================================================  MCM_CPO  ======================================================== */
/* ===============================================  MCM MCM_CPO CPOREQ [0..0]  =============================================== */
typedef enum {                                  /*!< MCM_CPO_CPOREQ                                                            */
  MCM_CPO_CPOREQ_0                     = 0,     /*!< 0 : Request is cleared.                                                   */
  MCM_CPO_CPOREQ_1                     = 1,     /*!< 1 : Request Compute Operation.                                            */
} MCM_CPO_CPOREQ_Enum;

/* ===============================================  MCM MCM_CPO CPOACK [1..1]  =============================================== */
typedef enum {                                  /*!< MCM_CPO_CPOACK                                                            */
  MCM_CPO_CPOACK_0                     = 0,     /*!< 0 : Compute operation entry has not completed or compute operation
                                                     exit has completed.                                                       */
  MCM_CPO_CPOACK_1                     = 1,     /*!< 1 : Compute operation entry has completed or compute operation
                                                     exit has not completed.                                                   */
} MCM_CPO_CPOACK_Enum;

/* ===============================================  MCM MCM_CPO CPOWOI [2..2]  =============================================== */
typedef enum {                                  /*!< MCM_CPO_CPOWOI                                                            */
  MCM_CPO_CPOWOI_0                     = 0,     /*!< 0 : No effect.                                                            */
  MCM_CPO_CPOWOI_1                     = 1,     /*!< 1 : When set, the CPOREQ is cleared on any interrupt or exception
                                                     vector fetch.                                                             */
} MCM_CPO_CPOWOI_Enum;

/* =======================================================  MCM_LMDR0  ======================================================= */
/* ===============================================  MCM MCM_LMDR0 MT [13..15]  =============================================== */
typedef enum {                                  /*!< MCM_LMDR0_MT                                                              */
  MCM_LMDR0_MT_000                     = 0,     /*!< 000 : SRAM_L                                                              */
  MCM_LMDR0_MT_001                     = 1,     /*!< 001 : SRAM_U                                                              */
} MCM_LMDR0_MT_Enum;

/* ==============================================  MCM MCM_LMDR0 DPW [17..19]  =============================================== */
typedef enum {                                  /*!< MCM_LMDR0_DPW                                                             */
  MCM_LMDR0_DPW_010                    = 2,     /*!< 010 : LMEMn 32-bits wide                                                  */
  MCM_LMDR0_DPW_011                    = 3,     /*!< 011 : LMEMn 64-bits wide                                                  */
} MCM_LMDR0_DPW_Enum;

/* ===============================================  MCM MCM_LMDR0 WY [20..23]  =============================================== */
typedef enum {                                  /*!< MCM_LMDR0_WY                                                              */
  MCM_LMDR0_WY_0000                    = 0,     /*!< 0000 : No Cache                                                           */
  MCM_LMDR0_WY_0010                    = 2,     /*!< 0010 : 2-Way Set Associative                                              */
  MCM_LMDR0_WY_0100                    = 4,     /*!< 0100 : 4-Way Set Associative                                              */
} MCM_LMDR0_WY_Enum;

/* ==============================================  MCM MCM_LMDR0 LMSZ [24..27]  ============================================== */
typedef enum {                                  /*!< MCM_LMDR0_LMSZ                                                            */
  MCM_LMDR0_LMSZ_0000                  = 0,     /*!< 0000 : no LMEMn (0 KB)                                                    */
  MCM_LMDR0_LMSZ_0001                  = 1,     /*!< 0001 : 1 KB LMEMn                                                         */
  MCM_LMDR0_LMSZ_0010                  = 2,     /*!< 0010 : 2 KB LMEMn                                                         */
  MCM_LMDR0_LMSZ_0011                  = 3,     /*!< 0011 : 4 KB LMEMn                                                         */
  MCM_LMDR0_LMSZ_0100                  = 4,     /*!< 0100 : 8 KB LMEMn                                                         */
  MCM_LMDR0_LMSZ_0101                  = 5,     /*!< 0101 : 16 KB LMEMn                                                        */
  MCM_LMDR0_LMSZ_0110                  = 6,     /*!< 0110 : 32 KB LMEMn                                                        */
  MCM_LMDR0_LMSZ_0111                  = 7,     /*!< 0111 : 64 KB LMEMn                                                        */
  MCM_LMDR0_LMSZ_1000                  = 8,     /*!< 1000 : 128 KB LMEMn                                                       */
  MCM_LMDR0_LMSZ_1001                  = 9,     /*!< 1001 : 256 KB LMEMn                                                       */
  MCM_LMDR0_LMSZ_1010                  = 10,    /*!< 1010 : 512 KB LMEMn                                                       */
  MCM_LMDR0_LMSZ_1011                  = 11,    /*!< 1011 : 1024 KB LMEMn                                                      */
  MCM_LMDR0_LMSZ_1100                  = 12,    /*!< 1100 : 2048 KB LMEMn                                                      */
  MCM_LMDR0_LMSZ_1101                  = 13,    /*!< 1101 : 4096 KB LMEMn                                                      */
  MCM_LMDR0_LMSZ_1110                  = 14,    /*!< 1110 : 8192 KB LMEMn                                                      */
  MCM_LMDR0_LMSZ_1111                  = 15,    /*!< 1111 : 16384 KB LMEMn                                                     */
} MCM_LMDR0_LMSZ_Enum;

/* =============================================  MCM MCM_LMDR0 LMSZH [28..28]  ============================================== */
typedef enum {                                  /*!< MCM_LMDR0_LMSZH                                                           */
  MCM_LMDR0_LMSZH_0                    = 0,     /*!< 0 : LMEMn is a power-of-2 capacity.                                       */
  MCM_LMDR0_LMSZH_1                    = 1,     /*!< 1 : LMEMn is not a power-of-2, with a capacity is 0.75 * LMSZ.            */
} MCM_LMDR0_LMSZH_Enum;

/* ===============================================  MCM MCM_LMDR0 V [31..31]  ================================================ */
typedef enum {                                  /*!< MCM_LMDR0_V                                                               */
  MCM_LMDR0_V_0                        = 0,     /*!< 0 : LMEMn is not present.                                                 */
  MCM_LMDR0_V_1                        = 1,     /*!< 1 : LMEMn is present.                                                     */
} MCM_LMDR0_V_Enum;

/* =======================================================  MCM_LMDR1  ======================================================= */
/* ===============================================  MCM MCM_LMDR1 MT [13..15]  =============================================== */
typedef enum {                                  /*!< MCM_LMDR1_MT                                                              */
  MCM_LMDR1_MT_000                     = 0,     /*!< 000 : SRAM_L                                                              */
  MCM_LMDR1_MT_001                     = 1,     /*!< 001 : SRAM_U                                                              */
} MCM_LMDR1_MT_Enum;

/* ==============================================  MCM MCM_LMDR1 DPW [17..19]  =============================================== */
typedef enum {                                  /*!< MCM_LMDR1_DPW                                                             */
  MCM_LMDR1_DPW_010                    = 2,     /*!< 010 : LMEMn 32-bits wide                                                  */
  MCM_LMDR1_DPW_011                    = 3,     /*!< 011 : LMEMn 64-bits wide                                                  */
} MCM_LMDR1_DPW_Enum;

/* ===============================================  MCM MCM_LMDR1 WY [20..23]  =============================================== */
typedef enum {                                  /*!< MCM_LMDR1_WY                                                              */
  MCM_LMDR1_WY_0000                    = 0,     /*!< 0000 : No Cache                                                           */
  MCM_LMDR1_WY_0010                    = 2,     /*!< 0010 : 2-Way Set Associative                                              */
  MCM_LMDR1_WY_0100                    = 4,     /*!< 0100 : 4-Way Set Associative                                              */
} MCM_LMDR1_WY_Enum;

