nxp-auto-support/s32k116_cookbook/S32K116_Project_FlexCan_ClassicFrames/include/register_bit_fields.h
/* ==============================================  MCM MCM_LMDR1 LMSZ [24..27]  ============================================== */
typedef enum {                                  /*!< MCM_LMDR1_LMSZ                                                            */
  MCM_LMDR1_LMSZ_0000                  = 0,     /*!< 0000 : no LMEMn (0 KB)                                                    */
  MCM_LMDR1_LMSZ_0001                  = 1,     /*!< 0001 : 1 KB LMEMn                                                         */
  MCM_LMDR1_LMSZ_0010                  = 2,     /*!< 0010 : 2 KB LMEMn                                                         */
  MCM_LMDR1_LMSZ_0011                  = 3,     /*!< 0011 : 4 KB LMEMn                                                         */
  MCM_LMDR1_LMSZ_0100                  = 4,     /*!< 0100 : 8 KB LMEMn                                                         */
  MCM_LMDR1_LMSZ_0101                  = 5,     /*!< 0101 : 16 KB LMEMn                                                        */
  MCM_LMDR1_LMSZ_0110                  = 6,     /*!< 0110 : 32 KB LMEMn                                                        */
  MCM_LMDR1_LMSZ_0111                  = 7,     /*!< 0111 : 64 KB LMEMn                                                        */
  MCM_LMDR1_LMSZ_1000                  = 8,     /*!< 1000 : 128 KB LMEMn                                                       */
  MCM_LMDR1_LMSZ_1001                  = 9,     /*!< 1001 : 256 KB LMEMn                                                       */
  MCM_LMDR1_LMSZ_1010                  = 10,    /*!< 1010 : 512 KB LMEMn                                                       */
  MCM_LMDR1_LMSZ_1011                  = 11,    /*!< 1011 : 1024 KB LMEMn                                                      */
  MCM_LMDR1_LMSZ_1100                  = 12,    /*!< 1100 : 2048 KB LMEMn                                                      */
  MCM_LMDR1_LMSZ_1101                  = 13,    /*!< 1101 : 4096 KB LMEMn                                                      */
  MCM_LMDR1_LMSZ_1110                  = 14,    /*!< 1110 : 8192 KB LMEMn                                                      */
  MCM_LMDR1_LMSZ_1111                  = 15,    /*!< 1111 : 16384 KB LMEMn                                                     */
} MCM_LMDR1_LMSZ_Enum;

/* =============================================  MCM MCM_LMDR1 LMSZH [28..28]  ============================================== */
typedef enum {                                  /*!< MCM_LMDR1_LMSZH                                                           */
  MCM_LMDR1_LMSZH_0                    = 0,     /*!< 0 : LMEMn is a power-of-2 capacity.                                       */
  MCM_LMDR1_LMSZH_1                    = 1,     /*!< 1 : LMEMn is not a power-of-2, with a capacity is 0.75 * LMSZ.            */
} MCM_LMDR1_LMSZH_Enum;

/* ===============================================  MCM MCM_LMDR1 V [31..31]  ================================================ */
typedef enum {                                  /*!< MCM_LMDR1_V                                                               */
  MCM_LMDR1_V_0                        = 0,     /*!< 0 : LMEMn is not present.                                                 */
  MCM_LMDR1_V_1                        = 1,     /*!< 1 : LMEMn is present.                                                     */
} MCM_LMDR1_V_Enum;

/* ======================================================  MCM_LMPECR  ======================================================= */
/* ======================================================  MCM_LMPEIR  ======================================================= */
/* ============================================  MCM MCM_LMPEIR PEELOC [24..28]  ============================================= */
typedef enum {                                  /*!< MCM_LMPEIR_PEELOC                                                         */
  MCM_LMPEIR_PEELOC_00                 = 0,     /*!< 00 : Non-correctable ECC event from SRAM_L                                */
  MCM_LMPEIR_PEELOC_01                 = 1,     /*!< 01 : Non-correctable ECC event from SRAM_U                                */
} MCM_LMPEIR_PEELOC_Enum;

/* =======================================================  MCM_LMFAR  ======================================================= */
/* ======================================================  MCM_LMFATR  ======================================================= */
/* =============================================  MCM MCM_LMFATR PEFSIZE [4..6]  ============================================= */
typedef enum {                                  /*!< MCM_LMFATR_PEFSIZE                                                        */
  MCM_LMFATR_PEFSIZE_000               = 0,     /*!< 000 : 8-bit access                                                        */
  MCM_LMFATR_PEFSIZE_001               = 1,     /*!< 001 : 16-bit access                                                       */
  MCM_LMFATR_PEFSIZE_010               = 2,     /*!< 010 : 32-bit access                                                       */
  MCM_LMFATR_PEFSIZE_011               = 3,     /*!< 011 : 64-bit access                                                       */
} MCM_LMFATR_PEFSIZE_Enum;

/* ======================================================  MCM_LMFDHR  ======================================================= */
/* ======================================================  MCM_LMFDLR  ======================================================= */

/** @} */ /* End of group EnumValue_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* S32K116_H */


/** @} */ /* End of group S32K116 */

/** @} */ /* End of group NXP */
